// Generated by jextract

package dev.equo.ewt.ffm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     int id;
 *     DartObj leading;
 *     int automaticallyImplyLeading;
 *     DartObj title;
 *     int automaticallyImplyActions;
 *     DartObj flexibleSpace;
 *     DartObj bottom;
 *     double elevation;
 *     double scrolledUnderElevation;
 *     DartObj shadowColor;
 *     DartObj surfaceTintColor;
 *     DartObj shape;
 *     DartObj backgroundColor;
 *     DartObj foregroundColor;
 *     int primary;
 *     int centerTitle;
 *     int excludeHeaderSemantics;
 *     double titleSpacing;
 *     double toolbarOpacity;
 *     double bottomOpacity;
 *     double toolbarHeight;
 *     double leadingWidth;
 *     TextStyleObjSt toolbarTextStyle;
 *     TextStyleObjSt titleTextStyle;
 *     int forceMaterialTransparency;
 *     int useDefaultSemanticsOrder;
 *     int clipBehavior;
 *     DartObj actionsPadding;
 *     int animateColor;
 * }
 * }
 */
public class AppBarObjSt {

    AppBarObjSt() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        StarterBridge.C_INT.withName("id"),
        StarterBridge.C_INT.withName("leading"),
        StarterBridge.C_INT.withName("automaticallyImplyLeading"),
        StarterBridge.C_INT.withName("title"),
        StarterBridge.C_INT.withName("automaticallyImplyActions"),
        StarterBridge.C_INT.withName("flexibleSpace"),
        StarterBridge.C_INT.withName("bottom"),
        MemoryLayout.paddingLayout(4),
        StarterBridge.C_DOUBLE.withName("elevation"),
        StarterBridge.C_DOUBLE.withName("scrolledUnderElevation"),
        StarterBridge.C_INT.withName("shadowColor"),
        StarterBridge.C_INT.withName("surfaceTintColor"),
        StarterBridge.C_INT.withName("shape"),
        StarterBridge.C_INT.withName("backgroundColor"),
        StarterBridge.C_INT.withName("foregroundColor"),
        StarterBridge.C_INT.withName("primary"),
        StarterBridge.C_INT.withName("centerTitle"),
        StarterBridge.C_INT.withName("excludeHeaderSemantics"),
        StarterBridge.C_DOUBLE.withName("titleSpacing"),
        StarterBridge.C_DOUBLE.withName("toolbarOpacity"),
        StarterBridge.C_DOUBLE.withName("bottomOpacity"),
        StarterBridge.C_DOUBLE.withName("toolbarHeight"),
        StarterBridge.C_DOUBLE.withName("leadingWidth"),
        TextStyleObjSt.layout().withName("toolbarTextStyle"),
        TextStyleObjSt.layout().withName("titleTextStyle"),
        StarterBridge.C_INT.withName("forceMaterialTransparency"),
        StarterBridge.C_INT.withName("useDefaultSemanticsOrder"),
        StarterBridge.C_INT.withName("clipBehavior"),
        StarterBridge.C_INT.withName("actionsPadding"),
        StarterBridge.C_INT.withName("animateColor"),
        MemoryLayout.paddingLayout(4)
    ).withName("$anon$505:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt id$LAYOUT = (OfInt)$LAYOUT.select(groupElement("id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final OfInt id$layout() {
        return id$LAYOUT;
    }

    private static final long id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final long id$offset() {
        return id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static int id(MemorySegment struct) {
        return struct.get(id$LAYOUT, id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static void id(MemorySegment struct, int fieldValue) {
        struct.set(id$LAYOUT, id$OFFSET, fieldValue);
    }

    private static final OfInt leading$LAYOUT = (OfInt)$LAYOUT.select(groupElement("leading"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj leading
     * }
     */
    public static final OfInt leading$layout() {
        return leading$LAYOUT;
    }

    private static final long leading$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj leading
     * }
     */
    public static final long leading$offset() {
        return leading$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj leading
     * }
     */
    public static int leading(MemorySegment struct) {
        return struct.get(leading$LAYOUT, leading$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj leading
     * }
     */
    public static void leading(MemorySegment struct, int fieldValue) {
        struct.set(leading$LAYOUT, leading$OFFSET, fieldValue);
    }

    private static final OfInt automaticallyImplyLeading$LAYOUT = (OfInt)$LAYOUT.select(groupElement("automaticallyImplyLeading"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int automaticallyImplyLeading
     * }
     */
    public static final OfInt automaticallyImplyLeading$layout() {
        return automaticallyImplyLeading$LAYOUT;
    }

    private static final long automaticallyImplyLeading$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int automaticallyImplyLeading
     * }
     */
    public static final long automaticallyImplyLeading$offset() {
        return automaticallyImplyLeading$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int automaticallyImplyLeading
     * }
     */
    public static int automaticallyImplyLeading(MemorySegment struct) {
        return struct.get(automaticallyImplyLeading$LAYOUT, automaticallyImplyLeading$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int automaticallyImplyLeading
     * }
     */
    public static void automaticallyImplyLeading(MemorySegment struct, int fieldValue) {
        struct.set(automaticallyImplyLeading$LAYOUT, automaticallyImplyLeading$OFFSET, fieldValue);
    }

    private static final OfInt title$LAYOUT = (OfInt)$LAYOUT.select(groupElement("title"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj title
     * }
     */
    public static final OfInt title$layout() {
        return title$LAYOUT;
    }

    private static final long title$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj title
     * }
     */
    public static final long title$offset() {
        return title$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj title
     * }
     */
    public static int title(MemorySegment struct) {
        return struct.get(title$LAYOUT, title$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj title
     * }
     */
    public static void title(MemorySegment struct, int fieldValue) {
        struct.set(title$LAYOUT, title$OFFSET, fieldValue);
    }

    private static final OfInt automaticallyImplyActions$LAYOUT = (OfInt)$LAYOUT.select(groupElement("automaticallyImplyActions"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int automaticallyImplyActions
     * }
     */
    public static final OfInt automaticallyImplyActions$layout() {
        return automaticallyImplyActions$LAYOUT;
    }

    private static final long automaticallyImplyActions$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int automaticallyImplyActions
     * }
     */
    public static final long automaticallyImplyActions$offset() {
        return automaticallyImplyActions$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int automaticallyImplyActions
     * }
     */
    public static int automaticallyImplyActions(MemorySegment struct) {
        return struct.get(automaticallyImplyActions$LAYOUT, automaticallyImplyActions$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int automaticallyImplyActions
     * }
     */
    public static void automaticallyImplyActions(MemorySegment struct, int fieldValue) {
        struct.set(automaticallyImplyActions$LAYOUT, automaticallyImplyActions$OFFSET, fieldValue);
    }

    private static final OfInt flexibleSpace$LAYOUT = (OfInt)$LAYOUT.select(groupElement("flexibleSpace"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj flexibleSpace
     * }
     */
    public static final OfInt flexibleSpace$layout() {
        return flexibleSpace$LAYOUT;
    }

    private static final long flexibleSpace$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj flexibleSpace
     * }
     */
    public static final long flexibleSpace$offset() {
        return flexibleSpace$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj flexibleSpace
     * }
     */
    public static int flexibleSpace(MemorySegment struct) {
        return struct.get(flexibleSpace$LAYOUT, flexibleSpace$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj flexibleSpace
     * }
     */
    public static void flexibleSpace(MemorySegment struct, int fieldValue) {
        struct.set(flexibleSpace$LAYOUT, flexibleSpace$OFFSET, fieldValue);
    }

    private static final OfInt bottom$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bottom"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj bottom
     * }
     */
    public static final OfInt bottom$layout() {
        return bottom$LAYOUT;
    }

    private static final long bottom$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj bottom
     * }
     */
    public static final long bottom$offset() {
        return bottom$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj bottom
     * }
     */
    public static int bottom(MemorySegment struct) {
        return struct.get(bottom$LAYOUT, bottom$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj bottom
     * }
     */
    public static void bottom(MemorySegment struct, int fieldValue) {
        struct.set(bottom$LAYOUT, bottom$OFFSET, fieldValue);
    }

    private static final OfDouble elevation$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("elevation"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double elevation
     * }
     */
    public static final OfDouble elevation$layout() {
        return elevation$LAYOUT;
    }

    private static final long elevation$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double elevation
     * }
     */
    public static final long elevation$offset() {
        return elevation$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double elevation
     * }
     */
    public static double elevation(MemorySegment struct) {
        return struct.get(elevation$LAYOUT, elevation$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double elevation
     * }
     */
    public static void elevation(MemorySegment struct, double fieldValue) {
        struct.set(elevation$LAYOUT, elevation$OFFSET, fieldValue);
    }

    private static final OfDouble scrolledUnderElevation$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("scrolledUnderElevation"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double scrolledUnderElevation
     * }
     */
    public static final OfDouble scrolledUnderElevation$layout() {
        return scrolledUnderElevation$LAYOUT;
    }

    private static final long scrolledUnderElevation$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double scrolledUnderElevation
     * }
     */
    public static final long scrolledUnderElevation$offset() {
        return scrolledUnderElevation$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double scrolledUnderElevation
     * }
     */
    public static double scrolledUnderElevation(MemorySegment struct) {
        return struct.get(scrolledUnderElevation$LAYOUT, scrolledUnderElevation$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double scrolledUnderElevation
     * }
     */
    public static void scrolledUnderElevation(MemorySegment struct, double fieldValue) {
        struct.set(scrolledUnderElevation$LAYOUT, scrolledUnderElevation$OFFSET, fieldValue);
    }

    private static final OfInt shadowColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("shadowColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj shadowColor
     * }
     */
    public static final OfInt shadowColor$layout() {
        return shadowColor$LAYOUT;
    }

    private static final long shadowColor$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj shadowColor
     * }
     */
    public static final long shadowColor$offset() {
        return shadowColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj shadowColor
     * }
     */
    public static int shadowColor(MemorySegment struct) {
        return struct.get(shadowColor$LAYOUT, shadowColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj shadowColor
     * }
     */
    public static void shadowColor(MemorySegment struct, int fieldValue) {
        struct.set(shadowColor$LAYOUT, shadowColor$OFFSET, fieldValue);
    }

    private static final OfInt surfaceTintColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("surfaceTintColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj surfaceTintColor
     * }
     */
    public static final OfInt surfaceTintColor$layout() {
        return surfaceTintColor$LAYOUT;
    }

    private static final long surfaceTintColor$OFFSET = 52;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj surfaceTintColor
     * }
     */
    public static final long surfaceTintColor$offset() {
        return surfaceTintColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj surfaceTintColor
     * }
     */
    public static int surfaceTintColor(MemorySegment struct) {
        return struct.get(surfaceTintColor$LAYOUT, surfaceTintColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj surfaceTintColor
     * }
     */
    public static void surfaceTintColor(MemorySegment struct, int fieldValue) {
        struct.set(surfaceTintColor$LAYOUT, surfaceTintColor$OFFSET, fieldValue);
    }

    private static final OfInt shape$LAYOUT = (OfInt)$LAYOUT.select(groupElement("shape"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj shape
     * }
     */
    public static final OfInt shape$layout() {
        return shape$LAYOUT;
    }

    private static final long shape$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj shape
     * }
     */
    public static final long shape$offset() {
        return shape$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj shape
     * }
     */
    public static int shape(MemorySegment struct) {
        return struct.get(shape$LAYOUT, shape$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj shape
     * }
     */
    public static void shape(MemorySegment struct, int fieldValue) {
        struct.set(shape$LAYOUT, shape$OFFSET, fieldValue);
    }

    private static final OfInt backgroundColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("backgroundColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj backgroundColor
     * }
     */
    public static final OfInt backgroundColor$layout() {
        return backgroundColor$LAYOUT;
    }

    private static final long backgroundColor$OFFSET = 60;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj backgroundColor
     * }
     */
    public static final long backgroundColor$offset() {
        return backgroundColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj backgroundColor
     * }
     */
    public static int backgroundColor(MemorySegment struct) {
        return struct.get(backgroundColor$LAYOUT, backgroundColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj backgroundColor
     * }
     */
    public static void backgroundColor(MemorySegment struct, int fieldValue) {
        struct.set(backgroundColor$LAYOUT, backgroundColor$OFFSET, fieldValue);
    }

    private static final OfInt foregroundColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("foregroundColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj foregroundColor
     * }
     */
    public static final OfInt foregroundColor$layout() {
        return foregroundColor$LAYOUT;
    }

    private static final long foregroundColor$OFFSET = 64;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj foregroundColor
     * }
     */
    public static final long foregroundColor$offset() {
        return foregroundColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj foregroundColor
     * }
     */
    public static int foregroundColor(MemorySegment struct) {
        return struct.get(foregroundColor$LAYOUT, foregroundColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj foregroundColor
     * }
     */
    public static void foregroundColor(MemorySegment struct, int fieldValue) {
        struct.set(foregroundColor$LAYOUT, foregroundColor$OFFSET, fieldValue);
    }

    private static final OfInt primary$LAYOUT = (OfInt)$LAYOUT.select(groupElement("primary"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int primary
     * }
     */
    public static final OfInt primary$layout() {
        return primary$LAYOUT;
    }

    private static final long primary$OFFSET = 68;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int primary
     * }
     */
    public static final long primary$offset() {
        return primary$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int primary
     * }
     */
    public static int primary(MemorySegment struct) {
        return struct.get(primary$LAYOUT, primary$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int primary
     * }
     */
    public static void primary(MemorySegment struct, int fieldValue) {
        struct.set(primary$LAYOUT, primary$OFFSET, fieldValue);
    }

    private static final OfInt centerTitle$LAYOUT = (OfInt)$LAYOUT.select(groupElement("centerTitle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int centerTitle
     * }
     */
    public static final OfInt centerTitle$layout() {
        return centerTitle$LAYOUT;
    }

    private static final long centerTitle$OFFSET = 72;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int centerTitle
     * }
     */
    public static final long centerTitle$offset() {
        return centerTitle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int centerTitle
     * }
     */
    public static int centerTitle(MemorySegment struct) {
        return struct.get(centerTitle$LAYOUT, centerTitle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int centerTitle
     * }
     */
    public static void centerTitle(MemorySegment struct, int fieldValue) {
        struct.set(centerTitle$LAYOUT, centerTitle$OFFSET, fieldValue);
    }

    private static final OfInt excludeHeaderSemantics$LAYOUT = (OfInt)$LAYOUT.select(groupElement("excludeHeaderSemantics"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int excludeHeaderSemantics
     * }
     */
    public static final OfInt excludeHeaderSemantics$layout() {
        return excludeHeaderSemantics$LAYOUT;
    }

    private static final long excludeHeaderSemantics$OFFSET = 76;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int excludeHeaderSemantics
     * }
     */
    public static final long excludeHeaderSemantics$offset() {
        return excludeHeaderSemantics$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int excludeHeaderSemantics
     * }
     */
    public static int excludeHeaderSemantics(MemorySegment struct) {
        return struct.get(excludeHeaderSemantics$LAYOUT, excludeHeaderSemantics$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int excludeHeaderSemantics
     * }
     */
    public static void excludeHeaderSemantics(MemorySegment struct, int fieldValue) {
        struct.set(excludeHeaderSemantics$LAYOUT, excludeHeaderSemantics$OFFSET, fieldValue);
    }

    private static final OfDouble titleSpacing$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("titleSpacing"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double titleSpacing
     * }
     */
    public static final OfDouble titleSpacing$layout() {
        return titleSpacing$LAYOUT;
    }

    private static final long titleSpacing$OFFSET = 80;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double titleSpacing
     * }
     */
    public static final long titleSpacing$offset() {
        return titleSpacing$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double titleSpacing
     * }
     */
    public static double titleSpacing(MemorySegment struct) {
        return struct.get(titleSpacing$LAYOUT, titleSpacing$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double titleSpacing
     * }
     */
    public static void titleSpacing(MemorySegment struct, double fieldValue) {
        struct.set(titleSpacing$LAYOUT, titleSpacing$OFFSET, fieldValue);
    }

    private static final OfDouble toolbarOpacity$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("toolbarOpacity"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double toolbarOpacity
     * }
     */
    public static final OfDouble toolbarOpacity$layout() {
        return toolbarOpacity$LAYOUT;
    }

    private static final long toolbarOpacity$OFFSET = 88;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double toolbarOpacity
     * }
     */
    public static final long toolbarOpacity$offset() {
        return toolbarOpacity$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double toolbarOpacity
     * }
     */
    public static double toolbarOpacity(MemorySegment struct) {
        return struct.get(toolbarOpacity$LAYOUT, toolbarOpacity$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double toolbarOpacity
     * }
     */
    public static void toolbarOpacity(MemorySegment struct, double fieldValue) {
        struct.set(toolbarOpacity$LAYOUT, toolbarOpacity$OFFSET, fieldValue);
    }

    private static final OfDouble bottomOpacity$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("bottomOpacity"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double bottomOpacity
     * }
     */
    public static final OfDouble bottomOpacity$layout() {
        return bottomOpacity$LAYOUT;
    }

    private static final long bottomOpacity$OFFSET = 96;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double bottomOpacity
     * }
     */
    public static final long bottomOpacity$offset() {
        return bottomOpacity$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double bottomOpacity
     * }
     */
    public static double bottomOpacity(MemorySegment struct) {
        return struct.get(bottomOpacity$LAYOUT, bottomOpacity$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double bottomOpacity
     * }
     */
    public static void bottomOpacity(MemorySegment struct, double fieldValue) {
        struct.set(bottomOpacity$LAYOUT, bottomOpacity$OFFSET, fieldValue);
    }

    private static final OfDouble toolbarHeight$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("toolbarHeight"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double toolbarHeight
     * }
     */
    public static final OfDouble toolbarHeight$layout() {
        return toolbarHeight$LAYOUT;
    }

    private static final long toolbarHeight$OFFSET = 104;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double toolbarHeight
     * }
     */
    public static final long toolbarHeight$offset() {
        return toolbarHeight$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double toolbarHeight
     * }
     */
    public static double toolbarHeight(MemorySegment struct) {
        return struct.get(toolbarHeight$LAYOUT, toolbarHeight$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double toolbarHeight
     * }
     */
    public static void toolbarHeight(MemorySegment struct, double fieldValue) {
        struct.set(toolbarHeight$LAYOUT, toolbarHeight$OFFSET, fieldValue);
    }

    private static final OfDouble leadingWidth$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("leadingWidth"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double leadingWidth
     * }
     */
    public static final OfDouble leadingWidth$layout() {
        return leadingWidth$LAYOUT;
    }

    private static final long leadingWidth$OFFSET = 112;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double leadingWidth
     * }
     */
    public static final long leadingWidth$offset() {
        return leadingWidth$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double leadingWidth
     * }
     */
    public static double leadingWidth(MemorySegment struct) {
        return struct.get(leadingWidth$LAYOUT, leadingWidth$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double leadingWidth
     * }
     */
    public static void leadingWidth(MemorySegment struct, double fieldValue) {
        struct.set(leadingWidth$LAYOUT, leadingWidth$OFFSET, fieldValue);
    }

    private static final GroupLayout toolbarTextStyle$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("toolbarTextStyle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * TextStyleObjSt toolbarTextStyle
     * }
     */
    public static final GroupLayout toolbarTextStyle$layout() {
        return toolbarTextStyle$LAYOUT;
    }

    private static final long toolbarTextStyle$OFFSET = 120;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * TextStyleObjSt toolbarTextStyle
     * }
     */
    public static final long toolbarTextStyle$offset() {
        return toolbarTextStyle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * TextStyleObjSt toolbarTextStyle
     * }
     */
    public static MemorySegment toolbarTextStyle(MemorySegment struct) {
        return struct.asSlice(toolbarTextStyle$OFFSET, toolbarTextStyle$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * TextStyleObjSt toolbarTextStyle
     * }
     */
    public static void toolbarTextStyle(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, toolbarTextStyle$OFFSET, toolbarTextStyle$LAYOUT.byteSize());
    }

    private static final GroupLayout titleTextStyle$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("titleTextStyle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * TextStyleObjSt titleTextStyle
     * }
     */
    public static final GroupLayout titleTextStyle$layout() {
        return titleTextStyle$LAYOUT;
    }

    private static final long titleTextStyle$OFFSET = 232;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * TextStyleObjSt titleTextStyle
     * }
     */
    public static final long titleTextStyle$offset() {
        return titleTextStyle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * TextStyleObjSt titleTextStyle
     * }
     */
    public static MemorySegment titleTextStyle(MemorySegment struct) {
        return struct.asSlice(titleTextStyle$OFFSET, titleTextStyle$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * TextStyleObjSt titleTextStyle
     * }
     */
    public static void titleTextStyle(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, titleTextStyle$OFFSET, titleTextStyle$LAYOUT.byteSize());
    }

    private static final OfInt forceMaterialTransparency$LAYOUT = (OfInt)$LAYOUT.select(groupElement("forceMaterialTransparency"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int forceMaterialTransparency
     * }
     */
    public static final OfInt forceMaterialTransparency$layout() {
        return forceMaterialTransparency$LAYOUT;
    }

    private static final long forceMaterialTransparency$OFFSET = 344;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int forceMaterialTransparency
     * }
     */
    public static final long forceMaterialTransparency$offset() {
        return forceMaterialTransparency$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int forceMaterialTransparency
     * }
     */
    public static int forceMaterialTransparency(MemorySegment struct) {
        return struct.get(forceMaterialTransparency$LAYOUT, forceMaterialTransparency$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int forceMaterialTransparency
     * }
     */
    public static void forceMaterialTransparency(MemorySegment struct, int fieldValue) {
        struct.set(forceMaterialTransparency$LAYOUT, forceMaterialTransparency$OFFSET, fieldValue);
    }

    private static final OfInt useDefaultSemanticsOrder$LAYOUT = (OfInt)$LAYOUT.select(groupElement("useDefaultSemanticsOrder"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int useDefaultSemanticsOrder
     * }
     */
    public static final OfInt useDefaultSemanticsOrder$layout() {
        return useDefaultSemanticsOrder$LAYOUT;
    }

    private static final long useDefaultSemanticsOrder$OFFSET = 348;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int useDefaultSemanticsOrder
     * }
     */
    public static final long useDefaultSemanticsOrder$offset() {
        return useDefaultSemanticsOrder$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int useDefaultSemanticsOrder
     * }
     */
    public static int useDefaultSemanticsOrder(MemorySegment struct) {
        return struct.get(useDefaultSemanticsOrder$LAYOUT, useDefaultSemanticsOrder$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int useDefaultSemanticsOrder
     * }
     */
    public static void useDefaultSemanticsOrder(MemorySegment struct, int fieldValue) {
        struct.set(useDefaultSemanticsOrder$LAYOUT, useDefaultSemanticsOrder$OFFSET, fieldValue);
    }

    private static final OfInt clipBehavior$LAYOUT = (OfInt)$LAYOUT.select(groupElement("clipBehavior"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int clipBehavior
     * }
     */
    public static final OfInt clipBehavior$layout() {
        return clipBehavior$LAYOUT;
    }

    private static final long clipBehavior$OFFSET = 352;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int clipBehavior
     * }
     */
    public static final long clipBehavior$offset() {
        return clipBehavior$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int clipBehavior
     * }
     */
    public static int clipBehavior(MemorySegment struct) {
        return struct.get(clipBehavior$LAYOUT, clipBehavior$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int clipBehavior
     * }
     */
    public static void clipBehavior(MemorySegment struct, int fieldValue) {
        struct.set(clipBehavior$LAYOUT, clipBehavior$OFFSET, fieldValue);
    }

    private static final OfInt actionsPadding$LAYOUT = (OfInt)$LAYOUT.select(groupElement("actionsPadding"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj actionsPadding
     * }
     */
    public static final OfInt actionsPadding$layout() {
        return actionsPadding$LAYOUT;
    }

    private static final long actionsPadding$OFFSET = 356;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj actionsPadding
     * }
     */
    public static final long actionsPadding$offset() {
        return actionsPadding$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj actionsPadding
     * }
     */
    public static int actionsPadding(MemorySegment struct) {
        return struct.get(actionsPadding$LAYOUT, actionsPadding$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj actionsPadding
     * }
     */
    public static void actionsPadding(MemorySegment struct, int fieldValue) {
        struct.set(actionsPadding$LAYOUT, actionsPadding$OFFSET, fieldValue);
    }

    private static final OfInt animateColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("animateColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int animateColor
     * }
     */
    public static final OfInt animateColor$layout() {
        return animateColor$LAYOUT;
    }

    private static final long animateColor$OFFSET = 360;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int animateColor
     * }
     */
    public static final long animateColor$offset() {
        return animateColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int animateColor
     * }
     */
    public static int animateColor(MemorySegment struct) {
        return struct.get(animateColor$LAYOUT, animateColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int animateColor
     * }
     */
    public static void animateColor(MemorySegment struct, int fieldValue) {
        struct.set(animateColor$LAYOUT, animateColor$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
