// Generated by jextract

package dev.equo.ewt.ffm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     int id;
 *     DartObj topLeft;
 *     DartObj topRight;
 *     DartObj bottomLeft;
 *     DartObj bottomRight;
 * }
 * }
 */
public class BorderRadiusObjSt {

    BorderRadiusObjSt() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        StarterBridge.C_INT.withName("id"),
        StarterBridge.C_INT.withName("topLeft"),
        StarterBridge.C_INT.withName("topRight"),
        StarterBridge.C_INT.withName("bottomLeft"),
        StarterBridge.C_INT.withName("bottomRight")
    ).withName("$anon$187:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt id$LAYOUT = (OfInt)$LAYOUT.select(groupElement("id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final OfInt id$layout() {
        return id$LAYOUT;
    }

    private static final long id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final long id$offset() {
        return id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static int id(MemorySegment struct) {
        return struct.get(id$LAYOUT, id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static void id(MemorySegment struct, int fieldValue) {
        struct.set(id$LAYOUT, id$OFFSET, fieldValue);
    }

    private static final OfInt topLeft$LAYOUT = (OfInt)$LAYOUT.select(groupElement("topLeft"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj topLeft
     * }
     */
    public static final OfInt topLeft$layout() {
        return topLeft$LAYOUT;
    }

    private static final long topLeft$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj topLeft
     * }
     */
    public static final long topLeft$offset() {
        return topLeft$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj topLeft
     * }
     */
    public static int topLeft(MemorySegment struct) {
        return struct.get(topLeft$LAYOUT, topLeft$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj topLeft
     * }
     */
    public static void topLeft(MemorySegment struct, int fieldValue) {
        struct.set(topLeft$LAYOUT, topLeft$OFFSET, fieldValue);
    }

    private static final OfInt topRight$LAYOUT = (OfInt)$LAYOUT.select(groupElement("topRight"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj topRight
     * }
     */
    public static final OfInt topRight$layout() {
        return topRight$LAYOUT;
    }

    private static final long topRight$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj topRight
     * }
     */
    public static final long topRight$offset() {
        return topRight$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj topRight
     * }
     */
    public static int topRight(MemorySegment struct) {
        return struct.get(topRight$LAYOUT, topRight$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj topRight
     * }
     */
    public static void topRight(MemorySegment struct, int fieldValue) {
        struct.set(topRight$LAYOUT, topRight$OFFSET, fieldValue);
    }

    private static final OfInt bottomLeft$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bottomLeft"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj bottomLeft
     * }
     */
    public static final OfInt bottomLeft$layout() {
        return bottomLeft$LAYOUT;
    }

    private static final long bottomLeft$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj bottomLeft
     * }
     */
    public static final long bottomLeft$offset() {
        return bottomLeft$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj bottomLeft
     * }
     */
    public static int bottomLeft(MemorySegment struct) {
        return struct.get(bottomLeft$LAYOUT, bottomLeft$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj bottomLeft
     * }
     */
    public static void bottomLeft(MemorySegment struct, int fieldValue) {
        struct.set(bottomLeft$LAYOUT, bottomLeft$OFFSET, fieldValue);
    }

    private static final OfInt bottomRight$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bottomRight"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj bottomRight
     * }
     */
    public static final OfInt bottomRight$layout() {
        return bottomRight$LAYOUT;
    }

    private static final long bottomRight$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj bottomRight
     * }
     */
    public static final long bottomRight$offset() {
        return bottomRight$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj bottomRight
     * }
     */
    public static int bottomRight(MemorySegment struct) {
        return struct.get(bottomRight$LAYOUT, bottomRight$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj bottomRight
     * }
     */
    public static void bottomRight(MemorySegment struct, int fieldValue) {
        struct.set(bottomRight$LAYOUT, bottomRight$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

