// Generated by jextract

package dev.equo.ewt.ffm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     int id;
 *     double minWidth;
 *     double maxWidth;
 *     double minHeight;
 *     double maxHeight;
 *     int hasTightWidth;
 *     int hasTightHeight;
 *     int hasBoundedWidth;
 *     int hasBoundedHeight;
 *     int hasInfiniteWidth;
 *     int hasInfiniteHeight;
 * }
 * }
 */
public class BoxConstraintsObjSt {

    BoxConstraintsObjSt() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        StarterBridge.C_INT.withName("id"),
        MemoryLayout.paddingLayout(4),
        StarterBridge.C_DOUBLE.withName("minWidth"),
        StarterBridge.C_DOUBLE.withName("maxWidth"),
        StarterBridge.C_DOUBLE.withName("minHeight"),
        StarterBridge.C_DOUBLE.withName("maxHeight"),
        StarterBridge.C_INT.withName("hasTightWidth"),
        StarterBridge.C_INT.withName("hasTightHeight"),
        StarterBridge.C_INT.withName("hasBoundedWidth"),
        StarterBridge.C_INT.withName("hasBoundedHeight"),
        StarterBridge.C_INT.withName("hasInfiniteWidth"),
        StarterBridge.C_INT.withName("hasInfiniteHeight")
    ).withName("$anon$136:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt id$LAYOUT = (OfInt)$LAYOUT.select(groupElement("id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final OfInt id$layout() {
        return id$LAYOUT;
    }

    private static final long id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final long id$offset() {
        return id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static int id(MemorySegment struct) {
        return struct.get(id$LAYOUT, id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static void id(MemorySegment struct, int fieldValue) {
        struct.set(id$LAYOUT, id$OFFSET, fieldValue);
    }

    private static final OfDouble minWidth$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("minWidth"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double minWidth
     * }
     */
    public static final OfDouble minWidth$layout() {
        return minWidth$LAYOUT;
    }

    private static final long minWidth$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double minWidth
     * }
     */
    public static final long minWidth$offset() {
        return minWidth$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double minWidth
     * }
     */
    public static double minWidth(MemorySegment struct) {
        return struct.get(minWidth$LAYOUT, minWidth$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double minWidth
     * }
     */
    public static void minWidth(MemorySegment struct, double fieldValue) {
        struct.set(minWidth$LAYOUT, minWidth$OFFSET, fieldValue);
    }

    private static final OfDouble maxWidth$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("maxWidth"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double maxWidth
     * }
     */
    public static final OfDouble maxWidth$layout() {
        return maxWidth$LAYOUT;
    }

    private static final long maxWidth$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double maxWidth
     * }
     */
    public static final long maxWidth$offset() {
        return maxWidth$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double maxWidth
     * }
     */
    public static double maxWidth(MemorySegment struct) {
        return struct.get(maxWidth$LAYOUT, maxWidth$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double maxWidth
     * }
     */
    public static void maxWidth(MemorySegment struct, double fieldValue) {
        struct.set(maxWidth$LAYOUT, maxWidth$OFFSET, fieldValue);
    }

    private static final OfDouble minHeight$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("minHeight"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double minHeight
     * }
     */
    public static final OfDouble minHeight$layout() {
        return minHeight$LAYOUT;
    }

    private static final long minHeight$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double minHeight
     * }
     */
    public static final long minHeight$offset() {
        return minHeight$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double minHeight
     * }
     */
    public static double minHeight(MemorySegment struct) {
        return struct.get(minHeight$LAYOUT, minHeight$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double minHeight
     * }
     */
    public static void minHeight(MemorySegment struct, double fieldValue) {
        struct.set(minHeight$LAYOUT, minHeight$OFFSET, fieldValue);
    }

    private static final OfDouble maxHeight$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("maxHeight"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double maxHeight
     * }
     */
    public static final OfDouble maxHeight$layout() {
        return maxHeight$LAYOUT;
    }

    private static final long maxHeight$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double maxHeight
     * }
     */
    public static final long maxHeight$offset() {
        return maxHeight$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double maxHeight
     * }
     */
    public static double maxHeight(MemorySegment struct) {
        return struct.get(maxHeight$LAYOUT, maxHeight$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double maxHeight
     * }
     */
    public static void maxHeight(MemorySegment struct, double fieldValue) {
        struct.set(maxHeight$LAYOUT, maxHeight$OFFSET, fieldValue);
    }

    private static final OfInt hasTightWidth$LAYOUT = (OfInt)$LAYOUT.select(groupElement("hasTightWidth"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int hasTightWidth
     * }
     */
    public static final OfInt hasTightWidth$layout() {
        return hasTightWidth$LAYOUT;
    }

    private static final long hasTightWidth$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int hasTightWidth
     * }
     */
    public static final long hasTightWidth$offset() {
        return hasTightWidth$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int hasTightWidth
     * }
     */
    public static int hasTightWidth(MemorySegment struct) {
        return struct.get(hasTightWidth$LAYOUT, hasTightWidth$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int hasTightWidth
     * }
     */
    public static void hasTightWidth(MemorySegment struct, int fieldValue) {
        struct.set(hasTightWidth$LAYOUT, hasTightWidth$OFFSET, fieldValue);
    }

    private static final OfInt hasTightHeight$LAYOUT = (OfInt)$LAYOUT.select(groupElement("hasTightHeight"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int hasTightHeight
     * }
     */
    public static final OfInt hasTightHeight$layout() {
        return hasTightHeight$LAYOUT;
    }

    private static final long hasTightHeight$OFFSET = 44;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int hasTightHeight
     * }
     */
    public static final long hasTightHeight$offset() {
        return hasTightHeight$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int hasTightHeight
     * }
     */
    public static int hasTightHeight(MemorySegment struct) {
        return struct.get(hasTightHeight$LAYOUT, hasTightHeight$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int hasTightHeight
     * }
     */
    public static void hasTightHeight(MemorySegment struct, int fieldValue) {
        struct.set(hasTightHeight$LAYOUT, hasTightHeight$OFFSET, fieldValue);
    }

    private static final OfInt hasBoundedWidth$LAYOUT = (OfInt)$LAYOUT.select(groupElement("hasBoundedWidth"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int hasBoundedWidth
     * }
     */
    public static final OfInt hasBoundedWidth$layout() {
        return hasBoundedWidth$LAYOUT;
    }

    private static final long hasBoundedWidth$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int hasBoundedWidth
     * }
     */
    public static final long hasBoundedWidth$offset() {
        return hasBoundedWidth$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int hasBoundedWidth
     * }
     */
    public static int hasBoundedWidth(MemorySegment struct) {
        return struct.get(hasBoundedWidth$LAYOUT, hasBoundedWidth$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int hasBoundedWidth
     * }
     */
    public static void hasBoundedWidth(MemorySegment struct, int fieldValue) {
        struct.set(hasBoundedWidth$LAYOUT, hasBoundedWidth$OFFSET, fieldValue);
    }

    private static final OfInt hasBoundedHeight$LAYOUT = (OfInt)$LAYOUT.select(groupElement("hasBoundedHeight"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int hasBoundedHeight
     * }
     */
    public static final OfInt hasBoundedHeight$layout() {
        return hasBoundedHeight$LAYOUT;
    }

    private static final long hasBoundedHeight$OFFSET = 52;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int hasBoundedHeight
     * }
     */
    public static final long hasBoundedHeight$offset() {
        return hasBoundedHeight$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int hasBoundedHeight
     * }
     */
    public static int hasBoundedHeight(MemorySegment struct) {
        return struct.get(hasBoundedHeight$LAYOUT, hasBoundedHeight$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int hasBoundedHeight
     * }
     */
    public static void hasBoundedHeight(MemorySegment struct, int fieldValue) {
        struct.set(hasBoundedHeight$LAYOUT, hasBoundedHeight$OFFSET, fieldValue);
    }

    private static final OfInt hasInfiniteWidth$LAYOUT = (OfInt)$LAYOUT.select(groupElement("hasInfiniteWidth"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int hasInfiniteWidth
     * }
     */
    public static final OfInt hasInfiniteWidth$layout() {
        return hasInfiniteWidth$LAYOUT;
    }

    private static final long hasInfiniteWidth$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int hasInfiniteWidth
     * }
     */
    public static final long hasInfiniteWidth$offset() {
        return hasInfiniteWidth$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int hasInfiniteWidth
     * }
     */
    public static int hasInfiniteWidth(MemorySegment struct) {
        return struct.get(hasInfiniteWidth$LAYOUT, hasInfiniteWidth$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int hasInfiniteWidth
     * }
     */
    public static void hasInfiniteWidth(MemorySegment struct, int fieldValue) {
        struct.set(hasInfiniteWidth$LAYOUT, hasInfiniteWidth$OFFSET, fieldValue);
    }

    private static final OfInt hasInfiniteHeight$LAYOUT = (OfInt)$LAYOUT.select(groupElement("hasInfiniteHeight"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int hasInfiniteHeight
     * }
     */
    public static final OfInt hasInfiniteHeight$layout() {
        return hasInfiniteHeight$LAYOUT;
    }

    private static final long hasInfiniteHeight$OFFSET = 60;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int hasInfiniteHeight
     * }
     */
    public static final long hasInfiniteHeight$offset() {
        return hasInfiniteHeight$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int hasInfiniteHeight
     * }
     */
    public static int hasInfiniteHeight(MemorySegment struct) {
        return struct.get(hasInfiniteHeight$LAYOUT, hasInfiniteHeight$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int hasInfiniteHeight
     * }
     */
    public static void hasInfiniteHeight(MemorySegment struct, int fieldValue) {
        struct.set(hasInfiniteHeight$LAYOUT, hasInfiniteHeight$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

