// Generated by jextract

package dev.equo.ewt.ffm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     int id;
 *     DartObj color;
 *     DartObj border;
 *     DartObj borderRadius;
 *     int backgroundBlendMode;
 *     int shape;
 * }
 * }
 */
public class BoxDecorationObjSt {

    BoxDecorationObjSt() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        StarterBridge.C_INT.withName("id"),
        StarterBridge.C_INT.withName("color"),
        StarterBridge.C_INT.withName("border"),
        StarterBridge.C_INT.withName("borderRadius"),
        StarterBridge.C_INT.withName("backgroundBlendMode"),
        StarterBridge.C_INT.withName("shape")
    ).withName("$anon$152:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt id$LAYOUT = (OfInt)$LAYOUT.select(groupElement("id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final OfInt id$layout() {
        return id$LAYOUT;
    }

    private static final long id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final long id$offset() {
        return id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static int id(MemorySegment struct) {
        return struct.get(id$LAYOUT, id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static void id(MemorySegment struct, int fieldValue) {
        struct.set(id$LAYOUT, id$OFFSET, fieldValue);
    }

    private static final OfInt color$LAYOUT = (OfInt)$LAYOUT.select(groupElement("color"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj color
     * }
     */
    public static final OfInt color$layout() {
        return color$LAYOUT;
    }

    private static final long color$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj color
     * }
     */
    public static final long color$offset() {
        return color$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj color
     * }
     */
    public static int color(MemorySegment struct) {
        return struct.get(color$LAYOUT, color$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj color
     * }
     */
    public static void color(MemorySegment struct, int fieldValue) {
        struct.set(color$LAYOUT, color$OFFSET, fieldValue);
    }

    private static final OfInt border$LAYOUT = (OfInt)$LAYOUT.select(groupElement("border"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj border
     * }
     */
    public static final OfInt border$layout() {
        return border$LAYOUT;
    }

    private static final long border$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj border
     * }
     */
    public static final long border$offset() {
        return border$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj border
     * }
     */
    public static int border(MemorySegment struct) {
        return struct.get(border$LAYOUT, border$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj border
     * }
     */
    public static void border(MemorySegment struct, int fieldValue) {
        struct.set(border$LAYOUT, border$OFFSET, fieldValue);
    }

    private static final OfInt borderRadius$LAYOUT = (OfInt)$LAYOUT.select(groupElement("borderRadius"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj borderRadius
     * }
     */
    public static final OfInt borderRadius$layout() {
        return borderRadius$LAYOUT;
    }

    private static final long borderRadius$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj borderRadius
     * }
     */
    public static final long borderRadius$offset() {
        return borderRadius$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj borderRadius
     * }
     */
    public static int borderRadius(MemorySegment struct) {
        return struct.get(borderRadius$LAYOUT, borderRadius$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj borderRadius
     * }
     */
    public static void borderRadius(MemorySegment struct, int fieldValue) {
        struct.set(borderRadius$LAYOUT, borderRadius$OFFSET, fieldValue);
    }

    private static final OfInt backgroundBlendMode$LAYOUT = (OfInt)$LAYOUT.select(groupElement("backgroundBlendMode"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int backgroundBlendMode
     * }
     */
    public static final OfInt backgroundBlendMode$layout() {
        return backgroundBlendMode$LAYOUT;
    }

    private static final long backgroundBlendMode$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int backgroundBlendMode
     * }
     */
    public static final long backgroundBlendMode$offset() {
        return backgroundBlendMode$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int backgroundBlendMode
     * }
     */
    public static int backgroundBlendMode(MemorySegment struct) {
        return struct.get(backgroundBlendMode$LAYOUT, backgroundBlendMode$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int backgroundBlendMode
     * }
     */
    public static void backgroundBlendMode(MemorySegment struct, int fieldValue) {
        struct.set(backgroundBlendMode$LAYOUT, backgroundBlendMode$OFFSET, fieldValue);
    }

    private static final OfInt shape$LAYOUT = (OfInt)$LAYOUT.select(groupElement("shape"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int shape
     * }
     */
    public static final OfInt shape$layout() {
        return shape$LAYOUT;
    }

    private static final long shape$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int shape
     * }
     */
    public static final long shape$offset() {
        return shape$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int shape
     * }
     */
    public static int shape(MemorySegment struct) {
        return struct.get(shape$LAYOUT, shape$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int shape
     * }
     */
    public static void shape(MemorySegment struct, int fieldValue) {
        struct.set(shape$LAYOUT, shape$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

