// Generated by jextract

package dev.equo.ewt.ffm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     int id;
 *     double spreadRadius;
 *     int blurStyle;
 * }
 * }
 */
public class BoxShadowObjSt {

    BoxShadowObjSt() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        StarterBridge.C_INT.withName("id"),
        MemoryLayout.paddingLayout(4),
        StarterBridge.C_DOUBLE.withName("spreadRadius"),
        StarterBridge.C_INT.withName("blurStyle"),
        MemoryLayout.paddingLayout(4)
    ).withName("$anon$142:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt id$LAYOUT = (OfInt)$LAYOUT.select(groupElement("id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final OfInt id$layout() {
        return id$LAYOUT;
    }

    private static final long id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final long id$offset() {
        return id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static int id(MemorySegment struct) {
        return struct.get(id$LAYOUT, id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static void id(MemorySegment struct, int fieldValue) {
        struct.set(id$LAYOUT, id$OFFSET, fieldValue);
    }

    private static final OfDouble spreadRadius$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("spreadRadius"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double spreadRadius
     * }
     */
    public static final OfDouble spreadRadius$layout() {
        return spreadRadius$LAYOUT;
    }

    private static final long spreadRadius$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double spreadRadius
     * }
     */
    public static final long spreadRadius$offset() {
        return spreadRadius$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double spreadRadius
     * }
     */
    public static double spreadRadius(MemorySegment struct) {
        return struct.get(spreadRadius$LAYOUT, spreadRadius$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double spreadRadius
     * }
     */
    public static void spreadRadius(MemorySegment struct, double fieldValue) {
        struct.set(spreadRadius$LAYOUT, spreadRadius$OFFSET, fieldValue);
    }

    private static final OfInt blurStyle$LAYOUT = (OfInt)$LAYOUT.select(groupElement("blurStyle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int blurStyle
     * }
     */
    public static final OfInt blurStyle$layout() {
        return blurStyle$LAYOUT;
    }

    private static final long blurStyle$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int blurStyle
     * }
     */
    public static final long blurStyle$offset() {
        return blurStyle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int blurStyle
     * }
     */
    public static int blurStyle(MemorySegment struct) {
        return struct.get(blurStyle$LAYOUT, blurStyle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int blurStyle
     * }
     */
    public static void blurStyle(MemorySegment struct, int fieldValue) {
        struct.set(blurStyle$LAYOUT, blurStyle$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

