// Generated by jextract

package dev.equo.ewt.ffm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     int id;
 *     int brightness;
 *     DartObj primary;
 *     DartObj onPrimary;
 *     DartObj secondary;
 *     DartObj onSecondary;
 *     DartObj error;
 *     DartObj onError;
 *     DartObj surface;
 *     DartObj onSurface;
 *     DartObj primaryContainer;
 *     DartObj onPrimaryContainer;
 *     DartObj primaryFixed;
 *     DartObj primaryFixedDim;
 *     DartObj onPrimaryFixed;
 *     DartObj onPrimaryFixedVariant;
 *     DartObj secondaryContainer;
 *     DartObj onSecondaryContainer;
 *     DartObj secondaryFixed;
 *     DartObj secondaryFixedDim;
 *     DartObj onSecondaryFixed;
 *     DartObj onSecondaryFixedVariant;
 *     DartObj tertiary;
 *     DartObj onTertiary;
 *     DartObj tertiaryContainer;
 *     DartObj onTertiaryContainer;
 *     DartObj tertiaryFixed;
 *     DartObj tertiaryFixedDim;
 *     DartObj onTertiaryFixed;
 *     DartObj onTertiaryFixedVariant;
 *     DartObj errorContainer;
 *     DartObj onErrorContainer;
 *     DartObj surfaceVariant;
 *     DartObj surfaceDim;
 *     DartObj surfaceBright;
 *     DartObj surfaceContainerLowest;
 *     DartObj surfaceContainerLow;

        StarterBridge.C_INT.withName("onSecondary"),
        StarterBridge.C_INT.withName("error"),
        StarterBridge.C_INT.withName("onError"),
        StarterBridge.C_INT.withName("surface"),
        StarterBridge.C_INT.withName("onSurface"),
        StarterBridge.C_INT.withName("primaryContainer"),
        StarterBridge.C_INT.withName("onPrimaryContainer"),
        StarterBridge.C_INT.withName("primaryFixed"),
        StarterBridge.C_INT.withName("primaryFixedDim"),
        StarterBridge.C_INT.withName("onPrimaryFixed"),
        StarterBridge.C_INT.withName("onPrimaryFixedVariant"),
        StarterBridge.C_INT.withName("secondaryContainer"),
        StarterBridge.C_INT.withName("onSecondaryContainer"),
        StarterBridge.C_INT.withName("secondaryFixed"),
        StarterBridge.C_INT.withName("secondaryFixedDim"),
        StarterBridge.C_INT.withName("onSecondaryFixed"),
        StarterBridge.C_INT.withName("onSecondaryFixedVariant"),
        StarterBridge.C_INT.withName("tertiary"),
        StarterBridge.C_INT.withName("onTertiary"),
        StarterBridge.C_INT.withName("tertiaryContainer"),
        StarterBridge.C_INT.withName("onTertiaryContainer"),
        StarterBridge.C_INT.withName("tertiaryFixed"),
        StarterBridge.C_INT.withName("tertiaryFixedDim"),
        StarterBridge.C_INT.withName("onTertiaryFixed"),
        StarterBridge.C_INT.withName("onTertiaryFixedVariant"),
        StarterBridge.C_INT.withName("errorContainer"),
        StarterBridge.C_INT.withName("onErrorContainer"),
        StarterBridge.C_INT.withName("surfaceVariant"),
        StarterBridge.C_INT.withName("surfaceDim"),
        StarterBridge.C_INT.withName("surfaceBright"),
        StarterBridge.C_INT.withName("surfaceContainerLowest"),
        StarterBridge.C_INT.withName("surfaceContainerLow"),
        StarterBridge.C_INT.withName("surfaceContainer"),
        StarterBridge.C_INT.withName("surfaceContainerHigh"),
        StarterBridge.C_INT.withName("surfaceContainerHighest"),
        StarterBridge.C_INT.withName("onSurfaceVariant"),
        StarterBridge.C_INT.withName("outline"),
        StarterBridge.C_INT.withName("outlineVariant"),
        StarterBridge.C_INT.withName("shadow"),
        StarterBridge.C_INT.withName("scrim"),
        StarterBridge.C_INT.withName("inverseSurface"),
        StarterBridge.C_INT.withName("onInverseSurface"),
        StarterBridge.C_INT.withName("inversePrimary"),
        StarterBridge.C_INT.withName("surfaceTint"),
        StarterBridge.C_INT.withName("background"),
        StarterBridge.C_INT.withName("onBackground")
    ).withName("$anon$234:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt id$LAYOUT = (OfInt)$LAYOUT.select(groupElement("id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final OfInt id$layout() {
        return id$LAYOUT;
    }

    private static final long id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final long id$offset() {
        return id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static int id(MemorySegment struct) {
        return struct.get(id$LAYOUT, id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static void id(MemorySegment struct, int fieldValue) {
        struct.set(id$LAYOUT, id$OFFSET, fieldValue);
    }

    private static final OfInt brightness$LAYOUT = (OfInt)$LAYOUT.select(groupElement("brightness"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int brightness
     * }
     */
    public static final OfInt brightness$layout() {
        return brightness$LAYOUT;
    }

    private static final long brightness$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int brightness
     * }
     */
    public static final long brightness$offset() {
        return brightness$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int brightness
     * }
     */
    public static int brightness(MemorySegment struct) {
        return struct.get(brightness$LAYOUT, brightness$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int brightness
     * }
     */
    public static void brightness(MemorySegment struct, int fieldValue) {
        struct.set(brightness$LAYOUT, brightness$OFFSET, fieldValue);
    }

    private static final OfInt primary$LAYOUT = (OfInt)$LAYOUT.select(groupElement("primary"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj primary
     * }
     */
    public static final OfInt primary$layout() {
        return primary$LAYOUT;
    }

    private static final long primary$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj primary
     * }
     */
    public static final long primary$offset() {
        return primary$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj primary
     * }
     */
    public static int primary(MemorySegment struct) {
        return struct.get(primary$LAYOUT, primary$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj primary
     * }
     */
    public static void primary(MemorySegment struct, int fieldValue) {
        struct.set(primary$LAYOUT, primary$OFFSET, fieldValue);
    }

    private static final OfInt onPrimary$LAYOUT = (OfInt)$LAYOUT.select(groupElement("onPrimary"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj onPrimary
     * }
     */
    public static final OfInt onPrimary$layout() {
        return onPrimary$LAYOUT;
    }

    private static final long onPrimary$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj onPrimary
     * }
     */
    public static final long onPrimary$offset() {
        return onPrimary$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj onPrimary
     * }
     */
    public static int onPrimary(MemorySegment struct) {
        return struct.get(onPrimary$LAYOUT, onPrimary$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj onPrimary
     * }
     */
    public static void onPrimary(MemorySegment struct, int fieldValue) {
        struct.set(onPrimary$LAYOUT, onPrimary$OFFSET, fieldValue);
    }

    private static final OfInt secondary$LAYOUT = (OfInt)$LAYOUT.select(groupElement("secondary"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj secondary
     * }
     */
    public static final OfInt secondary$layout() {
        return secondary$LAYOUT;
    }

    private static final long secondary$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj secondary
     * }
     */
    public static final long secondary$offset() {
        return secondary$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj secondary
     * }
     */
    public static int secondary(MemorySegment struct) {
        return struct.get(secondary$LAYOUT, secondary$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj secondary
     * }
     */
    public static void secondary(MemorySegment struct, int fieldValue) {
        struct.set(secondary$LAYOUT, secondary$OFFSET, fieldValue);
    }

    private static final OfInt onSecondary$LAYOUT = (OfInt)$LAYOUT.select(groupElement("onSecondary"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj onSecondary
     * }
     */
    public static final OfInt onSecondary$layout() {
        return onSecondary$LAYOUT;
    }

    private static final long onSecondary$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj onSecondary
     * }
     */
    public static final long onSecondary$offset() {
        return onSecondary$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj onSecondary
     * }
     */
    public static int onSecondary(MemorySegment struct) {
        return struct.get(onSecondary$LAYOUT, onSecondary$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj onSecondary
     * }
     */
    public static void onSecondary(MemorySegment struct, int fieldValue) {
        struct.set(onSecondary$LAYOUT, onSecondary$OFFSET, fieldValue);
    }

    private static final OfInt error$LAYOUT = (OfInt)$LAYOUT.select(groupElement("error"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj error
     * }
     */
    public static final OfInt error$layout() {
        return error$LAYOUT;
    }

    private static final long error$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj error
     * }
     */
    public static final long error$offset() {
        return error$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj error
     * }
     */
    public static int error(MemorySegment struct) {
        return struct.get(error$LAYOUT, error$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj error
     * }
     */
    public static void error(MemorySegment struct, int fieldValue) {
        struct.set(error$LAYOUT, error$OFFSET, fieldValue);
    }

    private static final OfInt onError$LAYOUT = (OfInt)$LAYOUT.select(groupElement("onError"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj onError
     * }
     */
    public static final OfInt onError$layout() {
        return onError$LAYOUT;
    }

    private static final long onError$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj onError
     * }
     */
    public static final long onError$offset() {
        return onError$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj onError
     * }
     */
    public static int onError(MemorySegment struct) {
        return struct.get(onError$LAYOUT, onError$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj onError
     * }
     */
    public static void onError(MemorySegment struct, int fieldValue) {
        struct.set(onError$LAYOUT, onError$OFFSET, fieldValue);
    }

    private static final OfInt surface$LAYOUT = (OfInt)$LAYOUT.select(groupElement("surface"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj surface
     * }
     */
    public static final OfInt surface$layout() {
        return surface$LAYOUT;
    }

    private static final long surface$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj surface
     * }
     */
    public static final long surface$offset() {
        return surface$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj surface
     * }
     */
    public static int surface(MemorySegment struct) {
        return struct.get(surface$LAYOUT, surface$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj surface
     * }
     */
    public static void surface(MemorySegment struct, int fieldValue) {
        struct.set(surface$LAYOUT, surface$OFFSET, fieldValue);
    }

    private static final OfInt onSurface$LAYOUT = (OfInt)$LAYOUT.select(groupElement("onSurface"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj onSurface
     * }
     */
    public static final OfInt onSurface$layout() {
        return onSurface$LAYOUT;
    }

    private static final long onSurface$OFFSET = 36;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj onSurface
     * }
     */
    public static final long onSurface$offset() {
        return onSurface$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj onSurface
     * }
     */
    public static int onSurface(MemorySegment struct) {
        return struct.get(onSurface$LAYOUT, onSurface$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj onSurface
     * }
     */
    public static void onSurface(MemorySegment struct, int fieldValue) {
        struct.set(onSurface$LAYOUT, onSurface$OFFSET, fieldValue);
    }

    private static final OfInt primaryContainer$LAYOUT = (OfInt)$LAYOUT.select(groupElement("primaryContainer"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj primaryContainer
     * }
     */
    public static final OfInt primaryContainer$layout() {
        return primaryContainer$LAYOUT;
    }

    private static final long primaryContainer$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj primaryContainer
     * }
     */
    public static final long primaryContainer$offset() {
        return primaryContainer$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj primaryContainer
     * }
     */
    public static int primaryContainer(MemorySegment struct) {
        return struct.get(primaryContainer$LAYOUT, primaryContainer$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj primaryContainer
     * }
     */
    public static void primaryContainer(MemorySegment struct, int fieldValue) {
        struct.set(primaryContainer$LAYOUT, primaryContainer$OFFSET, fieldValue);
    }

    private static final OfInt onPrimaryContainer$LAYOUT = (OfInt)$LAYOUT.select(groupElement("onPrimaryContainer"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj onPrimaryContainer
     * }
     */
    public static final OfInt onPrimaryContainer$layout() {
        return onPrimaryContainer$LAYOUT;
    }

    private static final long onPrimaryContainer$OFFSET = 44;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj onPrimaryContainer
     * }
     */
    public static final long onPrimaryContainer$offset() {
        return onPrimaryContainer$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj onPrimaryContainer
     * }
     */
    public static int onPrimaryContainer(MemorySegment struct) {
        return struct.get(onPrimaryContainer$LAYOUT, onPrimaryContainer$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj onPrimaryContainer
     * }
     */
    public static void onPrimaryContainer(MemorySegment struct, int fieldValue) {
        struct.set(onPrimaryContainer$LAYOUT, onPrimaryContainer$OFFSET, fieldValue);
    }

    private static final OfInt primaryFixed$LAYOUT = (OfInt)$LAYOUT.select(groupElement("primaryFixed"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj primaryFixed
     * }
     */
    public static final OfInt primaryFixed$layout() {
        return primaryFixed$LAYOUT;
    }

    private static final long primaryFixed$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj primaryFixed
     * }
     */
    public static final long primaryFixed$offset() {
        return primaryFixed$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj primaryFixed
     * }
     */
    public static int primaryFixed(MemorySegment struct) {
        return struct.get(primaryFixed$LAYOUT, primaryFixed$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj primaryFixed
     * }
     */
    public static void primaryFixed(MemorySegment struct, int fieldValue) {
        struct.set(primaryFixed$LAYOUT, primaryFixed$OFFSET, fieldValue);
    }

    private static final OfInt primaryFixedDim$LAYOUT = (OfInt)$LAYOUT.select(groupElement("primaryFixedDim"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj primaryFixedDim
     * }
     */
    public static final OfInt primaryFixedDim$layout() {
        return primaryFixedDim$LAYOUT;
    }

    private static final long primaryFixedDim$OFFSET = 52;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj primaryFixedDim
     * }
     */
    public static final long primaryFixedDim$offset() {
        return primaryFixedDim$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj primaryFixedDim
     * }
     */
    public static int primaryFixedDim(MemorySegment struct) {
        return struct.get(primaryFixedDim$LAYOUT, primaryFixedDim$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj primaryFixedDim
     * }
     */
    public static void primaryFixedDim(MemorySegment struct, int fieldValue) {
        struct.set(primaryFixedDim$LAYOUT, primaryFixedDim$OFFSET, fieldValue);
    }

    private static final OfInt onPrimaryFixed$LAYOUT = (OfInt)$LAYOUT.select(groupElement("onPrimaryFixed"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj onPrimaryFixed
     * }
     */
    public static final OfInt onPrimaryFixed$layout() {
        return onPrimaryFixed$LAYOUT;
    }

    private static final long onPrimaryFixed$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj onPrimaryFixed
     * }
     */
    public static final long onPrimaryFixed$offset() {
        return onPrimaryFixed$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj onPrimaryFixed
     * }
     */
    public static int onPrimaryFixed(MemorySegment struct) {
        return struct.get(onPrimaryFixed$LAYOUT, onPrimaryFixed$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj onPrimaryFixed
     * }
     */
    public static void onPrimaryFixed(MemorySegment struct, int fieldValue) {
        struct.set(onPrimaryFixed$LAYOUT, onPrimaryFixed$OFFSET, fieldValue);
    }

    private static final OfInt onPrimaryFixedVariant$LAYOUT = (OfInt)$LAYOUT.select(groupElement("onPrimaryFixedVariant"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj onPrimaryFixedVariant
     * }
     */
    public static final OfInt onPrimaryFixedVariant$layout() {
        return onPrimaryFixedVariant$LAYOUT;
    }

    private static final long onPrimaryFixedVariant$OFFSET = 60;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj onPrimaryFixedVariant
     * }
     */
    public static final long onPrimaryFixedVariant$offset() {
        return onPrimaryFixedVariant$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj onPrimaryFixedVariant
     * }
     */
    public static int onPrimaryFixedVariant(MemorySegment struct) {
        return struct.get(onPrimaryFixedVariant$LAYOUT, onPrimaryFixedVariant$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj onPrimaryFixedVariant
     * }
     */
    public static void onPrimaryFixedVariant(MemorySegment struct, int fieldValue) {
        struct.set(onPrimaryFixedVariant$LAYOUT, onPrimaryFixedVariant$OFFSET, fieldValue);
    }

    private static final OfInt secondaryContainer$LAYOUT = (OfInt)$LAYOUT.select(groupElement("secondaryContainer"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj secondaryContainer
     * }
     */
    public static final OfInt secondaryContainer$layout() {
        return secondaryContainer$LAYOUT;
    }

    private static final long secondaryContainer$OFFSET = 64;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj secondaryContainer
     * }
     */
    public static final long secondaryContainer$offset() {
        return secondaryContainer$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj secondaryContainer
     * }
     */
    public static int secondaryContainer(MemorySegment struct) {
        return struct.get(secondaryContainer$LAYOUT, secondaryContainer$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj secondaryContainer
     * }
     */
    public static void secondaryContainer(MemorySegment struct, int fieldValue) {
        struct.set(secondaryContainer$LAYOUT, secondaryContainer$OFFSET, fieldValue);
    }

    private static final OfInt onSecondaryContainer$LAYOUT = (OfInt)$LAYOUT.select(groupElement("onSecondaryContainer"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj onSecondaryContainer
     * }
     */
    public static final OfInt onSecondaryContainer$layout() {
        return onSecondaryContainer$LAYOUT;
    }

    private static final long onSecondaryContainer$OFFSET = 68;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj onSecondaryContainer
     * }
     */
    public static final long onSecondaryContainer$offset() {
        return onSecondaryContainer$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj onSecondaryContainer
     * }
     */
    public static int onSecondaryContainer(MemorySegment struct) {
        return struct.get(onSecondaryContainer$LAYOUT, onSecondaryContainer$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj onSecondaryContainer
     * }
     */
    public static void onSecondaryContainer(MemorySegment struct, int fieldValue) {
        struct.set(onSecondaryContainer$LAYOUT, onSecondaryContainer$OFFSET, fieldValue);
    }

    private static final OfInt secondaryFixed$LAYOUT = (OfInt)$LAYOUT.select(groupElement("secondaryFixed"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj secondaryFixed
     * }
     */
    public static final OfInt secondaryFixed$layout() {
        return secondaryFixed$LAYOUT;
    }

    private static final long secondaryFixed$OFFSET = 72;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj secondaryFixed
     * }
     */
    public static final long secondaryFixed$offset() {
        return secondaryFixed$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj secondaryFixed
     * }
     */
    public static int secondaryFixed(MemorySegment struct) {
        return struct.get(secondaryFixed$LAYOUT, secondaryFixed$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj secondaryFixed
     * }
     */
    public static void secondaryFixed(MemorySegment struct, int fieldValue) {
        struct.set(secondaryFixed$LAYOUT, secondaryFixed$OFFSET, fieldValue);
    }

    private static final OfInt secondaryFixedDim$LAYOUT = (OfInt)$LAYOUT.select(groupElement("secondaryFixedDim"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj secondaryFixedDim
     * }
     */
    public static final OfInt secondaryFixedDim$layout() {
        return secondaryFixedDim$LAYOUT;
    }

    private static final long secondaryFixedDim$OFFSET = 76;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj secondaryFixedDim
     * }
     */
    public static final long secondaryFixedDim$offset() {
        return secondaryFixedDim$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj secondaryFixedDim
     * }
     */
    public static int secondaryFixedDim(MemorySegment struct) {
        return struct.get(secondaryFixedDim$LAYOUT, secondaryFixedDim$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj secondaryFixedDim
     * }
     */
    public static void secondaryFixedDim(MemorySegment struct, int fieldValue) {
        struct.set(secondaryFixedDim$LAYOUT, secondaryFixedDim$OFFSET, fieldValue);
    }

    private static final OfInt onSecondaryFixed$LAYOUT = (OfInt)$LAYOUT.select(groupElement("onSecondaryFixed"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj onSecondaryFixed
     * }
     */
    public static final OfInt onSecondaryFixed$layout() {
        return onSecondaryFixed$LAYOUT;
    }

    private static final long onSecondaryFixed$OFFSET = 80;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj onSecondaryFixed
     * }
     */
    public static final long onSecondaryFixed$offset() {
        return onSecondaryFixed$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj onSecondaryFixed
     * }
     */
    public static int onSecondaryFixed(MemorySegment struct) {
        return struct.get(onSecondaryFixed$LAYOUT, onSecondaryFixed$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj onSecondaryFixed
     * }
     */
    public static void onSecondaryFixed(MemorySegment struct, int fieldValue) {
        struct.set(onSecondaryFixed$LAYOUT, onSecondaryFixed$OFFSET, fieldValue);
    }

    private static final OfInt onSecondaryFixedVariant$LAYOUT = (OfInt)$LAYOUT.select(groupElement("onSecondaryFixedVariant"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj onSecondaryFixedVariant
     * }
     */
    public static final OfInt onSecondaryFixedVariant$layout() {
        return onSecondaryFixedVariant$LAYOUT;
    }

    private static final long onSecondaryFixedVariant$OFFSET = 84;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj onSecondaryFixedVariant
     * }
     */
    public static final long onSecondaryFixedVariant$offset() {
        return onSecondaryFixedVariant$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj onSecondaryFixedVariant
     * }
     */
    public static int onSecondaryFixedVariant(MemorySegment struct) {
        return struct.get(onSecondaryFixedVariant$LAYOUT, onSecondaryFixedVariant$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj onSecondaryFixedVariant
     * }
     */
    public static void onSecondaryFixedVariant(MemorySegment struct, int fieldValue) {
        struct.set(onSecondaryFixedVariant$LAYOUT, onSecondaryFixedVariant$OFFSET, fieldValue);
    }

    private static final OfInt tertiary$LAYOUT = (OfInt)$LAYOUT.select(groupElement("tertiary"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj tertiary
     * }
     */
    public static final OfInt tertiary$layout() {
        return tertiary$LAYOUT;
    }

    private static final long tertiary$OFFSET = 88;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj tertiary
     * }
     */
    public static final long tertiary$offset() {
        return tertiary$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj tertiary
     * }
     */
    public static int tertiary(MemorySegment struct) {
        return struct.get(tertiary$LAYOUT, tertiary$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj tertiary
     * }
     */
    public static void tertiary(MemorySegment struct, int fieldValue) {
        struct.set(tertiary$LAYOUT, tertiary$OFFSET, fieldValue);
    }

    private static final OfInt onTertiary$LAYOUT = (OfInt)$LAYOUT.select(groupElement("onTertiary"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj onTertiary
     * }
     */
    public static final OfInt onTertiary$layout() {
        return onTertiary$LAYOUT;
    }

    private static final long onTertiary$OFFSET = 92;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj onTertiary
     * }
     */
    public static final long onTertiary$offset() {
        return onTertiary$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj onTertiary
     * }
     */
    public static int onTertiary(MemorySegment struct) {
        return struct.get(onTertiary$LAYOUT, onTertiary$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj onTertiary
     * }
     */
    public static void onTertiary(MemorySegment struct, int fieldValue) {
        struct.set(onTertiary$LAYOUT, onTertiary$OFFSET, fieldValue);
    }

    private static final OfInt tertiaryContainer$LAYOUT = (OfInt)$LAYOUT.select(groupElement("tertiaryContainer"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj tertiaryContainer
     * }
     */
    public static final OfInt tertiaryContainer$layout() {
        return tertiaryContainer$LAYOUT;
    }

    private static final long tertiaryContainer$OFFSET = 96;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj tertiaryContainer
     * }
     */
    public static final long tertiaryContainer$offset() {
        return tertiaryContainer$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj tertiaryContainer
     * }
     */
    public static int tertiaryContainer(MemorySegment struct) {
        return struct.get(tertiaryContainer$LAYOUT, tertiaryContainer$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj tertiaryContainer
     * }
     */
    public static void tertiaryContainer(MemorySegment struct, int fieldValue) {
        struct.set(tertiaryContainer$LAYOUT, tertiaryContainer$OFFSET, fieldValue);
    }

    private static final OfInt onTertiaryContainer$LAYOUT = (OfInt)$LAYOUT.select(groupElement("onTertiaryContainer"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj onTertiaryContainer
     * }
     */
    public static final OfInt onTertiaryContainer$layout() {
        return onTertiaryContainer$LAYOUT;
    }

    private static final long onTertiaryContainer$OFFSET = 100;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj onTertiaryContainer
     * }
     */
    public static final long onTertiaryContainer$offset() {
        return onTertiaryContainer$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj onTertiaryContainer
     * }
     */
    public static int onTertiaryContainer(MemorySegment struct) {
        return struct.get(onTertiaryContainer$LAYOUT, onTertiaryContainer$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj onTertiaryContainer
     * }
     */
    public static void onTertiaryContainer(MemorySegment struct, int fieldValue) {
        struct.set(onTertiaryContainer$LAYOUT, onTertiaryContainer$OFFSET, fieldValue);
    }

    private static final OfInt tertiaryFixed$LAYOUT = (OfInt)$LAYOUT.select(groupElement("tertiaryFixed"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj tertiaryFixed
     * }
     */
    public static final OfInt tertiaryFixed$layout() {
        return tertiaryFixed$LAYOUT;
    }

    private static final long tertiaryFixed$OFFSET = 104;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj tertiaryFixed
     * }
     */
    public static final long tertiaryFixed$offset() {
        return tertiaryFixed$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj tertiaryFixed
     * }
     */
    public static int tertiaryFixed(MemorySegment struct) {
        return struct.get(tertiaryFixed$LAYOUT, tertiaryFixed$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj tertiaryFixed
     * }
     */
    public static void tertiaryFixed(MemorySegment struct, int fieldValue) {
        struct.set(tertiaryFixed$LAYOUT, tertiaryFixed$OFFSET, fieldValue);
    }

    private static final OfInt tertiaryFixedDim$LAYOUT = (OfInt)$LAYOUT.select(groupElement("tertiaryFixedDim"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj tertiaryFixedDim
     * }
     */
    public static final OfInt tertiaryFixedDim$layout() {
        return tertiaryFixedDim$LAYOUT;
    }

    private static final long tertiaryFixedDim$OFFSET = 108;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj tertiaryFixedDim
     * }
     */
    public static final long tertiaryFixedDim$offset() {
        return tertiaryFixedDim$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj tertiaryFixedDim
     * }
     */
    public static int tertiaryFixedDim(MemorySegment struct) {
        return struct.get(tertiaryFixedDim$LAYOUT, tertiaryFixedDim$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj tertiaryFixedDim
     * }
     */
    public static void tertiaryFixedDim(MemorySegment struct, int fieldValue) {
        struct.set(tertiaryFixedDim$LAYOUT, tertiaryFixedDim$OFFSET, fieldValue);
    }

    private static final OfInt onTertiaryFixed$LAYOUT = (OfInt)$LAYOUT.select(groupElement("onTertiaryFixed"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj onTertiaryFixed
     * }
     */
    public static final OfInt onTertiaryFixed$layout() {
        return onTertiaryFixed$LAYOUT;
    }

    private static final long onTertiaryFixed$OFFSET = 112;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj onTertiaryFixed
     * }
     */
    public static final long onTertiaryFixed$offset() {
        return onTertiaryFixed$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj onTertiaryFixed
     * }
     */
    public static int onTertiaryFixed(MemorySegment struct) {
        return struct.get(onTertiaryFixed$LAYOUT, onTertiaryFixed$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj onTertiaryFixed
     * }
     */
    public static void onTertiaryFixed(MemorySegment struct, int fieldValue) {
        struct.set(onTertiaryFixed$LAYOUT, onTertiaryFixed$OFFSET, fieldValue);
    }

    private static final OfInt onTertiaryFixedVariant$LAYOUT = (OfInt)$LAYOUT.select(groupElement("onTertiaryFixedVariant"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj onTertiaryFixedVariant
     * }
     */
    public static final OfInt onTertiaryFixedVariant$layout() {
        return onTertiaryFixedVariant$LAYOUT;
    }

    private static final long onTertiaryFixedVariant$OFFSET = 116;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj onTertiaryFixedVariant
     * }
     */
    public static final long onTertiaryFixedVariant$offset() {
        return onTertiaryFixedVariant$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj onTertiaryFixedVariant
     * }
     */
    public static int onTertiaryFixedVariant(MemorySegment struct) {
        return struct.get(onTertiaryFixedVariant$LAYOUT, onTertiaryFixedVariant$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj onTertiaryFixedVariant
     * }
     */
    public static void onTertiaryFixedVariant(MemorySegment struct, int fieldValue) {
        struct.set(onTertiaryFixedVariant$LAYOUT, onTertiaryFixedVariant$OFFSET, fieldValue);
    }

    private static final OfInt errorContainer$LAYOUT = (OfInt)$LAYOUT.select(groupElement("errorContainer"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj errorContainer
     * }
     */
    public static final OfInt errorContainer$layout() {
        return errorContainer$LAYOUT;
    }

    private static final long errorContainer$OFFSET = 120;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj errorContainer
     * }
     */
    public static final long errorContainer$offset() {
        return errorContainer$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj errorContainer
     * }
     */
    public static int errorContainer(MemorySegment struct) {
        return struct.get(errorContainer$LAYOUT, errorContainer$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj errorContainer
     * }
     */
    public static void errorContainer(MemorySegment struct, int fieldValue) {
        struct.set(errorContainer$LAYOUT, errorContainer$OFFSET, fieldValue);
    }

    private static final OfInt onErrorContainer$LAYOUT = (OfInt)$LAYOUT.select(groupElement("onErrorContainer"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj onErrorContainer
     * }
     */
    public static final OfInt onErrorContainer$layout() {
        return onErrorContainer$LAYOUT;
    }

    private static final long onErrorContainer$OFFSET = 124;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj onErrorContainer
     * }
     */
    public static final long onErrorContainer$offset() {
        return onErrorContainer$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj onErrorContainer
     * }
     */
    public static int onErrorContainer(MemorySegment struct) {
        return struct.get(onErrorContainer$LAYOUT, onErrorContainer$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj onErrorContainer
     * }
     */
    public static void onErrorContainer(MemorySegment struct, int fieldValue) {
        struct.set(onErrorContainer$LAYOUT, onErrorContainer$OFFSET, fieldValue);
    }

    private static final OfInt surfaceVariant$LAYOUT = (OfInt)$LAYOUT.select(groupElement("surfaceVariant"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj surfaceVariant
     * }
     */
    public static final OfInt surfaceVariant$layout() {
        return surfaceVariant$LAYOUT;
    }

    private static final long surfaceVariant$OFFSET = 128;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj surfaceVariant
     * }
     */
    public static final long surfaceVariant$offset() {
        return surfaceVariant$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj surfaceVariant
     * }
     */
    public static int surfaceVariant(MemorySegment struct) {
        return struct.get(surfaceVariant$LAYOUT, surfaceVariant$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj surfaceVariant
     * }
     */
    public static void surfaceVariant(MemorySegment struct, int fieldValue) {
        struct.set(surfaceVariant$LAYOUT, surfaceVariant$OFFSET, fieldValue);
    }

    private static final OfInt surfaceDim$LAYOUT = (OfInt)$LAYOUT.select(groupElement("surfaceDim"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj surfaceDim
     * }
     */
    public static final OfInt surfaceDim$layout() {
        return surfaceDim$LAYOUT;
    }

    private static final long surfaceDim$OFFSET = 132;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj surfaceDim
     * }
     */
    public static final long surfaceDim$offset() {
        return surfaceDim$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj surfaceDim
     * }
     */
    public static int surfaceDim(MemorySegment struct) {
        return struct.get(surfaceDim$LAYOUT, surfaceDim$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj surfaceDim
     * }
     */
    public static void surfaceDim(MemorySegment struct, int fieldValue) {
        struct.set(surfaceDim$LAYOUT, surfaceDim$OFFSET, fieldValue);
    }

    private static final OfInt surfaceBright$LAYOUT = (OfInt)$LAYOUT.select(groupElement("surfaceBright"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj surfaceBright
     * }
     */
    public static final OfInt surfaceBright$layout() {
        return surfaceBright$LAYOUT;
    }

    private static final long surfaceBright$OFFSET = 136;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj surfaceBright
     * }
     */
    public static final long surfaceBright$offset() {
        return surfaceBright$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj surfaceBright
     * }
     */
    public static int surfaceBright(MemorySegment struct) {
        return struct.get(surfaceBright$LAYOUT, surfaceBright$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj surfaceBright
     * }
     */
    public static void surfaceBright(MemorySegment struct, int fieldValue) {
        struct.set(surfaceBright$LAYOUT, surfaceBright$OFFSET, fieldValue);
    }

    private static final OfInt surfaceContainerLowest$LAYOUT = (OfInt)$LAYOUT.select(groupElement("surfaceContainerLowest"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj surfaceContainerLowest
     * }
     */
    public static final OfInt surfaceContainerLowest$layout() {
        return surfaceContainerLowest$LAYOUT;
    }

    private static final long surfaceContainerLowest$OFFSET = 140;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj surfaceContainerLowest
     * }
     */
    public static final long surfaceContainerLowest$offset() {
        return surfaceContainerLowest$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj surfaceContainerLowest
     * }
     */
    public static int surfaceContainerLowest(MemorySegment struct) {
        return struct.get(surfaceContainerLowest$LAYOUT, surfaceContainerLowest$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj surfaceContainerLowest
     * }
     */
    public static void surfaceContainerLowest(MemorySegment struct, int fieldValue) {
        struct.set(surfaceContainerLowest$LAYOUT, surfaceContainerLowest$OFFSET, fieldValue);
    }

    private static final OfInt surfaceContainerLow$LAYOUT = (OfInt)$LAYOUT.select(groupElement("surfaceContainerLow"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj surfaceContainerLow
     * }
     */
    public static final OfInt surfaceContainerLow$layout() {
        return surfaceContainerLow$LAYOUT;
    }

    private static final long surfaceContainerLow$OFFSET = 144;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj surfaceContainerLow
     * }
     */
    public static final long surfaceContainerLow$offset() {
        return surfaceContainerLow$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj surfaceContainerLow
     * }
     */
    public static int surfaceContainerLow(MemorySegment struct) {
        return struct.get(surfaceContainerLow$LAYOUT, surfaceContainerLow$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj surfaceContainerLow
     * }
     */
    public static void surfaceContainerLow(MemorySegment struct, int fieldValue) {
        struct.set(surfaceContainerLow$LAYOUT, surfaceContainerLow$OFFSET, fieldValue);
    }

    private static final OfInt surfaceContainer$LAYOUT = (OfInt)$LAYOUT.select(groupElement("surfaceContainer"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj surfaceContainer
     * }
     */
    public static final OfInt surfaceContainer$layout() {
        return surfaceContainer$LAYOUT;
    }

    private static final long surfaceContainer$OFFSET = 148;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj surfaceContainer
     * }
     */
    public static final long surfaceContainer$offset() {
        return surfaceContainer$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj surfaceContainer
     * }
     */
    public static int surfaceContainer(MemorySegment struct) {
        return struct.get(surfaceContainer$LAYOUT, surfaceContainer$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj surfaceContainer
     * }
     */
    public static void surfaceContainer(MemorySegment struct, int fieldValue) {
        struct.set(surfaceContainer$LAYOUT, surfaceContainer$OFFSET, fieldValue);
    }

    private static final OfInt surfaceContainerHigh$LAYOUT = (OfInt)$LAYOUT.select(groupElement("surfaceContainerHigh"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj surfaceContainerHigh
     * }
     */
    public static final OfInt surfaceContainerHigh$layout() {
        return surfaceContainerHigh$LAYOUT;
    }

    private static final long surfaceContainerHigh$OFFSET = 152;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj surfaceContainerHigh
     * }
     */
    public static final long surfaceContainerHigh$offset() {
        return surfaceContainerHigh$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj surfaceContainerHigh
     * }
     */
    public static int surfaceContainerHigh(MemorySegment struct) {
        return struct.get(surfaceContainerHigh$LAYOUT, surfaceContainerHigh$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj surfaceContainerHigh
     * }
     */
    public static void surfaceContainerHigh(MemorySegment struct, int fieldValue) {
        struct.set(surfaceContainerHigh$LAYOUT, surfaceContainerHigh$OFFSET, fieldValue);
    }

    private static final OfInt surfaceContainerHighest$LAYOUT = (OfInt)$LAYOUT.select(groupElement("surfaceContainerHighest"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj surfaceContainerHighest
     * }
     */
    public static final OfInt surfaceContainerHighest$layout() {
        return surfaceContainerHighest$LAYOUT;
    }

    private static final long surfaceContainerHighest$OFFSET = 156;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj surfaceContainerHighest
     * }
     */
    public static final long surfaceContainerHighest$offset() {
        return surfaceContainerHighest$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj surfaceContainerHighest
     * }
     */
    public static int surfaceContainerHighest(MemorySegment struct) {
        return struct.get(surfaceContainerHighest$LAYOUT, surfaceContainerHighest$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj surfaceContainerHighest
     * }
     */
    public static void surfaceContainerHighest(MemorySegment struct, int fieldValue) {
        struct.set(surfaceContainerHighest$LAYOUT, surfaceContainerHighest$OFFSET, fieldValue);
    }

    private static final OfInt onSurfaceVariant$LAYOUT = (OfInt)$LAYOUT.select(groupElement("onSurfaceVariant"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj onSurfaceVariant
     * }
     */
    public static final OfInt onSurfaceVariant$layout() {
        return onSurfaceVariant$LAYOUT;
    }

    private static final long onSurfaceVariant$OFFSET = 160;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj onSurfaceVariant
     * }
     */
    public static final long onSurfaceVariant$offset() {
        return onSurfaceVariant$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj onSurfaceVariant
     * }
     */
    public static int onSurfaceVariant(MemorySegment struct) {
        return struct.get(onSurfaceVariant$LAYOUT, onSurfaceVariant$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj onSurfaceVariant
     * }
     */
    public static void onSurfaceVariant(MemorySegment struct, int fieldValue) {
        struct.set(onSurfaceVariant$LAYOUT, onSurfaceVariant$OFFSET, fieldValue);
    }

    private static final OfInt outline$LAYOUT = (OfInt)$LAYOUT.select(groupElement("outline"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj outline
     * }
     */
    public static final OfInt outline$layout() {
        return outline$LAYOUT;
    }

    private static final long outline$OFFSET = 164;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj outline
     * }
     */
    public static final long outline$offset() {
        return outline$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj outline
     * }
     */
    public static int outline(MemorySegment struct) {
        return struct.get(outline$LAYOUT, outline$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj outline
     * }
     */
    public static void outline(MemorySegment struct, int fieldValue) {
        struct.set(outline$LAYOUT, outline$OFFSET, fieldValue);
    }

    private static final OfInt outlineVariant$LAYOUT = (OfInt)$LAYOUT.select(groupElement("outlineVariant"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj outlineVariant
     * }
     */
    public static final OfInt outlineVariant$layout() {
        return outlineVariant$LAYOUT;
    }

    private static final long outlineVariant$OFFSET = 168;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj outlineVariant
     * }
     */
    public static final long outlineVariant$offset() {
        return outlineVariant$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj outlineVariant
     * }
     */
    public static int outlineVariant(MemorySegment struct) {
        return struct.get(outlineVariant$LAYOUT, outlineVariant$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj outlineVariant
     * }
     */
    public static void outlineVariant(MemorySegment struct, int fieldValue) {
        struct.set(outlineVariant$LAYOUT, outlineVariant$OFFSET, fieldValue);
    }

    private static final OfInt shadow$LAYOUT = (OfInt)$LAYOUT.select(groupElement("shadow"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj shadow
     * }
     */
    public static final OfInt shadow$layout() {
        return shadow$LAYOUT;
    }

    private static final long shadow$OFFSET = 172;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj shadow
     * }
     */
    public static final long shadow$offset() {
        return shadow$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj shadow
     * }
     */
    public static int shadow(MemorySegment struct) {
        return struct.get(shadow$LAYOUT, shadow$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj shadow
     * }
     */
    public static void shadow(MemorySegment struct, int fieldValue) {
        struct.set(shadow$LAYOUT, shadow$OFFSET, fieldValue);
    }

    private static final OfInt scrim$LAYOUT = (OfInt)$LAYOUT.select(groupElement("scrim"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj scrim
     * }
     */
    public static final OfInt scrim$layout() {
        return scrim$LAYOUT;
    }

    private static final long scrim$OFFSET = 176;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj scrim
     * }
     */
    public static final long scrim$offset() {
        return scrim$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj scrim
     * }
     */
    public static int scrim(MemorySegment struct) {
        return struct.get(scrim$LAYOUT, scrim$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj scrim
     * }
     */
    public static void scrim(MemorySegment struct, int fieldValue) {
        struct.set(scrim$LAYOUT, scrim$OFFSET, fieldValue);
    }

    private static final OfInt inverseSurface$LAYOUT = (OfInt)$LAYOUT.select(groupElement("inverseSurface"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj inverseSurface
     * }
     */
    public static final OfInt inverseSurface$layout() {
        return inverseSurface$LAYOUT;
    }

    private static final long inverseSurface$OFFSET = 180;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj inverseSurface
     * }
     */
    public static final long inverseSurface$offset() {
        return inverseSurface$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj inverseSurface
     * }
     */
    public static int inverseSurface(MemorySegment struct) {
        return struct.get(inverseSurface$LAYOUT, inverseSurface$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj inverseSurface
     * }
     */
    public static void inverseSurface(MemorySegment struct, int fieldValue) {
        struct.set(inverseSurface$LAYOUT, inverseSurface$OFFSET, fieldValue);
    }

    private static final OfInt onInverseSurface$LAYOUT = (OfInt)$LAYOUT.select(groupElement("onInverseSurface"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj onInverseSurface
     * }
     */
    public static final OfInt onInverseSurface$layout() {
        return onInverseSurface$LAYOUT;
    }

    private static final long onInverseSurface$OFFSET = 184;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj onInverseSurface
     * }
     */
    public static final long onInverseSurface$offset() {
        return onInverseSurface$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj onInverseSurface
     * }
     */
    public static int onInverseSurface(MemorySegment struct) {
        return struct.get(onInverseSurface$LAYOUT, onInverseSurface$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj onInverseSurface
     * }
     */
    public static void onInverseSurface(MemorySegment struct, int fieldValue) {
        struct.set(onInverseSurface$LAYOUT, onInverseSurface$OFFSET, fieldValue);
    }

    private static final OfInt inversePrimary$LAYOUT = (OfInt)$LAYOUT.select(groupElement("inversePrimary"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj inversePrimary
     * }
     */
    public static final OfInt inversePrimary$layout() {
        return inversePrimary$LAYOUT;
    }

    private static final long inversePrimary$OFFSET = 188;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj inversePrimary
     * }
     */
    public static final long inversePrimary$offset() {
        return inversePrimary$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj inversePrimary
     * }
     */
    public static int inversePrimary(MemorySegment struct) {
        return struct.get(inversePrimary$LAYOUT, inversePrimary$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj inversePrimary
     * }
     */
    public static void inversePrimary(MemorySegment struct, int fieldValue) {
        struct.set(inversePrimary$LAYOUT, inversePrimary$OFFSET, fieldValue);
    }

    private static final OfInt surfaceTint$LAYOUT = (OfInt)$LAYOUT.select(groupElement("surfaceTint"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj surfaceTint
     * }
     */
    public static final OfInt surfaceTint$layout() {
        return surfaceTint$LAYOUT;
    }

    private static final long surfaceTint$OFFSET = 192;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj surfaceTint
     * }
     */
    public static final long surfaceTint$offset() {
        return surfaceTint$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj surfaceTint
     * }
     */
    public static int surfaceTint(MemorySegment struct) {
        return struct.get(surfaceTint$LAYOUT, surfaceTint$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj surfaceTint
     * }
     */
    public static void surfaceTint(MemorySegment struct, int fieldValue) {
        struct.set(surfaceTint$LAYOUT, surfaceTint$OFFSET, fieldValue);
    }

    private static final OfInt background$LAYOUT = (OfInt)$LAYOUT.select(groupElement("background"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj background
     * }
     */
    public static final OfInt background$layout() {
        return background$LAYOUT;
    }

    private static final long background$OFFSET = 196;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj background
     * }
     */
    public static final long background$offset() {
        return background$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj background
     * }
     */
    public static int background(MemorySegment struct) {
        return struct.get(background$LAYOUT, background$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj background
     * }
     */
    public static void background(MemorySegment struct, int fieldValue) {
        struct.set(background$LAYOUT, background$OFFSET, fieldValue);
    }

    private static final OfInt onBackground$LAYOUT = (OfInt)$LAYOUT.select(groupElement("onBackground"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj onBackground
     * }
     */
    public static final OfInt onBackground$layout() {
        return onBackground$LAYOUT;
    }

    private static final long onBackground$OFFSET = 200;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj onBackground
     * }
     */
    public static final long onBackground$offset() {
        return onBackground$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj onBackground
     * }
     */
    public static int onBackground(MemorySegment struct) {
        return struct.get(onBackground$LAYOUT, onBackground$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj onBackground
     * }
     */
    public static void onBackground(MemorySegment struct, int fieldValue) {
        struct.set(onBackground$LAYOUT, onBackground$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
