// Generated by jextract

package dev.equo.ewt.ffm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     int id;
 *     DartObj child;
 *     DartObj alignment;
 *     DartObj padding;
 *     DartObj color;
 *     int isAntiAlias;
 *     DartObj decoration;
 *     DartObj foregroundDecoration;
 *     BoxConstraintsObjSt constraints;
 *     DartObj margin;
 *     DartObj transformAlignment;
 *     int clipBehavior;
 * }
 * }
 */
public class ContainerObjSt {

    ContainerObjSt() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        StarterBridge.C_INT.withName("id"),
        StarterBridge.C_INT.withName("child"),
        StarterBridge.C_INT.withName("alignment"),
        StarterBridge.C_INT.withName("padding"),
        StarterBridge.C_INT.withName("color"),
        StarterBridge.C_INT.withName("isAntiAlias"),
        StarterBridge.C_INT.withName("decoration"),
        StarterBridge.C_INT.withName("foregroundDecoration"),
        BoxConstraintsObjSt.layout().withName("constraints"),
        StarterBridge.C_INT.withName("margin"),
        StarterBridge.C_INT.withName("transformAlignment"),
        StarterBridge.C_INT.withName("clipBehavior"),
        MemoryLayout.paddingLayout(4)
    ).withName("$anon$153:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt id$LAYOUT = (OfInt)$LAYOUT.select(groupElement("id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final OfInt id$layout() {
        return id$LAYOUT;
    }

    private static final long id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final long id$offset() {
        return id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static int id(MemorySegment struct) {
        return struct.get(id$LAYOUT, id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static void id(MemorySegment struct, int fieldValue) {
        struct.set(id$LAYOUT, id$OFFSET, fieldValue);
    }

    private static final OfInt child$LAYOUT = (OfInt)$LAYOUT.select(groupElement("child"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj child
     * }
     */
    public static final OfInt child$layout() {
        return child$LAYOUT;
    }

    private static final long child$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj child
     * }
     */
    public static final long child$offset() {
        return child$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj child
     * }
     */
    public static int child(MemorySegment struct) {
        return struct.get(child$LAYOUT, child$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj child
     * }
     */
    public static void child(MemorySegment struct, int fieldValue) {
        struct.set(child$LAYOUT, child$OFFSET, fieldValue);
    }

    private static final OfInt alignment$LAYOUT = (OfInt)$LAYOUT.select(groupElement("alignment"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj alignment
     * }
     */
    public static final OfInt alignment$layout() {
        return alignment$LAYOUT;
    }

    private static final long alignment$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj alignment
     * }
     */
    public static final long alignment$offset() {
        return alignment$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj alignment
     * }
     */
    public static int alignment(MemorySegment struct) {
        return struct.get(alignment$LAYOUT, alignment$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj alignment
     * }
     */
    public static void alignment(MemorySegment struct, int fieldValue) {
        struct.set(alignment$LAYOUT, alignment$OFFSET, fieldValue);
    }

    private static final OfInt padding$LAYOUT = (OfInt)$LAYOUT.select(groupElement("padding"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj padding
     * }
     */
    public static final OfInt padding$layout() {
        return padding$LAYOUT;
    }

    private static final long padding$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj padding
     * }
     */
    public static final long padding$offset() {
        return padding$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj padding
     * }
     */
    public static int padding(MemorySegment struct) {
        return struct.get(padding$LAYOUT, padding$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj padding
     * }
     */
    public static void padding(MemorySegment struct, int fieldValue) {
        struct.set(padding$LAYOUT, padding$OFFSET, fieldValue);
    }

    private static final OfInt color$LAYOUT = (OfInt)$LAYOUT.select(groupElement("color"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj color
     * }
     */
    public static final OfInt color$layout() {
        return color$LAYOUT;
    }

    private static final long color$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj color
     * }
     */
    public static final long color$offset() {
        return color$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj color
     * }
     */
    public static int color(MemorySegment struct) {
        return struct.get(color$LAYOUT, color$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj color
     * }
     */
    public static void color(MemorySegment struct, int fieldValue) {
        struct.set(color$LAYOUT, color$OFFSET, fieldValue);
    }

    private static final OfInt isAntiAlias$LAYOUT = (OfInt)$LAYOUT.select(groupElement("isAntiAlias"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int isAntiAlias
     * }
     */
    public static final OfInt isAntiAlias$layout() {
        return isAntiAlias$LAYOUT;
    }

    private static final long isAntiAlias$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int isAntiAlias
     * }
     */
    public static final long isAntiAlias$offset() {
        return isAntiAlias$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int isAntiAlias
     * }
     */
    public static int isAntiAlias(MemorySegment struct) {
        return struct.get(isAntiAlias$LAYOUT, isAntiAlias$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int isAntiAlias
     * }
     */
    public static void isAntiAlias(MemorySegment struct, int fieldValue) {
        struct.set(isAntiAlias$LAYOUT, isAntiAlias$OFFSET, fieldValue);
    }

    private static final OfInt decoration$LAYOUT = (OfInt)$LAYOUT.select(groupElement("decoration"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj decoration
     * }
     */
    public static final OfInt decoration$layout() {
        return decoration$LAYOUT;
    }

    private static final long decoration$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj decoration
     * }
     */
    public static final long decoration$offset() {
        return decoration$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj decoration
     * }
     */
    public static int decoration(MemorySegment struct) {
        return struct.get(decoration$LAYOUT, decoration$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj decoration
     * }
     */
    public static void decoration(MemorySegment struct, int fieldValue) {
        struct.set(decoration$LAYOUT, decoration$OFFSET, fieldValue);
    }

    private static final OfInt foregroundDecoration$LAYOUT = (OfInt)$LAYOUT.select(groupElement("foregroundDecoration"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj foregroundDecoration
     * }
     */
    public static final OfInt foregroundDecoration$layout() {
        return foregroundDecoration$LAYOUT;
    }

    private static final long foregroundDecoration$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj foregroundDecoration
     * }
     */
    public static final long foregroundDecoration$offset() {
        return foregroundDecoration$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj foregroundDecoration
     * }
     */
    public static int foregroundDecoration(MemorySegment struct) {
        return struct.get(foregroundDecoration$LAYOUT, foregroundDecoration$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj foregroundDecoration
     * }
     */
    public static void foregroundDecoration(MemorySegment struct, int fieldValue) {
        struct.set(foregroundDecoration$LAYOUT, foregroundDecoration$OFFSET, fieldValue);
    }

    private static final GroupLayout constraints$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("constraints"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * BoxConstraintsObjSt constraints
     * }
     */
    public static final GroupLayout constraints$layout() {
        return constraints$LAYOUT;
    }

    private static final long constraints$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * BoxConstraintsObjSt constraints
     * }
     */
    public static final long constraints$offset() {
        return constraints$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * BoxConstraintsObjSt constraints
     * }
     */
    public static MemorySegment constraints(MemorySegment struct) {
        return struct.asSlice(constraints$OFFSET, constraints$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * BoxConstraintsObjSt constraints
     * }
     */
    public static void constraints(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, constraints$OFFSET, constraints$LAYOUT.byteSize());
    }

    private static final OfInt margin$LAYOUT = (OfInt)$LAYOUT.select(groupElement("margin"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj margin
     * }
     */
    public static final OfInt margin$layout() {
        return margin$LAYOUT;
    }

    private static final long margin$OFFSET = 96;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj margin
     * }
     */
    public static final long margin$offset() {
        return margin$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj margin
     * }
     */
    public static int margin(MemorySegment struct) {
        return struct.get(margin$LAYOUT, margin$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj margin
     * }
     */
    public static void margin(MemorySegment struct, int fieldValue) {
        struct.set(margin$LAYOUT, margin$OFFSET, fieldValue);
    }

    private static final OfInt transformAlignment$LAYOUT = (OfInt)$LAYOUT.select(groupElement("transformAlignment"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj transformAlignment
     * }
     */
    public static final OfInt transformAlignment$layout() {
        return transformAlignment$LAYOUT;
    }

    private static final long transformAlignment$OFFSET = 100;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj transformAlignment
     * }
     */
    public static final long transformAlignment$offset() {
        return transformAlignment$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj transformAlignment
     * }
     */
    public static int transformAlignment(MemorySegment struct) {
        return struct.get(transformAlignment$LAYOUT, transformAlignment$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj transformAlignment
     * }
     */
    public static void transformAlignment(MemorySegment struct, int fieldValue) {
        struct.set(transformAlignment$LAYOUT, transformAlignment$OFFSET, fieldValue);
    }

    private static final OfInt clipBehavior$LAYOUT = (OfInt)$LAYOUT.select(groupElement("clipBehavior"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int clipBehavior
     * }
     */
    public static final OfInt clipBehavior$layout() {
        return clipBehavior$LAYOUT;
    }

    private static final long clipBehavior$OFFSET = 104;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int clipBehavior
     * }
     */
    public static final long clipBehavior$offset() {
        return clipBehavior$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int clipBehavior
     * }
     */
    public static int clipBehavior(MemorySegment struct) {
        return struct.get(clipBehavior$LAYOUT, clipBehavior$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int clipBehavior
     * }
     */
    public static void clipBehavior(MemorySegment struct, int fieldValue) {
        struct.set(clipBehavior$LAYOUT, clipBehavior$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

