// Generated by jextract

package dev.equo.ewt.ffm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     int id;
 *     double height;
 *     double thickness;
 *     double indent;
 *     double endIndent;
 *     DartObj radius;
 *     DartObj color;
 * }
 * }
 */
public class DividerObjSt {

    DividerObjSt() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        StarterBridge.C_INT.withName("id"),
        MemoryLayout.paddingLayout(4),
        StarterBridge.C_DOUBLE.withName("height"),
        StarterBridge.C_DOUBLE.withName("thickness"),
        StarterBridge.C_DOUBLE.withName("indent"),
        StarterBridge.C_DOUBLE.withName("endIndent"),
        StarterBridge.C_INT.withName("radius"),
        StarterBridge.C_INT.withName("color")
    ).withName("$anon$779:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt id$LAYOUT = (OfInt)$LAYOUT.select(groupElement("id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final OfInt id$layout() {
        return id$LAYOUT;
    }

    private static final long id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final long id$offset() {
        return id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static int id(MemorySegment struct) {
        return struct.get(id$LAYOUT, id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static void id(MemorySegment struct, int fieldValue) {
        struct.set(id$LAYOUT, id$OFFSET, fieldValue);
    }

    private static final OfDouble height$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("height"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double height
     * }
     */
    public static final OfDouble height$layout() {
        return height$LAYOUT;
    }

    private static final long height$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double height
     * }
     */
    public static final long height$offset() {
        return height$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double height
     * }
     */
    public static double height(MemorySegment struct) {
        return struct.get(height$LAYOUT, height$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double height
     * }
     */
    public static void height(MemorySegment struct, double fieldValue) {
        struct.set(height$LAYOUT, height$OFFSET, fieldValue);
    }

    private static final OfDouble thickness$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("thickness"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double thickness
     * }
     */
    public static final OfDouble thickness$layout() {
        return thickness$LAYOUT;
    }

    private static final long thickness$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double thickness
     * }
     */
    public static final long thickness$offset() {
        return thickness$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double thickness
     * }
     */
    public static double thickness(MemorySegment struct) {
        return struct.get(thickness$LAYOUT, thickness$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double thickness
     * }
     */
    public static void thickness(MemorySegment struct, double fieldValue) {
        struct.set(thickness$LAYOUT, thickness$OFFSET, fieldValue);
    }

    private static final OfDouble indent$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("indent"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double indent
     * }
     */
    public static final OfDouble indent$layout() {
        return indent$LAYOUT;
    }

    private static final long indent$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double indent
     * }
     */
    public static final long indent$offset() {
        return indent$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double indent
     * }
     */
    public static double indent(MemorySegment struct) {
        return struct.get(indent$LAYOUT, indent$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double indent
     * }
     */
    public static void indent(MemorySegment struct, double fieldValue) {
        struct.set(indent$LAYOUT, indent$OFFSET, fieldValue);
    }

    private static final OfDouble endIndent$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("endIndent"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double endIndent
     * }
     */
    public static final OfDouble endIndent$layout() {
        return endIndent$LAYOUT;
    }

    private static final long endIndent$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double endIndent
     * }
     */
    public static final long endIndent$offset() {
        return endIndent$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double endIndent
     * }
     */
    public static double endIndent(MemorySegment struct) {
        return struct.get(endIndent$LAYOUT, endIndent$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double endIndent
     * }
     */
    public static void endIndent(MemorySegment struct, double fieldValue) {
        struct.set(endIndent$LAYOUT, endIndent$OFFSET, fieldValue);
    }

    private static final OfInt radius$LAYOUT = (OfInt)$LAYOUT.select(groupElement("radius"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj radius
     * }
     */
    public static final OfInt radius$layout() {
        return radius$LAYOUT;
    }

    private static final long radius$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj radius
     * }
     */
    public static final long radius$offset() {
        return radius$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj radius
     * }
     */
    public static int radius(MemorySegment struct) {
        return struct.get(radius$LAYOUT, radius$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj radius
     * }
     */
    public static void radius(MemorySegment struct, int fieldValue) {
        struct.set(radius$LAYOUT, radius$OFFSET, fieldValue);
    }

    private static final OfInt color$LAYOUT = (OfInt)$LAYOUT.select(groupElement("color"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj color
     * }
     */
    public static final OfInt color$layout() {
        return color$LAYOUT;
    }

    private static final long color$OFFSET = 44;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj color
     * }
     */
    public static final long color$offset() {
        return color$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj color
     * }
     */
    public static int color(MemorySegment struct) {
        return struct.get(color$LAYOUT, color$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj color
     * }
     */
    public static void color(MemorySegment struct, int fieldValue) {
        struct.set(color$LAYOUT, color$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

