// Generated by jextract

package dev.equo.ewt.ffm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     int id;
 *     DartObj child;
 *     char *tooltip;
 *     DartObj foregroundColor;
 *     DartObj backgroundColor;
 *     DartObj focusColor;
 *     DartObj hoverColor;
 *     DartObj splashColor;
 *     double elevation;
 *     double focusElevation;
 *     double hoverElevation;
 *     double highlightElevation;
 *     double disabledElevation;
 *     int mini;
 *     DartObj shape;
 *     int clipBehavior;
 *     int isExtended;
 *     int autofocus;
 *     int materialTapTargetSize;
 *     int enableFeedback;
 *     double extendedIconLabelSpacing;
 *     DartObj extendedPadding;
 *     TextStyleObjSt extendedTextStyle;
 * }
 * }
 */
public class FloatingActionButtonObjSt {

    FloatingActionButtonObjSt() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        StarterBridge.C_INT.withName("id"),
        StarterBridge.C_INT.withName("child"),
        StarterBridge.C_POINTER.withName("tooltip"),
        StarterBridge.C_INT.withName("foregroundColor"),
        StarterBridge.C_INT.withName("backgroundColor"),
        StarterBridge.C_INT.withName("focusColor"),
        StarterBridge.C_INT.withName("hoverColor"),
        StarterBridge.C_INT.withName("splashColor"),
        MemoryLayout.paddingLayout(4),
        StarterBridge.C_DOUBLE.withName("elevation"),
        StarterBridge.C_DOUBLE.withName("focusElevation"),
        StarterBridge.C_DOUBLE.withName("hoverElevation"),
        StarterBridge.C_DOUBLE.withName("highlightElevation"),
        StarterBridge.C_DOUBLE.withName("disabledElevation"),
        StarterBridge.C_INT.withName("mini"),
        StarterBridge.C_INT.withName("shape"),
        StarterBridge.C_INT.withName("clipBehavior"),
        StarterBridge.C_INT.withName("isExtended"),
        StarterBridge.C_INT.withName("autofocus"),
        StarterBridge.C_INT.withName("materialTapTargetSize"),
        StarterBridge.C_INT.withName("enableFeedback"),
        MemoryLayout.paddingLayout(4),
        StarterBridge.C_DOUBLE.withName("extendedIconLabelSpacing"),
        StarterBridge.C_INT.withName("extendedPadding"),
        MemoryLayout.paddingLayout(4),
        TextStyleObjSt.layout().withName("extendedTextStyle")
    ).withName("$anon$534:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt id$LAYOUT = (OfInt)$LAYOUT.select(groupElement("id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final OfInt id$layout() {
        return id$LAYOUT;
    }

    private static final long id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final long id$offset() {
        return id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static int id(MemorySegment struct) {
        return struct.get(id$LAYOUT, id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static void id(MemorySegment struct, int fieldValue) {
        struct.set(id$LAYOUT, id$OFFSET, fieldValue);
    }

    private static final OfInt child$LAYOUT = (OfInt)$LAYOUT.select(groupElement("child"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj child
     * }
     */
    public static final OfInt child$layout() {
        return child$LAYOUT;
    }

    private static final long child$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj child
     * }
     */
    public static final long child$offset() {
        return child$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj child
     * }
     */
    public static int child(MemorySegment struct) {
        return struct.get(child$LAYOUT, child$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj child
     * }
     */
    public static void child(MemorySegment struct, int fieldValue) {
        struct.set(child$LAYOUT, child$OFFSET, fieldValue);
    }

    private static final AddressLayout tooltip$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("tooltip"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char *tooltip
     * }
     */
    public static final AddressLayout tooltip$layout() {
        return tooltip$LAYOUT;
    }

    private static final long tooltip$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char *tooltip
     * }
     */
    public static final long tooltip$offset() {
        return tooltip$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char *tooltip
     * }
     */
    public static MemorySegment tooltip(MemorySegment struct) {
        return struct.get(tooltip$LAYOUT, tooltip$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char *tooltip
     * }
     */
    public static void tooltip(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(tooltip$LAYOUT, tooltip$OFFSET, fieldValue);
    }

    private static final OfInt foregroundColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("foregroundColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj foregroundColor
     * }
     */
    public static final OfInt foregroundColor$layout() {
        return foregroundColor$LAYOUT;
    }

    private static final long foregroundColor$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj foregroundColor
     * }
     */
    public static final long foregroundColor$offset() {
        return foregroundColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj foregroundColor
     * }
     */
    public static int foregroundColor(MemorySegment struct) {
        return struct.get(foregroundColor$LAYOUT, foregroundColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj foregroundColor
     * }
     */
    public static void foregroundColor(MemorySegment struct, int fieldValue) {
        struct.set(foregroundColor$LAYOUT, foregroundColor$OFFSET, fieldValue);
    }

    private static final OfInt backgroundColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("backgroundColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj backgroundColor
     * }
     */
    public static final OfInt backgroundColor$layout() {
        return backgroundColor$LAYOUT;
    }

    private static final long backgroundColor$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj backgroundColor
     * }
     */
    public static final long backgroundColor$offset() {
        return backgroundColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj backgroundColor
     * }
     */
    public static int backgroundColor(MemorySegment struct) {
        return struct.get(backgroundColor$LAYOUT, backgroundColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj backgroundColor
     * }
     */
    public static void backgroundColor(MemorySegment struct, int fieldValue) {
        struct.set(backgroundColor$LAYOUT, backgroundColor$OFFSET, fieldValue);
    }

    private static final OfInt focusColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("focusColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj focusColor
     * }
     */
    public static final OfInt focusColor$layout() {
        return focusColor$LAYOUT;
    }

    private static final long focusColor$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj focusColor
     * }
     */
    public static final long focusColor$offset() {
        return focusColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj focusColor
     * }
     */
    public static int focusColor(MemorySegment struct) {
        return struct.get(focusColor$LAYOUT, focusColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj focusColor
     * }
     */
    public static void focusColor(MemorySegment struct, int fieldValue) {
        struct.set(focusColor$LAYOUT, focusColor$OFFSET, fieldValue);
    }

    private static final OfInt hoverColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("hoverColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj hoverColor
     * }
     */
    public static final OfInt hoverColor$layout() {
        return hoverColor$LAYOUT;
    }

    private static final long hoverColor$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj hoverColor
     * }
     */
    public static final long hoverColor$offset() {
        return hoverColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj hoverColor
     * }
     */
    public static int hoverColor(MemorySegment struct) {
        return struct.get(hoverColor$LAYOUT, hoverColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj hoverColor
     * }
     */
    public static void hoverColor(MemorySegment struct, int fieldValue) {
        struct.set(hoverColor$LAYOUT, hoverColor$OFFSET, fieldValue);
    }

    private static final OfInt splashColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("splashColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj splashColor
     * }
     */
    public static final OfInt splashColor$layout() {
        return splashColor$LAYOUT;
    }

    private static final long splashColor$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj splashColor
     * }
     */
    public static final long splashColor$offset() {
        return splashColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj splashColor
     * }
     */
    public static int splashColor(MemorySegment struct) {
        return struct.get(splashColor$LAYOUT, splashColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj splashColor
     * }
     */
    public static void splashColor(MemorySegment struct, int fieldValue) {
        struct.set(splashColor$LAYOUT, splashColor$OFFSET, fieldValue);
    }

    private static final OfDouble elevation$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("elevation"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double elevation
     * }
     */
    public static final OfDouble elevation$layout() {
        return elevation$LAYOUT;
    }

    private static final long elevation$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double elevation
     * }
     */
    public static final long elevation$offset() {
        return elevation$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double elevation
     * }
     */
    public static double elevation(MemorySegment struct) {
        return struct.get(elevation$LAYOUT, elevation$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double elevation
     * }
     */
    public static void elevation(MemorySegment struct, double fieldValue) {
        struct.set(elevation$LAYOUT, elevation$OFFSET, fieldValue);
    }

    private static final OfDouble focusElevation$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("focusElevation"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double focusElevation
     * }
     */
    public static final OfDouble focusElevation$layout() {
        return focusElevation$LAYOUT;
    }

    private static final long focusElevation$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double focusElevation
     * }
     */
    public static final long focusElevation$offset() {
        return focusElevation$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double focusElevation
     * }
     */
    public static double focusElevation(MemorySegment struct) {
        return struct.get(focusElevation$LAYOUT, focusElevation$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double focusElevation
     * }
     */
    public static void focusElevation(MemorySegment struct, double fieldValue) {
        struct.set(focusElevation$LAYOUT, focusElevation$OFFSET, fieldValue);
    }

    private static final OfDouble hoverElevation$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("hoverElevation"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double hoverElevation
     * }
     */
    public static final OfDouble hoverElevation$layout() {
        return hoverElevation$LAYOUT;
    }

    private static final long hoverElevation$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double hoverElevation
     * }
     */
    public static final long hoverElevation$offset() {
        return hoverElevation$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double hoverElevation
     * }
     */
    public static double hoverElevation(MemorySegment struct) {
        return struct.get(hoverElevation$LAYOUT, hoverElevation$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double hoverElevation
     * }
     */
    public static void hoverElevation(MemorySegment struct, double fieldValue) {
        struct.set(hoverElevation$LAYOUT, hoverElevation$OFFSET, fieldValue);
    }

    private static final OfDouble highlightElevation$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("highlightElevation"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double highlightElevation
     * }
     */
    public static final OfDouble highlightElevation$layout() {
        return highlightElevation$LAYOUT;
    }

    private static final long highlightElevation$OFFSET = 64;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double highlightElevation
     * }
     */
    public static final long highlightElevation$offset() {
        return highlightElevation$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double highlightElevation
     * }
     */
    public static double highlightElevation(MemorySegment struct) {
        return struct.get(highlightElevation$LAYOUT, highlightElevation$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double highlightElevation
     * }
     */
    public static void highlightElevation(MemorySegment struct, double fieldValue) {
        struct.set(highlightElevation$LAYOUT, highlightElevation$OFFSET, fieldValue);
    }

    private static final OfDouble disabledElevation$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("disabledElevation"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double disabledElevation
     * }
     */
    public static final OfDouble disabledElevation$layout() {
        return disabledElevation$LAYOUT;
    }

    private static final long disabledElevation$OFFSET = 72;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double disabledElevation
     * }
     */
    public static final long disabledElevation$offset() {
        return disabledElevation$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double disabledElevation
     * }
     */
    public static double disabledElevation(MemorySegment struct) {
        return struct.get(disabledElevation$LAYOUT, disabledElevation$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double disabledElevation
     * }
     */
    public static void disabledElevation(MemorySegment struct, double fieldValue) {
        struct.set(disabledElevation$LAYOUT, disabledElevation$OFFSET, fieldValue);
    }

    private static final OfInt mini$LAYOUT = (OfInt)$LAYOUT.select(groupElement("mini"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int mini
     * }
     */
    public static final OfInt mini$layout() {
        return mini$LAYOUT;
    }

    private static final long mini$OFFSET = 80;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int mini
     * }
     */
    public static final long mini$offset() {
        return mini$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int mini
     * }
     */
    public static int mini(MemorySegment struct) {
        return struct.get(mini$LAYOUT, mini$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int mini
     * }
     */
    public static void mini(MemorySegment struct, int fieldValue) {
        struct.set(mini$LAYOUT, mini$OFFSET, fieldValue);
    }

    private static final OfInt shape$LAYOUT = (OfInt)$LAYOUT.select(groupElement("shape"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj shape
     * }
     */
    public static final OfInt shape$layout() {
        return shape$LAYOUT;
    }

    private static final long shape$OFFSET = 84;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj shape
     * }
     */
    public static final long shape$offset() {
        return shape$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj shape
     * }
     */
    public static int shape(MemorySegment struct) {
        return struct.get(shape$LAYOUT, shape$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj shape
     * }
     */
    public static void shape(MemorySegment struct, int fieldValue) {
        struct.set(shape$LAYOUT, shape$OFFSET, fieldValue);
    }

    private static final OfInt clipBehavior$LAYOUT = (OfInt)$LAYOUT.select(groupElement("clipBehavior"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int clipBehavior
     * }
     */
    public static final OfInt clipBehavior$layout() {
        return clipBehavior$LAYOUT;
    }

    private static final long clipBehavior$OFFSET = 88;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int clipBehavior
     * }
     */
    public static final long clipBehavior$offset() {
        return clipBehavior$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int clipBehavior
     * }
     */
    public static int clipBehavior(MemorySegment struct) {
        return struct.get(clipBehavior$LAYOUT, clipBehavior$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int clipBehavior
     * }
     */
    public static void clipBehavior(MemorySegment struct, int fieldValue) {
        struct.set(clipBehavior$LAYOUT, clipBehavior$OFFSET, fieldValue);
    }

    private static final OfInt isExtended$LAYOUT = (OfInt)$LAYOUT.select(groupElement("isExtended"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int isExtended
     * }
     */
    public static final OfInt isExtended$layout() {
        return isExtended$LAYOUT;
    }

    private static final long isExtended$OFFSET = 92;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int isExtended
     * }
     */
    public static final long isExtended$offset() {
        return isExtended$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int isExtended
     * }
     */
    public static int isExtended(MemorySegment struct) {
        return struct.get(isExtended$LAYOUT, isExtended$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int isExtended
     * }
     */
    public static void isExtended(MemorySegment struct, int fieldValue) {
        struct.set(isExtended$LAYOUT, isExtended$OFFSET, fieldValue);
    }

    private static final OfInt autofocus$LAYOUT = (OfInt)$LAYOUT.select(groupElement("autofocus"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int autofocus
     * }
     */
    public static final OfInt autofocus$layout() {
        return autofocus$LAYOUT;
    }

    private static final long autofocus$OFFSET = 96;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int autofocus
     * }
     */
    public static final long autofocus$offset() {
        return autofocus$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int autofocus
     * }
     */
    public static int autofocus(MemorySegment struct) {
        return struct.get(autofocus$LAYOUT, autofocus$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int autofocus
     * }
     */
    public static void autofocus(MemorySegment struct, int fieldValue) {
        struct.set(autofocus$LAYOUT, autofocus$OFFSET, fieldValue);
    }

    private static final OfInt materialTapTargetSize$LAYOUT = (OfInt)$LAYOUT.select(groupElement("materialTapTargetSize"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int materialTapTargetSize
     * }
     */
    public static final OfInt materialTapTargetSize$layout() {
        return materialTapTargetSize$LAYOUT;
    }

    private static final long materialTapTargetSize$OFFSET = 100;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int materialTapTargetSize
     * }
     */
    public static final long materialTapTargetSize$offset() {
        return materialTapTargetSize$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int materialTapTargetSize
     * }
     */
    public static int materialTapTargetSize(MemorySegment struct) {
        return struct.get(materialTapTargetSize$LAYOUT, materialTapTargetSize$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int materialTapTargetSize
     * }
     */
    public static void materialTapTargetSize(MemorySegment struct, int fieldValue) {
        struct.set(materialTapTargetSize$LAYOUT, materialTapTargetSize$OFFSET, fieldValue);
    }

    private static final OfInt enableFeedback$LAYOUT = (OfInt)$LAYOUT.select(groupElement("enableFeedback"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int enableFeedback
     * }
     */
    public static final OfInt enableFeedback$layout() {
        return enableFeedback$LAYOUT;
    }

    private static final long enableFeedback$OFFSET = 104;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int enableFeedback
     * }
     */
    public static final long enableFeedback$offset() {
        return enableFeedback$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int enableFeedback
     * }
     */
    public static int enableFeedback(MemorySegment struct) {
        return struct.get(enableFeedback$LAYOUT, enableFeedback$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int enableFeedback
     * }
     */
    public static void enableFeedback(MemorySegment struct, int fieldValue) {
        struct.set(enableFeedback$LAYOUT, enableFeedback$OFFSET, fieldValue);
    }

    private static final OfDouble extendedIconLabelSpacing$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("extendedIconLabelSpacing"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double extendedIconLabelSpacing
     * }
     */
    public static final OfDouble extendedIconLabelSpacing$layout() {
        return extendedIconLabelSpacing$LAYOUT;
    }

    private static final long extendedIconLabelSpacing$OFFSET = 112;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double extendedIconLabelSpacing
     * }
     */
    public static final long extendedIconLabelSpacing$offset() {
        return extendedIconLabelSpacing$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double extendedIconLabelSpacing
     * }
     */
    public static double extendedIconLabelSpacing(MemorySegment struct) {
        return struct.get(extendedIconLabelSpacing$LAYOUT, extendedIconLabelSpacing$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double extendedIconLabelSpacing
     * }
     */
    public static void extendedIconLabelSpacing(MemorySegment struct, double fieldValue) {
        struct.set(extendedIconLabelSpacing$LAYOUT, extendedIconLabelSpacing$OFFSET, fieldValue);
    }

    private static final OfInt extendedPadding$LAYOUT = (OfInt)$LAYOUT.select(groupElement("extendedPadding"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj extendedPadding
     * }
     */
    public static final OfInt extendedPadding$layout() {
        return extendedPadding$LAYOUT;
    }

    private static final long extendedPadding$OFFSET = 120;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj extendedPadding
     * }
     */
    public static final long extendedPadding$offset() {
        return extendedPadding$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj extendedPadding
     * }
     */
    public static int extendedPadding(MemorySegment struct) {
        return struct.get(extendedPadding$LAYOUT, extendedPadding$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj extendedPadding
     * }
     */
    public static void extendedPadding(MemorySegment struct, int fieldValue) {
        struct.set(extendedPadding$LAYOUT, extendedPadding$OFFSET, fieldValue);
    }

    private static final GroupLayout extendedTextStyle$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("extendedTextStyle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * TextStyleObjSt extendedTextStyle
     * }
     */
    public static final GroupLayout extendedTextStyle$layout() {
        return extendedTextStyle$LAYOUT;
    }

    private static final long extendedTextStyle$OFFSET = 128;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * TextStyleObjSt extendedTextStyle
     * }
     */
    public static final long extendedTextStyle$offset() {
        return extendedTextStyle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * TextStyleObjSt extendedTextStyle
     * }
     */
    public static MemorySegment extendedTextStyle(MemorySegment struct) {
        return struct.asSlice(extendedTextStyle$OFFSET, extendedTextStyle$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * TextStyleObjSt extendedTextStyle
     * }
     */
    public static void extendedTextStyle(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, extendedTextStyle$OFFSET, extendedTextStyle$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

