// Generated by jextract

package dev.equo.ewt.ffm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     int id;
 *     IconDataObjSt icon;
 *     double size;
 *     double fill;
 *     double weight;
 *     double grade;
 *     double opticalSize;
 *     DartObj color;
 *     int textDirection;
 *     int applyTextScaling;
 *     int blendMode;
 * }
 * }
 */
public class IconObjSt {

    IconObjSt() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        StarterBridge.C_INT.withName("id"),
        IconDataObjSt.layout().withName("icon"),
        StarterBridge.C_DOUBLE.withName("size"),
        StarterBridge.C_DOUBLE.withName("fill"),
        StarterBridge.C_DOUBLE.withName("weight"),
        StarterBridge.C_DOUBLE.withName("grade"),
        StarterBridge.C_DOUBLE.withName("opticalSize"),
        StarterBridge.C_INT.withName("color"),
        StarterBridge.C_INT.withName("textDirection"),
        StarterBridge.C_INT.withName("applyTextScaling"),
        StarterBridge.C_INT.withName("blendMode")
    ).withName("$anon$66:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt id$LAYOUT = (OfInt)$LAYOUT.select(groupElement("id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final OfInt id$layout() {
        return id$LAYOUT;
    }

    private static final long id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final long id$offset() {
        return id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static int id(MemorySegment struct) {
        return struct.get(id$LAYOUT, id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static void id(MemorySegment struct, int fieldValue) {
        struct.set(id$LAYOUT, id$OFFSET, fieldValue);
    }

    private static final GroupLayout icon$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("icon"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * IconDataObjSt icon
     * }
     */
    public static final GroupLayout icon$layout() {
        return icon$LAYOUT;
    }

    private static final long icon$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * IconDataObjSt icon
     * }
     */
    public static final long icon$offset() {
        return icon$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * IconDataObjSt icon
     * }
     */
    public static MemorySegment icon(MemorySegment struct) {
        return struct.asSlice(icon$OFFSET, icon$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * IconDataObjSt icon
     * }
     */
    public static void icon(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, icon$OFFSET, icon$LAYOUT.byteSize());
    }

    private static final OfDouble size$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double size
     * }
     */
    public static final OfDouble size$layout() {
        return size$LAYOUT;
    }

    private static final long size$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double size
     * }
     */
    public static final long size$offset() {
        return size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double size
     * }
     */
    public static double size(MemorySegment struct) {
        return struct.get(size$LAYOUT, size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double size
     * }
     */
    public static void size(MemorySegment struct, double fieldValue) {
        struct.set(size$LAYOUT, size$OFFSET, fieldValue);
    }

    private static final OfDouble fill$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("fill"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double fill
     * }
     */
    public static final OfDouble fill$layout() {
        return fill$LAYOUT;
    }

    private static final long fill$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double fill
     * }
     */
    public static final long fill$offset() {
        return fill$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double fill
     * }
     */
    public static double fill(MemorySegment struct) {
        return struct.get(fill$LAYOUT, fill$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double fill
     * }
     */
    public static void fill(MemorySegment struct, double fieldValue) {
        struct.set(fill$LAYOUT, fill$OFFSET, fieldValue);
    }

    private static final OfDouble weight$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("weight"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double weight
     * }
     */
    public static final OfDouble weight$layout() {
        return weight$LAYOUT;
    }

    private static final long weight$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double weight
     * }
     */
    public static final long weight$offset() {
        return weight$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double weight
     * }
     */
    public static double weight(MemorySegment struct) {
        return struct.get(weight$LAYOUT, weight$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double weight
     * }
     */
    public static void weight(MemorySegment struct, double fieldValue) {
        struct.set(weight$LAYOUT, weight$OFFSET, fieldValue);
    }

    private static final OfDouble grade$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("grade"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double grade
     * }
     */
    public static final OfDouble grade$layout() {
        return grade$LAYOUT;
    }

    private static final long grade$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double grade
     * }
     */
    public static final long grade$offset() {
        return grade$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double grade
     * }
     */
    public static double grade(MemorySegment struct) {
        return struct.get(grade$LAYOUT, grade$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double grade
     * }
     */
    public static void grade(MemorySegment struct, double fieldValue) {
        struct.set(grade$LAYOUT, grade$OFFSET, fieldValue);
    }

    private static final OfDouble opticalSize$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("opticalSize"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double opticalSize
     * }
     */
    public static final OfDouble opticalSize$layout() {
        return opticalSize$LAYOUT;
    }

    private static final long opticalSize$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double opticalSize
     * }
     */
    public static final long opticalSize$offset() {
        return opticalSize$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double opticalSize
     * }
     */
    public static double opticalSize(MemorySegment struct) {
        return struct.get(opticalSize$LAYOUT, opticalSize$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double opticalSize
     * }
     */
    public static void opticalSize(MemorySegment struct, double fieldValue) {
        struct.set(opticalSize$LAYOUT, opticalSize$OFFSET, fieldValue);
    }

    private static final OfInt color$LAYOUT = (OfInt)$LAYOUT.select(groupElement("color"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj color
     * }
     */
    public static final OfInt color$layout() {
        return color$LAYOUT;
    }

    private static final long color$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj color
     * }
     */
    public static final long color$offset() {
        return color$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj color
     * }
     */
    public static int color(MemorySegment struct) {
        return struct.get(color$LAYOUT, color$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj color
     * }
     */
    public static void color(MemorySegment struct, int fieldValue) {
        struct.set(color$LAYOUT, color$OFFSET, fieldValue);
    }

    private static final OfInt textDirection$LAYOUT = (OfInt)$LAYOUT.select(groupElement("textDirection"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int textDirection
     * }
     */
    public static final OfInt textDirection$layout() {
        return textDirection$LAYOUT;
    }

    private static final long textDirection$OFFSET = 60;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int textDirection
     * }
     */
    public static final long textDirection$offset() {
        return textDirection$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int textDirection
     * }
     */
    public static int textDirection(MemorySegment struct) {
        return struct.get(textDirection$LAYOUT, textDirection$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int textDirection
     * }
     */
    public static void textDirection(MemorySegment struct, int fieldValue) {
        struct.set(textDirection$LAYOUT, textDirection$OFFSET, fieldValue);
    }

    private static final OfInt applyTextScaling$LAYOUT = (OfInt)$LAYOUT.select(groupElement("applyTextScaling"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int applyTextScaling
     * }
     */
    public static final OfInt applyTextScaling$layout() {
        return applyTextScaling$LAYOUT;
    }

    private static final long applyTextScaling$OFFSET = 64;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int applyTextScaling
     * }
     */
    public static final long applyTextScaling$offset() {
        return applyTextScaling$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int applyTextScaling
     * }
     */
    public static int applyTextScaling(MemorySegment struct) {
        return struct.get(applyTextScaling$LAYOUT, applyTextScaling$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int applyTextScaling
     * }
     */
    public static void applyTextScaling(MemorySegment struct, int fieldValue) {
        struct.set(applyTextScaling$LAYOUT, applyTextScaling$OFFSET, fieldValue);
    }

    private static final OfInt blendMode$LAYOUT = (OfInt)$LAYOUT.select(groupElement("blendMode"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int blendMode
     * }
     */
    public static final OfInt blendMode$layout() {
        return blendMode$LAYOUT;
    }

    private static final long blendMode$OFFSET = 68;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int blendMode
     * }
     */
    public static final long blendMode$offset() {
        return blendMode$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int blendMode
     * }
     */
    public static int blendMode(MemorySegment struct) {
        return struct.get(blendMode$LAYOUT, blendMode$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int blendMode
     * }
     */
    public static void blendMode(MemorySegment struct, int fieldValue) {
        struct.set(blendMode$LAYOUT, blendMode$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

