// Generated by jextract

package dev.equo.ewt.ffm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     int id;
 *     int codePoint;
 *     char *fontFamily;
 *     char *fontPackage;
 *     int matchTextDirection;
 * }
 * }
 */
public class IconDataObjSt {

    IconDataObjSt() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        StarterBridge.C_INT.withName("id"),
        StarterBridge.C_INT.withName("codePoint"),
        StarterBridge.C_POINTER.withName("fontFamily"),
        StarterBridge.C_POINTER.withName("fontPackage"),
        StarterBridge.C_INT.withName("matchTextDirection"),
        MemoryLayout.paddingLayout(4)
    ).withName("$anon$93:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt id$LAYOUT = (OfInt)$LAYOUT.select(groupElement("id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final OfInt id$layout() {
        return id$LAYOUT;
    }

    private static final long id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final long id$offset() {
        return id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static int id(MemorySegment struct) {
        return struct.get(id$LAYOUT, id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static void id(MemorySegment struct, int fieldValue) {
        struct.set(id$LAYOUT, id$OFFSET, fieldValue);
    }

    private static final OfInt codePoint$LAYOUT = (OfInt)$LAYOUT.select(groupElement("codePoint"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int codePoint
     * }
     */
    public static final OfInt codePoint$layout() {
        return codePoint$LAYOUT;
    }

    private static final long codePoint$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int codePoint
     * }
     */
    public static final long codePoint$offset() {
        return codePoint$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int codePoint
     * }
     */
    public static int codePoint(MemorySegment struct) {
        return struct.get(codePoint$LAYOUT, codePoint$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int codePoint
     * }
     */
    public static void codePoint(MemorySegment struct, int fieldValue) {
        struct.set(codePoint$LAYOUT, codePoint$OFFSET, fieldValue);
    }

    private static final AddressLayout fontFamily$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("fontFamily"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char *fontFamily
     * }
     */
    public static final AddressLayout fontFamily$layout() {
        return fontFamily$LAYOUT;
    }

    private static final long fontFamily$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char *fontFamily
     * }
     */
    public static final long fontFamily$offset() {
        return fontFamily$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char *fontFamily
     * }
     */
    public static MemorySegment fontFamily(MemorySegment struct) {
        return struct.get(fontFamily$LAYOUT, fontFamily$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char *fontFamily
     * }
     */
    public static void fontFamily(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(fontFamily$LAYOUT, fontFamily$OFFSET, fieldValue);
    }

    private static final AddressLayout fontPackage$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("fontPackage"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char *fontPackage
     * }
     */
    public static final AddressLayout fontPackage$layout() {
        return fontPackage$LAYOUT;
    }

    private static final long fontPackage$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char *fontPackage
     * }
     */
    public static final long fontPackage$offset() {
        return fontPackage$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char *fontPackage
     * }
     */
    public static MemorySegment fontPackage(MemorySegment struct) {
        return struct.get(fontPackage$LAYOUT, fontPackage$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char *fontPackage
     * }
     */
    public static void fontPackage(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(fontPackage$LAYOUT, fontPackage$OFFSET, fieldValue);
    }

    private static final OfInt matchTextDirection$LAYOUT = (OfInt)$LAYOUT.select(groupElement("matchTextDirection"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int matchTextDirection
     * }
     */
    public static final OfInt matchTextDirection$layout() {
        return matchTextDirection$LAYOUT;
    }

    private static final long matchTextDirection$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int matchTextDirection
     * }
     */
    public static final long matchTextDirection$offset() {
        return matchTextDirection$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int matchTextDirection
     * }
     */
    public static int matchTextDirection(MemorySegment struct) {
        return struct.get(matchTextDirection$LAYOUT, matchTextDirection$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int matchTextDirection
     * }
     */
    public static void matchTextDirection(MemorySegment struct, int fieldValue) {
        struct.set(matchTextDirection$LAYOUT, matchTextDirection$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

