// Generated by jextract

package dev.equo.ewt.ffm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     int id;
 *     DartObj icon;
 *     DartObj iconColor;
 *     DartObj label;
 *     char *labelText;
 *     TextStyleObjSt labelStyle;
 *     TextStyleObjSt floatingLabelStyle;
 *     DartObj helper;
 *     char *helperText;
 *     TextStyleObjSt helperStyle;
 *     int helperMaxLines;
 *     char *hintText;
 *     DartObj hint;
 *     TextStyleObjSt hintStyle;
 *     int hintTextDirection;
 *     int hintMaxLines;
 *     DartObj hintFadeDuration;
 *     int maintainHintHeight;
 *     int maintainHintSize;
 *     int maintainLabelSize;
 *     DartObj error;
 *     char *errorText;
 *     TextStyleObjSt errorStyle;
 *     int errorMaxLines;
 *     int floatingLabelBehavior;
 *     int isDense;
 *     DartObj contentPadding;
 *     int isCollapsed;
 *     DartObj prefixIcon;
 *     BoxConstraintsObjSt prefixIconConstraints;
 *     DartObj prefix;
 *     char *prefixText;
 *     TextStyleObjSt prefixStyle;
 *     DartObj prefixIconColor;
 *     DartObj suffixIcon;
 *     DartObj suffix;
 *     char *suffixText;
 *     TextStyleObjSt suffixStyle;
 *     DartObj suffixIconColor;
 *     BoxConstraintsObjSt suffixIconConstraints;
 *     char *counterText;
 *     DartObj counter;
 *     TextStyleObjSt counterStyle;
 *     int filled;
 *     DartObj fillColor;
 *     DartObj focusColor;
 *     DartObj hoverColor;
 *     DartObj errorBorder;
 *     DartObj focusedBorder;
 *     DartObj focusedErrorBorder;
 *     DartObj disabledBorder;
 *     DartObj enabledBorder;
 *     DartObj border;
 *     int enabled;
 *     char *semanticCounterText;
 *     int alignLabelWithHint;
 *     BoxConstraintsObjSt constraints;
 *     VisualDensityObjSt visualDensity;
 * }
 * }
 */
public class InputDecorationObjSt {

    InputDecorationObjSt() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        StarterBridge.C_INT.withName("id"),
        StarterBridge.C_INT.withName("icon"),
        StarterBridge.C_INT.withName("iconColor"),
        StarterBridge.C_INT.withName("label"),
        StarterBridge.C_POINTER.withName("labelText"),
        TextStyleObjSt.layout().withName("labelStyle"),
        TextStyleObjSt.layout().withName("floatingLabelStyle"),
        StarterBridge.C_INT.withName("helper"),
        MemoryLayout.paddingLayout(4),
        StarterBridge.C_POINTER.withName("helperText"),
        TextStyleObjSt.layout().withName("helperStyle"),
        StarterBridge.C_INT.withName("helperMaxLines"),
        MemoryLayout.paddingLayout(4),
        StarterBridge.C_POINTER.withName("hintText"),
        StarterBridge.C_INT.withName("hint"),
        MemoryLayout.paddingLayout(4),
        TextStyleObjSt.layout().withName("hintStyle"),
        StarterBridge.C_INT.withName("hintTextDirection"),
        StarterBridge.C_INT.withName("hintMaxLines"),
        StarterBridge.C_INT.withName("hintFadeDuration"),
        StarterBridge.C_INT.withName("maintainHintHeight"),
        StarterBridge.C_INT.withName("maintainHintSize"),
        StarterBridge.C_INT.withName("maintainLabelSize"),
        StarterBridge.C_INT.withName("error"),
        MemoryLayout.paddingLayout(4),
        StarterBridge.C_POINTER.withName("errorText"),
        TextStyleObjSt.layout().withName("errorStyle"),
        StarterBridge.C_INT.withName("errorMaxLines"),
        StarterBridge.C_INT.withName("floatingLabelBehavior"),
        StarterBridge.C_INT.withName("isDense"),
        StarterBridge.C_INT.withName("contentPadding"),
        StarterBridge.C_INT.withName("isCollapsed"),
        StarterBridge.C_INT.withName("prefixIcon"),
        BoxConstraintsObjSt.layout().withName("prefixIconConstraints"),
        StarterBridge.C_INT.withName("prefix"),
        MemoryLayout.paddingLayout(4),
        StarterBridge.C_POINTER.withName("prefixText"),
        TextStyleObjSt.layout().withName("prefixStyle"),
        StarterBridge.C_INT.withName("prefixIconColor"),
        StarterBridge.C_INT.withName("suffixIcon"),
        StarterBridge.C_INT.withName("suffix"),
        MemoryLayout.paddingLayout(4),
        StarterBridge.C_POINTER.withName("suffixText"),
        TextStyleObjSt.layout().withName("suffixStyle"),
        StarterBridge.C_INT.withName("suffixIconColor"),
        MemoryLayout.paddingLayout(4),
        BoxConstraintsObjSt.layout().withName("suffixIconConstraints"),
        StarterBridge.C_POINTER.withName("counterText"),
        StarterBridge.C_INT.withName("counter"),
        MemoryLayout.paddingLayout(4),
        TextStyleObjSt.layout().withName("counterStyle"),
        StarterBridge.C_INT.withName("filled"),
        StarterBridge.C_INT.withName("fillColor"),
        StarterBridge.C_INT.withName("focusColor"),
        StarterBridge.C_INT.withName("hoverColor"),
        StarterBridge.C_INT.withName("errorBorder"),
        StarterBridge.C_INT.withName("focusedBorder"),
        StarterBridge.C_INT.withName("focusedErrorBorder"),
        StarterBridge.C_INT.withName("disabledBorder"),
        StarterBridge.C_INT.withName("enabledBorder"),
        StarterBridge.C_INT.withName("border"),
        StarterBridge.C_INT.withName("enabled"),
        MemoryLayout.paddingLayout(4),
        StarterBridge.C_POINTER.withName("semanticCounterText"),
        StarterBridge.C_INT.withName("alignLabelWithHint"),
        MemoryLayout.paddingLayout(4),
        BoxConstraintsObjSt.layout().withName("constraints"),
        VisualDensityObjSt.layout().withName("visualDensity")
    ).withName("$anon$670:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt id$LAYOUT = (OfInt)$LAYOUT.select(groupElement("id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final OfInt id$layout() {
        return id$LAYOUT;
    }

    private static final long id$OFFSET = $LAYOUT.byteOffset(groupElement("id"));

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final long id$offset() {
        return id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static int id(MemorySegment struct) {
