// Generated by jextract

package dev.equo.ewt.ffm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     int id;
 *     DartObj home;
 *     char *initialRoute;
 *     char *title;
 *     ThemeDataObjSt theme;
 *     ThemeDataObjSt darkTheme;
 *     ThemeDataObjSt highContrastTheme;
 *     ThemeDataObjSt highContrastDarkTheme;
 *     int themeMode;
 *     DartObj themeAnimationCurve;
 *     DartObj color;
 *     int showPerformanceOverlay;
 *     int checkerboardRasterCacheImages;
 *     int checkerboardOffscreenLayers;
 *     int showSemanticsDebugger;
 *     int debugShowCheckedModeBanner;
 *     char *restorationScopeId;
 *     int debugShowMaterialGrid;
 *     int useInheritedMediaQuery;
 * }
 * }
 */
public class MaterialAppObjSt {

    MaterialAppObjSt() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        StarterBridge.C_INT.withName("id"),
        StarterBridge.C_INT.withName("home"),
        StarterBridge.C_POINTER.withName("initialRoute"),
        StarterBridge.C_POINTER.withName("title"),
        ThemeDataObjSt.layout().withName("theme"),
        ThemeDataObjSt.layout().withName("darkTheme"),
        ThemeDataObjSt.layout().withName("highContrastTheme"),
        ThemeDataObjSt.layout().withName("highContrastDarkTheme"),
        StarterBridge.C_INT.withName("themeMode"),
        StarterBridge.C_INT.withName("themeAnimationCurve"),
        StarterBridge.C_INT.withName("color"),
        StarterBridge.C_INT.withName("showPerformanceOverlay"),
        StarterBridge.C_INT.withName("checkerboardRasterCacheImages"),
        StarterBridge.C_INT.withName("checkerboardOffscreenLayers"),
        StarterBridge.C_INT.withName("showSemanticsDebugger"),
        StarterBridge.C_INT.withName("debugShowCheckedModeBanner"),
        StarterBridge.C_POINTER.withName("restorationScopeId"),
        StarterBridge.C_INT.withName("debugShowMaterialGrid"),
        StarterBridge.C_INT.withName("useInheritedMediaQuery")
    ).withName("$anon$447:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt id$LAYOUT = (OfInt)$LAYOUT.select(groupElement("id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final OfInt id$layout() {
        return id$LAYOUT;
    }

    private static final long id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final long id$offset() {
        return id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static int id(MemorySegment struct) {
        return struct.get(id$LAYOUT, id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static void id(MemorySegment struct, int fieldValue) {
        struct.set(id$LAYOUT, id$OFFSET, fieldValue);
    }

    private static final OfInt home$LAYOUT = (OfInt)$LAYOUT.select(groupElement("home"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj home
     * }
     */
    public static final OfInt home$layout() {
        return home$LAYOUT;
    }

    private static final long home$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj home
     * }
     */
    public static final long home$offset() {
        return home$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj home
     * }
     */
    public static int home(MemorySegment struct) {
        return struct.get(home$LAYOUT, home$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj home
     * }
     */
    public static void home(MemorySegment struct, int fieldValue) {
        struct.set(home$LAYOUT, home$OFFSET, fieldValue);
    }

    private static final AddressLayout initialRoute$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("initialRoute"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char *initialRoute
     * }
     */
    public static final AddressLayout initialRoute$layout() {
        return initialRoute$LAYOUT;
    }

    private static final long initialRoute$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char *initialRoute
     * }
     */
    public static final long initialRoute$offset() {
        return initialRoute$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char *initialRoute
     * }
     */
    public static MemorySegment initialRoute(MemorySegment struct) {
        return struct.get(initialRoute$LAYOUT, initialRoute$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char *initialRoute
     * }
     */
    public static void initialRoute(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(initialRoute$LAYOUT, initialRoute$OFFSET, fieldValue);
    }

    private static final AddressLayout title$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("title"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char *title
     * }
     */
    public static final AddressLayout title$layout() {
        return title$LAYOUT;
    }

    private static final long title$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char *title
     * }
     */
    public static final long title$offset() {
        return title$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char *title
     * }
     */
    public static MemorySegment title(MemorySegment struct) {
        return struct.get(title$LAYOUT, title$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char *title
     * }
     */
    public static void title(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(title$LAYOUT, title$OFFSET, fieldValue);
    }

    private static final GroupLayout theme$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("theme"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ThemeDataObjSt theme
     * }
     */
    public static final GroupLayout theme$layout() {
        return theme$LAYOUT;
    }

    private static final long theme$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ThemeDataObjSt theme
     * }
     */
    public static final long theme$offset() {
        return theme$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ThemeDataObjSt theme
     * }
     */
    public static MemorySegment theme(MemorySegment struct) {
        return struct.asSlice(theme$OFFSET, theme$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ThemeDataObjSt theme
     * }
     */
    public static void theme(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, theme$OFFSET, theme$LAYOUT.byteSize());
    }

    private static final GroupLayout darkTheme$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("darkTheme"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ThemeDataObjSt darkTheme
     * }
     */
    public static final GroupLayout darkTheme$layout() {
        return darkTheme$LAYOUT;
    }

    private static final long darkTheme$OFFSET = 3704;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ThemeDataObjSt darkTheme
     * }
     */
    public static final long darkTheme$offset() {
        return darkTheme$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ThemeDataObjSt darkTheme
     * }
     */
    public static MemorySegment darkTheme(MemorySegment struct) {
        return struct.asSlice(darkTheme$OFFSET, darkTheme$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ThemeDataObjSt darkTheme
     * }
     */
    public static void darkTheme(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, darkTheme$OFFSET, darkTheme$LAYOUT.byteSize());
    }

    private static final GroupLayout highContrastTheme$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("highContrastTheme"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ThemeDataObjSt highContrastTheme
     * }
     */
    public static final GroupLayout highContrastTheme$layout() {
        return highContrastTheme$LAYOUT;
    }

    private static final long highContrastTheme$OFFSET = 7384;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ThemeDataObjSt highContrastTheme
     * }
     */
    public static final long highContrastTheme$offset() {
        return highContrastTheme$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ThemeDataObjSt highContrastTheme
     * }
     */
    public static MemorySegment highContrastTheme(MemorySegment struct) {
        return struct.asSlice(highContrastTheme$OFFSET, highContrastTheme$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ThemeDataObjSt highContrastTheme
     * }
     */
    public static void highContrastTheme(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, highContrastTheme$OFFSET, highContrastTheme$LAYOUT.byteSize());
    }

    private static final GroupLayout highContrastDarkTheme$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("highContrastDarkTheme"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ThemeDataObjSt highContrastDarkTheme
     * }
     */
    public static final GroupLayout highContrastDarkTheme$layout() {
        return highContrastDarkTheme$LAYOUT;
    }

    private static final long highContrastDarkTheme$OFFSET = 11064;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ThemeDataObjSt highContrastDarkTheme
     * }
     */
    public static final long highContrastDarkTheme$offset() {
        return highContrastDarkTheme$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ThemeDataObjSt highContrastDarkTheme
     * }
     */
    public static MemorySegment highContrastDarkTheme(MemorySegment struct) {
        return struct.asSlice(highContrastDarkTheme$OFFSET, highContrastDarkTheme$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ThemeDataObjSt highContrastDarkTheme
     * }
     */
    public static void highContrastDarkTheme(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, highContrastDarkTheme$OFFSET, highContrastDarkTheme$LAYOUT.byteSize());
    }

    private static final OfInt themeMode$LAYOUT = (OfInt)$LAYOUT.select(groupElement("themeMode"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int themeMode
     * }
     */
    public static final OfInt themeMode$layout() {
        return themeMode$LAYOUT;
    }

    private static final long themeMode$OFFSET = 14744;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int themeMode
     * }
     */
    public static final long themeMode$offset() {
        return themeMode$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int themeMode
     * }
     */
    public static int themeMode(MemorySegment struct) {
        return struct.get(themeMode$LAYOUT, themeMode$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int themeMode
     * }
     */
    public static void themeMode(MemorySegment struct, int fieldValue) {
        struct.set(themeMode$LAYOUT, themeMode$OFFSET, fieldValue);
    }

    private static final OfInt themeAnimationCurve$LAYOUT = (OfInt)$LAYOUT.select(groupElement("themeAnimationCurve"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj themeAnimationCurve
     * }
     */
    public static final OfInt themeAnimationCurve$layout() {
        return themeAnimationCurve$LAYOUT;
    }

    private static final long themeAnimationCurve$OFFSET = 14748;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj themeAnimationCurve
     * }
     */
    public static final long themeAnimationCurve$offset() {
        return themeAnimationCurve$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj themeAnimationCurve
     * }
     */
    public static int themeAnimationCurve(MemorySegment struct) {
        return struct.get(themeAnimationCurve$LAYOUT, themeAnimationCurve$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj themeAnimationCurve
     * }
     */
    public static void themeAnimationCurve(MemorySegment struct, int fieldValue) {
        struct.set(themeAnimationCurve$LAYOUT, themeAnimationCurve$OFFSET, fieldValue);
    }

    private static final OfInt color$LAYOUT = (OfInt)$LAYOUT.select(groupElement("color"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj color
     * }
     */
    public static final OfInt color$layout() {
        return color$LAYOUT;
    }

    private static final long color$OFFSET = 14752;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj color
     * }
     */
    public static final long color$offset() {
        return color$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj color
     * }
     */
    public static int color(MemorySegment struct) {
        return struct.get(color$LAYOUT, color$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj color
     * }
     */
    public static void color(MemorySegment struct, int fieldValue) {
        struct.set(color$LAYOUT, color$OFFSET, fieldValue);
    }

    private static final OfInt showPerformanceOverlay$LAYOUT = (OfInt)$LAYOUT.select(groupElement("showPerformanceOverlay"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int showPerformanceOverlay
     * }
     */
    public static final OfInt showPerformanceOverlay$layout() {
        return showPerformanceOverlay$LAYOUT;
    }

    private static final long showPerformanceOverlay$OFFSET = 14756;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int showPerformanceOverlay
     * }
     */
    public static final long showPerformanceOverlay$offset() {
        return showPerformanceOverlay$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int showPerformanceOverlay
     * }
     */
    public static int showPerformanceOverlay(MemorySegment struct) {
        return struct.get(showPerformanceOverlay$LAYOUT, showPerformanceOverlay$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int showPerformanceOverlay
     * }
     */
    public static void showPerformanceOverlay(MemorySegment struct, int fieldValue) {
        struct.set(showPerformanceOverlay$LAYOUT, showPerformanceOverlay$OFFSET, fieldValue);
    }

    private static final OfInt checkerboardRasterCacheImages$LAYOUT = (OfInt)$LAYOUT.select(groupElement("checkerboardRasterCacheImages"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int checkerboardRasterCacheImages
     * }
     */
    public static final OfInt checkerboardRasterCacheImages$layout() {
        return checkerboardRasterCacheImages$LAYOUT;
    }

    private static final long checkerboardRasterCacheImages$OFFSET = 14760;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int checkerboardRasterCacheImages
     * }
     */
    public static final long checkerboardRasterCacheImages$offset() {
        return checkerboardRasterCacheImages$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int checkerboardRasterCacheImages
     * }
     */
    public static int checkerboardRasterCacheImages(MemorySegment struct) {
        return struct.get(checkerboardRasterCacheImages$LAYOUT, checkerboardRasterCacheImages$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int checkerboardRasterCacheImages
     * }
     */
    public static void checkerboardRasterCacheImages(MemorySegment struct, int fieldValue) {
        struct.set(checkerboardRasterCacheImages$LAYOUT, checkerboardRasterCacheImages$OFFSET, fieldValue);
    }

    private static final OfInt checkerboardOffscreenLayers$LAYOUT = (OfInt)$LAYOUT.select(groupElement("checkerboardOffscreenLayers"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int checkerboardOffscreenLayers
     * }
     */
    public static final OfInt checkerboardOffscreenLayers$layout() {
        return checkerboardOffscreenLayers$LAYOUT;
    }

    private static final long checkerboardOffscreenLayers$OFFSET = 14764;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int checkerboardOffscreenLayers
     * }
     */
    public static final long checkerboardOffscreenLayers$offset() {
        return checkerboardOffscreenLayers$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int checkerboardOffscreenLayers
     * }
     */
    public static int checkerboardOffscreenLayers(MemorySegment struct) {
        return struct.get(checkerboardOffscreenLayers$LAYOUT, checkerboardOffscreenLayers$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int checkerboardOffscreenLayers
     * }
     */
    public static void checkerboardOffscreenLayers(MemorySegment struct, int fieldValue) {
        struct.set(checkerboardOffscreenLayers$LAYOUT, checkerboardOffscreenLayers$OFFSET, fieldValue);
    }

    private static final OfInt showSemanticsDebugger$LAYOUT = (OfInt)$LAYOUT.select(groupElement("showSemanticsDebugger"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int showSemanticsDebugger
     * }
     */
    public static final OfInt showSemanticsDebugger$layout() {
        return showSemanticsDebugger$LAYOUT;
    }

    private static final long showSemanticsDebugger$OFFSET = 14768;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int showSemanticsDebugger
     * }
     */
    public static final long showSemanticsDebugger$offset() {
        return showSemanticsDebugger$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int showSemanticsDebugger
     * }
     */
    public static int showSemanticsDebugger(MemorySegment struct) {
        return struct.get(showSemanticsDebugger$LAYOUT, showSemanticsDebugger$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int showSemanticsDebugger
     * }
     */
    public static void showSemanticsDebugger(MemorySegment struct, int fieldValue) {
        struct.set(showSemanticsDebugger$LAYOUT, showSemanticsDebugger$OFFSET, fieldValue);
    }

    private static final OfInt debugShowCheckedModeBanner$LAYOUT = (OfInt)$LAYOUT.select(groupElement("debugShowCheckedModeBanner"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int debugShowCheckedModeBanner
     * }
     */
    public static final OfInt debugShowCheckedModeBanner$layout() {
        return debugShowCheckedModeBanner$LAYOUT;
    }

    private static final long debugShowCheckedModeBanner$OFFSET = 14772;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int debugShowCheckedModeBanner
     * }
     */
    public static final long debugShowCheckedModeBanner$offset() {
        return debugShowCheckedModeBanner$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int debugShowCheckedModeBanner
     * }
     */
    public static int debugShowCheckedModeBanner(MemorySegment struct) {
        return struct.get(debugShowCheckedModeBanner$LAYOUT, debugShowCheckedModeBanner$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int debugShowCheckedModeBanner
     * }
     */
    public static void debugShowCheckedModeBanner(MemorySegment struct, int fieldValue) {
        struct.set(debugShowCheckedModeBanner$LAYOUT, debugShowCheckedModeBanner$OFFSET, fieldValue);
    }

    private static final AddressLayout restorationScopeId$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("restorationScopeId"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char *restorationScopeId
     * }
     */
    public static final AddressLayout restorationScopeId$layout() {
        return restorationScopeId$LAYOUT;
    }

    private static final long restorationScopeId$OFFSET = 14776;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char *restorationScopeId
     * }
     */
    public static final long restorationScopeId$offset() {
        return restorationScopeId$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char *restorationScopeId
     * }
     */
    public static MemorySegment restorationScopeId(MemorySegment struct) {
        return struct.get(restorationScopeId$LAYOUT, restorationScopeId$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char *restorationScopeId
     * }
     */
    public static void restorationScopeId(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(restorationScopeId$LAYOUT, restorationScopeId$OFFSET, fieldValue);
    }

    private static final OfInt debugShowMaterialGrid$LAYOUT = (OfInt)$LAYOUT.select(groupElement("debugShowMaterialGrid"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int debugShowMaterialGrid
     * }
     */
    public static final OfInt debugShowMaterialGrid$layout() {
        return debugShowMaterialGrid$LAYOUT;
    }

    private static final long debugShowMaterialGrid$OFFSET = 14784;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int debugShowMaterialGrid
     * }
     */
    public static final long debugShowMaterialGrid$offset() {
        return debugShowMaterialGrid$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int debugShowMaterialGrid
     * }
     */
    public static int debugShowMaterialGrid(MemorySegment struct) {
        return struct.get(debugShowMaterialGrid$LAYOUT, debugShowMaterialGrid$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int debugShowMaterialGrid
     * }
     */
    public static void debugShowMaterialGrid(MemorySegment struct, int fieldValue) {
        struct.set(debugShowMaterialGrid$LAYOUT, debugShowMaterialGrid$OFFSET, fieldValue);
    }

    private static final OfInt useInheritedMediaQuery$LAYOUT = (OfInt)$LAYOUT.select(groupElement("useInheritedMediaQuery"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int useInheritedMediaQuery
     * }
     */
    public static final OfInt useInheritedMediaQuery$layout() {
        return useInheritedMediaQuery$LAYOUT;
    }

    private static final long useInheritedMediaQuery$OFFSET = 14788;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int useInheritedMediaQuery
     * }
     */
    public static final long useInheritedMediaQuery$offset() {
        return useInheritedMediaQuery$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int useInheritedMediaQuery
     * }
     */
    public static int useInheritedMediaQuery(MemorySegment struct) {
        return struct.get(useInheritedMediaQuery$LAYOUT, useInheritedMediaQuery$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int useInheritedMediaQuery
     * }
     */
    public static void useInheritedMediaQuery(MemorySegment struct, int fieldValue) {
        struct.set(useInheritedMediaQuery$LAYOUT, useInheritedMediaQuery$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

