// Generated by jextract

package dev.equo.ewt.ffm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     int id;
 *     DartObj shade100;
 *     DartObj shade200;
 *     DartObj shade400;
 *     DartObj shade700;
 * }
 * }
 */
public class MaterialAccentColorObjSt {

    MaterialAccentColorObjSt() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        StarterBridge.C_INT.withName("id"),
        StarterBridge.C_INT.withName("shade100"),
        StarterBridge.C_INT.withName("shade200"),
        StarterBridge.C_INT.withName("shade400"),
        StarterBridge.C_INT.withName("shade700")
    ).withName("$anon$437:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt id$LAYOUT = (OfInt)$LAYOUT.select(groupElement("id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final OfInt id$layout() {
        return id$LAYOUT;
    }

    private static final long id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final long id$offset() {
        return id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static int id(MemorySegment struct) {
        return struct.get(id$LAYOUT, id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static void id(MemorySegment struct, int fieldValue) {
        struct.set(id$LAYOUT, id$OFFSET, fieldValue);
    }

    private static final OfInt shade100$LAYOUT = (OfInt)$LAYOUT.select(groupElement("shade100"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj shade100
     * }
     */
    public static final OfInt shade100$layout() {
        return shade100$LAYOUT;
    }

    private static final long shade100$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj shade100
     * }
     */
    public static final long shade100$offset() {
        return shade100$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj shade100
     * }
     */
    public static int shade100(MemorySegment struct) {
        return struct.get(shade100$LAYOUT, shade100$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj shade100
     * }
     */
    public static void shade100(MemorySegment struct, int fieldValue) {
        struct.set(shade100$LAYOUT, shade100$OFFSET, fieldValue);
    }

    private static final OfInt shade200$LAYOUT = (OfInt)$LAYOUT.select(groupElement("shade200"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj shade200
     * }
     */
    public static final OfInt shade200$layout() {
        return shade200$LAYOUT;
    }

    private static final long shade200$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj shade200
     * }
     */
    public static final long shade200$offset() {
        return shade200$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj shade200
     * }
     */
    public static int shade200(MemorySegment struct) {
        return struct.get(shade200$LAYOUT, shade200$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj shade200
     * }
     */
    public static void shade200(MemorySegment struct, int fieldValue) {
        struct.set(shade200$LAYOUT, shade200$OFFSET, fieldValue);
    }

    private static final OfInt shade400$LAYOUT = (OfInt)$LAYOUT.select(groupElement("shade400"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj shade400
     * }
     */
    public static final OfInt shade400$layout() {
        return shade400$LAYOUT;
    }

    private static final long shade400$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj shade400
     * }
     */
    public static final long shade400$offset() {
        return shade400$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj shade400
     * }
     */
    public static int shade400(MemorySegment struct) {
        return struct.get(shade400$LAYOUT, shade400$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj shade400
     * }
     */
    public static void shade400(MemorySegment struct, int fieldValue) {
        struct.set(shade400$LAYOUT, shade400$OFFSET, fieldValue);
    }

    private static final OfInt shade700$LAYOUT = (OfInt)$LAYOUT.select(groupElement("shade700"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj shade700
     * }
     */
    public static final OfInt shade700$layout() {
        return shade700$LAYOUT;
    }

    private static final long shade700$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj shade700
     * }
     */
    public static final long shade700$offset() {
        return shade700$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj shade700
     * }
     */
    public static int shade700(MemorySegment struct) {
        return struct.get(shade700$LAYOUT, shade700$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj shade700
     * }
     */
    public static void shade700(MemorySegment struct, int fieldValue) {
        struct.set(shade700$LAYOUT, shade700$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

