// Generated by jextract

package dev.equo.ewt.ffm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     int id;
 *     DartObj text;
 *     int textAlign;
 *     int textDirection;
 *     int softWrap;
 *     int overflow;
 *     int maxLines;
 *     int textWidthBasis;
 *     DartObj selectionColor;
 *     double textScaleFactor;
 * }
 * }
 */
public class RichTextObjSt {

    RichTextObjSt() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        StarterBridge.C_INT.withName("id"),
        StarterBridge.C_INT.withName("text"),
        StarterBridge.C_INT.withName("textAlign"),
        StarterBridge.C_INT.withName("textDirection"),
        StarterBridge.C_INT.withName("softWrap"),
        StarterBridge.C_INT.withName("overflow"),
        StarterBridge.C_INT.withName("maxLines"),
        StarterBridge.C_INT.withName("textWidthBasis"),
        StarterBridge.C_INT.withName("selectionColor"),
        MemoryLayout.paddingLayout(4),
        StarterBridge.C_DOUBLE.withName("textScaleFactor")
    ).withName("$anon$44:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt id$LAYOUT = (OfInt)$LAYOUT.select(groupElement("id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final OfInt id$layout() {
        return id$LAYOUT;
    }

    private static final long id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final long id$offset() {
        return id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static int id(MemorySegment struct) {
        return struct.get(id$LAYOUT, id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static void id(MemorySegment struct, int fieldValue) {
        struct.set(id$LAYOUT, id$OFFSET, fieldValue);
    }

    private static final OfInt text$LAYOUT = (OfInt)$LAYOUT.select(groupElement("text"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj text
     * }
     */
    public static final OfInt text$layout() {
        return text$LAYOUT;
    }

    private static final long text$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj text
     * }
     */
    public static final long text$offset() {
        return text$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj text
     * }
     */
    public static int text(MemorySegment struct) {
        return struct.get(text$LAYOUT, text$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj text
     * }
     */
    public static void text(MemorySegment struct, int fieldValue) {
        struct.set(text$LAYOUT, text$OFFSET, fieldValue);
    }

    private static final OfInt textAlign$LAYOUT = (OfInt)$LAYOUT.select(groupElement("textAlign"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int textAlign
     * }
     */
    public static final OfInt textAlign$layout() {
        return textAlign$LAYOUT;
    }

    private static final long textAlign$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int textAlign
     * }
     */
    public static final long textAlign$offset() {
        return textAlign$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int textAlign
     * }
     */
    public static int textAlign(MemorySegment struct) {
        return struct.get(textAlign$LAYOUT, textAlign$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int textAlign
     * }
     */
    public static void textAlign(MemorySegment struct, int fieldValue) {
        struct.set(textAlign$LAYOUT, textAlign$OFFSET, fieldValue);
    }

    private static final OfInt textDirection$LAYOUT = (OfInt)$LAYOUT.select(groupElement("textDirection"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int textDirection
     * }
     */
    public static final OfInt textDirection$layout() {
        return textDirection$LAYOUT;
    }

    private static final long textDirection$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int textDirection
     * }
     */
    public static final long textDirection$offset() {
        return textDirection$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int textDirection
     * }
     */
    public static int textDirection(MemorySegment struct) {
        return struct.get(textDirection$LAYOUT, textDirection$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int textDirection
     * }
     */
    public static void textDirection(MemorySegment struct, int fieldValue) {
        struct.set(textDirection$LAYOUT, textDirection$OFFSET, fieldValue);
    }

    private static final OfInt softWrap$LAYOUT = (OfInt)$LAYOUT.select(groupElement("softWrap"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int softWrap
     * }
     */
    public static final OfInt softWrap$layout() {
        return softWrap$LAYOUT;
    }

    private static final long softWrap$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int softWrap
     * }
     */
    public static final long softWrap$offset() {
        return softWrap$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int softWrap
     * }
     */
    public static int softWrap(MemorySegment struct) {
        return struct.get(softWrap$LAYOUT, softWrap$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int softWrap
     * }
     */
    public static void softWrap(MemorySegment struct, int fieldValue) {
        struct.set(softWrap$LAYOUT, softWrap$OFFSET, fieldValue);
    }

    private static final OfInt overflow$LAYOUT = (OfInt)$LAYOUT.select(groupElement("overflow"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int overflow
     * }
     */
    public static final OfInt overflow$layout() {
        return overflow$LAYOUT;
    }

    private static final long overflow$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int overflow
     * }
     */
    public static final long overflow$offset() {
        return overflow$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int overflow
     * }
     */
    public static int overflow(MemorySegment struct) {
        return struct.get(overflow$LAYOUT, overflow$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int overflow
     * }
     */
    public static void overflow(MemorySegment struct, int fieldValue) {
        struct.set(overflow$LAYOUT, overflow$OFFSET, fieldValue);
    }

    private static final OfInt maxLines$LAYOUT = (OfInt)$LAYOUT.select(groupElement("maxLines"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int maxLines
     * }
     */
    public static final OfInt maxLines$layout() {
        return maxLines$LAYOUT;
    }

    private static final long maxLines$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int maxLines
     * }
     */
    public static final long maxLines$offset() {
        return maxLines$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int maxLines
     * }
     */
    public static int maxLines(MemorySegment struct) {
        return struct.get(maxLines$LAYOUT, maxLines$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int maxLines
     * }
     */
    public static void maxLines(MemorySegment struct, int fieldValue) {
        struct.set(maxLines$LAYOUT, maxLines$OFFSET, fieldValue);
    }

    private static final OfInt textWidthBasis$LAYOUT = (OfInt)$LAYOUT.select(groupElement("textWidthBasis"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int textWidthBasis
     * }
     */
    public static final OfInt textWidthBasis$layout() {
        return textWidthBasis$LAYOUT;
    }

    private static final long textWidthBasis$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int textWidthBasis
     * }
     */
    public static final long textWidthBasis$offset() {
        return textWidthBasis$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int textWidthBasis
     * }
     */
    public static int textWidthBasis(MemorySegment struct) {
        return struct.get(textWidthBasis$LAYOUT, textWidthBasis$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int textWidthBasis
     * }
     */
    public static void textWidthBasis(MemorySegment struct, int fieldValue) {
        struct.set(textWidthBasis$LAYOUT, textWidthBasis$OFFSET, fieldValue);
    }

    private static final OfInt selectionColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("selectionColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj selectionColor
     * }
     */
    public static final OfInt selectionColor$layout() {
        return selectionColor$LAYOUT;
    }

    private static final long selectionColor$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj selectionColor
     * }
     */
    public static final long selectionColor$offset() {
        return selectionColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj selectionColor
     * }
     */
    public static int selectionColor(MemorySegment struct) {
        return struct.get(selectionColor$LAYOUT, selectionColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj selectionColor
     * }
     */
    public static void selectionColor(MemorySegment struct, int fieldValue) {
        struct.set(selectionColor$LAYOUT, selectionColor$OFFSET, fieldValue);
    }

    private static final OfDouble textScaleFactor$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("textScaleFactor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double textScaleFactor
     * }
     */
    public static final OfDouble textScaleFactor$layout() {
        return textScaleFactor$LAYOUT;
    }

    private static final long textScaleFactor$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double textScaleFactor
     * }
     */
    public static final long textScaleFactor$offset() {
        return textScaleFactor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double textScaleFactor
     * }
     */
    public static double textScaleFactor(MemorySegment struct) {
        return struct.get(textScaleFactor$LAYOUT, textScaleFactor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double textScaleFactor
     * }
     */
    public static void textScaleFactor(MemorySegment struct, double fieldValue) {
        struct.set(textScaleFactor$LAYOUT, textScaleFactor$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

