// Generated by jextract

package dev.equo.ewt.ffm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     int id;
 *     int left;
 *     int top;
 *     int right;
 *     int bottom;
 *     EdgeInsetsObjSt minimum;
 *     int maintainBottomViewPadding;
 *     DartObj child;
 * }
 * }
 */
public class SafeAreaObjSt {

    SafeAreaObjSt() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        StarterBridge.C_INT.withName("id"),
        StarterBridge.C_INT.withName("left"),
        StarterBridge.C_INT.withName("top"),
        StarterBridge.C_INT.withName("right"),
        StarterBridge.C_INT.withName("bottom"),
        MemoryLayout.paddingLayout(4),
        EdgeInsetsObjSt.layout().withName("minimum"),
        StarterBridge.C_INT.withName("maintainBottomViewPadding"),
        StarterBridge.C_INT.withName("child")
    ).withName("$anon$318:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt id$LAYOUT = (OfInt)$LAYOUT.select(groupElement("id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final OfInt id$layout() {
        return id$LAYOUT;
    }

    private static final long id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final long id$offset() {
        return id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static int id(MemorySegment struct) {
        return struct.get(id$LAYOUT, id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static void id(MemorySegment struct, int fieldValue) {
        struct.set(id$LAYOUT, id$OFFSET, fieldValue);
    }

    private static final OfInt left$LAYOUT = (OfInt)$LAYOUT.select(groupElement("left"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int left
     * }
     */
    public static final OfInt left$layout() {
        return left$LAYOUT;
    }

    private static final long left$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int left
     * }
     */
    public static final long left$offset() {
        return left$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int left
     * }
     */
    public static int left(MemorySegment struct) {
        return struct.get(left$LAYOUT, left$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int left
     * }
     */
    public static void left(MemorySegment struct, int fieldValue) {
        struct.set(left$LAYOUT, left$OFFSET, fieldValue);
    }

    private static final OfInt top$LAYOUT = (OfInt)$LAYOUT.select(groupElement("top"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int top
     * }
     */
    public static final OfInt top$layout() {
        return top$LAYOUT;
    }

    private static final long top$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int top
     * }
     */
    public static final long top$offset() {
        return top$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int top
     * }
     */
    public static int top(MemorySegment struct) {
        return struct.get(top$LAYOUT, top$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int top
     * }
     */
    public static void top(MemorySegment struct, int fieldValue) {
        struct.set(top$LAYOUT, top$OFFSET, fieldValue);
    }

    private static final OfInt right$LAYOUT = (OfInt)$LAYOUT.select(groupElement("right"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int right
     * }
     */
    public static final OfInt right$layout() {
        return right$LAYOUT;
    }

    private static final long right$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int right
     * }
     */
    public static final long right$offset() {
        return right$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int right
     * }
     */
    public static int right(MemorySegment struct) {
        return struct.get(right$LAYOUT, right$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int right
     * }
     */
    public static void right(MemorySegment struct, int fieldValue) {
        struct.set(right$LAYOUT, right$OFFSET, fieldValue);
    }

    private static final OfInt bottom$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bottom"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int bottom
     * }
     */
    public static final OfInt bottom$layout() {
        return bottom$LAYOUT;
    }

    private static final long bottom$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int bottom
     * }
     */
    public static final long bottom$offset() {
        return bottom$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int bottom
     * }
     */
    public static int bottom(MemorySegment struct) {
        return struct.get(bottom$LAYOUT, bottom$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int bottom
     * }
     */
    public static void bottom(MemorySegment struct, int fieldValue) {
        struct.set(bottom$LAYOUT, bottom$OFFSET, fieldValue);
    }

    private static final GroupLayout minimum$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("minimum"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * EdgeInsetsObjSt minimum
     * }
     */
    public static final GroupLayout minimum$layout() {
        return minimum$LAYOUT;
    }

    private static final long minimum$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * EdgeInsetsObjSt minimum
     * }
     */
    public static final long minimum$offset() {
        return minimum$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * EdgeInsetsObjSt minimum
     * }
     */
    public static MemorySegment minimum(MemorySegment struct) {
        return struct.asSlice(minimum$OFFSET, minimum$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * EdgeInsetsObjSt minimum
     * }
     */
    public static void minimum(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, minimum$OFFSET, minimum$LAYOUT.byteSize());
    }

    private static final OfInt maintainBottomViewPadding$LAYOUT = (OfInt)$LAYOUT.select(groupElement("maintainBottomViewPadding"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int maintainBottomViewPadding
     * }
     */
    public static final OfInt maintainBottomViewPadding$layout() {
        return maintainBottomViewPadding$LAYOUT;
    }

    private static final long maintainBottomViewPadding$OFFSET = 80;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int maintainBottomViewPadding
     * }
     */
    public static final long maintainBottomViewPadding$offset() {
        return maintainBottomViewPadding$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int maintainBottomViewPadding
     * }
     */
    public static int maintainBottomViewPadding(MemorySegment struct) {
        return struct.get(maintainBottomViewPadding$LAYOUT, maintainBottomViewPadding$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int maintainBottomViewPadding
     * }
     */
    public static void maintainBottomViewPadding(MemorySegment struct, int fieldValue) {
        struct.set(maintainBottomViewPadding$LAYOUT, maintainBottomViewPadding$OFFSET, fieldValue);
    }

    private static final OfInt child$LAYOUT = (OfInt)$LAYOUT.select(groupElement("child"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj child
     * }
     */
    public static final OfInt child$layout() {
        return child$LAYOUT;
    }

    private static final long child$OFFSET = 84;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj child
     * }
     */
    public static final long child$offset() {
        return child$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj child
     * }
     */
    public static int child(MemorySegment struct) {
        return struct.get(child$LAYOUT, child$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj child
     * }
     */
    public static void child(MemorySegment struct, int fieldValue) {
        struct.set(child$LAYOUT, child$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

