// Generated by jextract

package dev.equo.ewt.ffm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     int id;
 *     int extendBody;
 *     int extendBodyBehindAppBar;
 *     DartObj body;
 *     DartObj floatingActionButton;
 *     DartObj drawer;
 *     DartObj endDrawer;
 *     DartObj drawerScrimColor;
 *     DartObj backgroundColor;
 *     DartObj bottomNavigationBar;
 *     DartObj bottomSheet;
 *     int resizeToAvoidBottomInset;
 *     int primary;
 *     int drawerDragStartBehavior;
 *     double drawerEdgeDragWidth;
 *     int drawerEnableOpenDragGesture;
 *     int endDrawerEnableOpenDragGesture;
 *     char *restorationId;
 * }
 * }
 */
public class ScaffoldObjSt {

    ScaffoldObjSt() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        StarterBridge.C_INT.withName("id"),
        StarterBridge.C_INT.withName("extendBody"),
        StarterBridge.C_INT.withName("extendBodyBehindAppBar"),
        StarterBridge.C_INT.withName("body"),
        StarterBridge.C_INT.withName("floatingActionButton"),
        StarterBridge.C_INT.withName("drawer"),
        StarterBridge.C_INT.withName("endDrawer"),
        StarterBridge.C_INT.withName("drawerScrimColor"),
        StarterBridge.C_INT.withName("backgroundColor"),
        StarterBridge.C_INT.withName("bottomNavigationBar"),
        StarterBridge.C_INT.withName("bottomSheet"),
        StarterBridge.C_INT.withName("resizeToAvoidBottomInset"),
        StarterBridge.C_INT.withName("primary"),
        StarterBridge.C_INT.withName("drawerDragStartBehavior"),
        StarterBridge.C_DOUBLE.withName("drawerEdgeDragWidth"),
        StarterBridge.C_INT.withName("drawerEnableOpenDragGesture"),
        StarterBridge.C_INT.withName("endDrawerEnableOpenDragGesture"),
        StarterBridge.C_POINTER.withName("restorationId")
    ).withName("$anon$462:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt id$LAYOUT = (OfInt)$LAYOUT.select(groupElement("id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final OfInt id$layout() {
        return id$LAYOUT;
    }

    private static final long id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final long id$offset() {
        return id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static int id(MemorySegment struct) {
        return struct.get(id$LAYOUT, id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static void id(MemorySegment struct, int fieldValue) {
        struct.set(id$LAYOUT, id$OFFSET, fieldValue);
    }

    private static final OfInt extendBody$LAYOUT = (OfInt)$LAYOUT.select(groupElement("extendBody"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int extendBody
     * }
     */
    public static final OfInt extendBody$layout() {
        return extendBody$LAYOUT;
    }

    private static final long extendBody$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int extendBody
     * }
     */
    public static final long extendBody$offset() {
        return extendBody$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int extendBody
     * }
     */
    public static int extendBody(MemorySegment struct) {
        return struct.get(extendBody$LAYOUT, extendBody$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int extendBody
     * }
     */
    public static void extendBody(MemorySegment struct, int fieldValue) {
        struct.set(extendBody$LAYOUT, extendBody$OFFSET, fieldValue);
    }

    private static final OfInt extendBodyBehindAppBar$LAYOUT = (OfInt)$LAYOUT.select(groupElement("extendBodyBehindAppBar"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int extendBodyBehindAppBar
     * }
     */
    public static final OfInt extendBodyBehindAppBar$layout() {
        return extendBodyBehindAppBar$LAYOUT;
    }

    private static final long extendBodyBehindAppBar$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int extendBodyBehindAppBar
     * }
     */
    public static final long extendBodyBehindAppBar$offset() {
        return extendBodyBehindAppBar$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int extendBodyBehindAppBar
     * }
     */
    public static int extendBodyBehindAppBar(MemorySegment struct) {
        return struct.get(extendBodyBehindAppBar$LAYOUT, extendBodyBehindAppBar$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int extendBodyBehindAppBar
     * }
     */
    public static void extendBodyBehindAppBar(MemorySegment struct, int fieldValue) {
        struct.set(extendBodyBehindAppBar$LAYOUT, extendBodyBehindAppBar$OFFSET, fieldValue);
    }

    private static final OfInt body$LAYOUT = (OfInt)$LAYOUT.select(groupElement("body"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj body
     * }
     */
    public static final OfInt body$layout() {
        return body$LAYOUT;
    }

    private static final long body$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj body
     * }
     */
    public static final long body$offset() {
        return body$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj body
     * }
     */
    public static int body(MemorySegment struct) {
        return struct.get(body$LAYOUT, body$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj body
     * }
     */
    public static void body(MemorySegment struct, int fieldValue) {
        struct.set(body$LAYOUT, body$OFFSET, fieldValue);
    }

    private static final OfInt floatingActionButton$LAYOUT = (OfInt)$LAYOUT.select(groupElement("floatingActionButton"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj floatingActionButton
     * }
     */
    public static final OfInt floatingActionButton$layout() {
        return floatingActionButton$LAYOUT;
    }

    private static final long floatingActionButton$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj floatingActionButton
     * }
     */
    public static final long floatingActionButton$offset() {
        return floatingActionButton$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj floatingActionButton
     * }
     */
    public static int floatingActionButton(MemorySegment struct) {
        return struct.get(floatingActionButton$LAYOUT, floatingActionButton$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj floatingActionButton
     * }
     */
    public static void floatingActionButton(MemorySegment struct, int fieldValue) {
        struct.set(floatingActionButton$LAYOUT, floatingActionButton$OFFSET, fieldValue);
    }

    private static final OfInt drawer$LAYOUT = (OfInt)$LAYOUT.select(groupElement("drawer"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj drawer
     * }
     */
    public static final OfInt drawer$layout() {
        return drawer$LAYOUT;
    }

    private static final long drawer$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj drawer
     * }
     */
    public static final long drawer$offset() {
        return drawer$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj drawer
     * }
     */
    public static int drawer(MemorySegment struct) {
        return struct.get(drawer$LAYOUT, drawer$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj drawer
     * }
     */
    public static void drawer(MemorySegment struct, int fieldValue) {
        struct.set(drawer$LAYOUT, drawer$OFFSET, fieldValue);
    }

    private static final OfInt endDrawer$LAYOUT = (OfInt)$LAYOUT.select(groupElement("endDrawer"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj endDrawer
     * }
     */
    public static final OfInt endDrawer$layout() {
        return endDrawer$LAYOUT;
    }

    private static final long endDrawer$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj endDrawer
     * }
     */
    public static final long endDrawer$offset() {
        return endDrawer$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj endDrawer
     * }
     */
    public static int endDrawer(MemorySegment struct) {
        return struct.get(endDrawer$LAYOUT, endDrawer$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj endDrawer
     * }
     */
    public static void endDrawer(MemorySegment struct, int fieldValue) {
        struct.set(endDrawer$LAYOUT, endDrawer$OFFSET, fieldValue);
    }

    private static final OfInt drawerScrimColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("drawerScrimColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj drawerScrimColor
     * }
     */
    public static final OfInt drawerScrimColor$layout() {
        return drawerScrimColor$LAYOUT;
    }

    private static final long drawerScrimColor$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj drawerScrimColor
     * }
     */
    public static final long drawerScrimColor$offset() {
        return drawerScrimColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj drawerScrimColor
     * }
     */
    public static int drawerScrimColor(MemorySegment struct) {
        return struct.get(drawerScrimColor$LAYOUT, drawerScrimColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj drawerScrimColor
     * }
     */
    public static void drawerScrimColor(MemorySegment struct, int fieldValue) {
        struct.set(drawerScrimColor$LAYOUT, drawerScrimColor$OFFSET, fieldValue);
    }

    private static final OfInt backgroundColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("backgroundColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj backgroundColor
     * }
     */
    public static final OfInt backgroundColor$layout() {
        return backgroundColor$LAYOUT;
    }

    private static final long backgroundColor$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj backgroundColor
     * }
     */
    public static final long backgroundColor$offset() {
        return backgroundColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj backgroundColor
     * }
     */
    public static int backgroundColor(MemorySegment struct) {
        return struct.get(backgroundColor$LAYOUT, backgroundColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj backgroundColor
     * }
     */
    public static void backgroundColor(MemorySegment struct, int fieldValue) {
        struct.set(backgroundColor$LAYOUT, backgroundColor$OFFSET, fieldValue);
    }

    private static final OfInt bottomNavigationBar$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bottomNavigationBar"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj bottomNavigationBar
     * }
     */
    public static final OfInt bottomNavigationBar$layout() {
        return bottomNavigationBar$LAYOUT;
    }

    private static final long bottomNavigationBar$OFFSET = 36;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj bottomNavigationBar
     * }
     */
    public static final long bottomNavigationBar$offset() {
        return bottomNavigationBar$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj bottomNavigationBar
     * }
     */
    public static int bottomNavigationBar(MemorySegment struct) {
        return struct.get(bottomNavigationBar$LAYOUT, bottomNavigationBar$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj bottomNavigationBar
     * }
     */
    public static void bottomNavigationBar(MemorySegment struct, int fieldValue) {
        struct.set(bottomNavigationBar$LAYOUT, bottomNavigationBar$OFFSET, fieldValue);
    }

    private static final OfInt bottomSheet$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bottomSheet"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj bottomSheet
     * }
     */
    public static final OfInt bottomSheet$layout() {
        return bottomSheet$LAYOUT;
    }

    private static final long bottomSheet$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj bottomSheet
     * }
     */
    public static final long bottomSheet$offset() {
        return bottomSheet$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj bottomSheet
     * }
     */
    public static int bottomSheet(MemorySegment struct) {
        return struct.get(bottomSheet$LAYOUT, bottomSheet$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj bottomSheet
     * }
     */
    public static void bottomSheet(MemorySegment struct, int fieldValue) {
        struct.set(bottomSheet$LAYOUT, bottomSheet$OFFSET, fieldValue);
    }

    private static final OfInt resizeToAvoidBottomInset$LAYOUT = (OfInt)$LAYOUT.select(groupElement("resizeToAvoidBottomInset"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int resizeToAvoidBottomInset
     * }
     */
    public static final OfInt resizeToAvoidBottomInset$layout() {
        return resizeToAvoidBottomInset$LAYOUT;
    }

    private static final long resizeToAvoidBottomInset$OFFSET = 44;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int resizeToAvoidBottomInset
     * }
     */
    public static final long resizeToAvoidBottomInset$offset() {
        return resizeToAvoidBottomInset$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int resizeToAvoidBottomInset
     * }
     */
    public static int resizeToAvoidBottomInset(MemorySegment struct) {
        return struct.get(resizeToAvoidBottomInset$LAYOUT, resizeToAvoidBottomInset$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int resizeToAvoidBottomInset
     * }
     */
    public static void resizeToAvoidBottomInset(MemorySegment struct, int fieldValue) {
        struct.set(resizeToAvoidBottomInset$LAYOUT, resizeToAvoidBottomInset$OFFSET, fieldValue);
    }

    private static final OfInt primary$LAYOUT = (OfInt)$LAYOUT.select(groupElement("primary"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int primary
     * }
     */
    public static final OfInt primary$layout() {
        return primary$LAYOUT;
    }

    private static final long primary$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int primary
     * }
     */
    public static final long primary$offset() {
        return primary$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int primary
     * }
     */
    public static int primary(MemorySegment struct) {
        return struct.get(primary$LAYOUT, primary$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int primary
     * }
     */
    public static void primary(MemorySegment struct, int fieldValue) {
        struct.set(primary$LAYOUT, primary$OFFSET, fieldValue);
    }

    private static final OfInt drawerDragStartBehavior$LAYOUT = (OfInt)$LAYOUT.select(groupElement("drawerDragStartBehavior"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int drawerDragStartBehavior
     * }
     */
    public static final OfInt drawerDragStartBehavior$layout() {
        return drawerDragStartBehavior$LAYOUT;
    }

    private static final long drawerDragStartBehavior$OFFSET = 52;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int drawerDragStartBehavior
     * }
     */
    public static final long drawerDragStartBehavior$offset() {
        return drawerDragStartBehavior$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int drawerDragStartBehavior
     * }
     */
    public static int drawerDragStartBehavior(MemorySegment struct) {
        return struct.get(drawerDragStartBehavior$LAYOUT, drawerDragStartBehavior$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int drawerDragStartBehavior
     * }
     */
    public static void drawerDragStartBehavior(MemorySegment struct, int fieldValue) {
        struct.set(drawerDragStartBehavior$LAYOUT, drawerDragStartBehavior$OFFSET, fieldValue);
    }

    private static final OfDouble drawerEdgeDragWidth$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("drawerEdgeDragWidth"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double drawerEdgeDragWidth
     * }
     */
    public static final OfDouble drawerEdgeDragWidth$layout() {
        return drawerEdgeDragWidth$LAYOUT;
    }

    private static final long drawerEdgeDragWidth$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double drawerEdgeDragWidth
     * }
     */
    public static final long drawerEdgeDragWidth$offset() {
        return drawerEdgeDragWidth$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double drawerEdgeDragWidth
     * }
     */
    public static double drawerEdgeDragWidth(MemorySegment struct) {
        return struct.get(drawerEdgeDragWidth$LAYOUT, drawerEdgeDragWidth$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double drawerEdgeDragWidth
     * }
     */
    public static void drawerEdgeDragWidth(MemorySegment struct, double fieldValue) {
        struct.set(drawerEdgeDragWidth$LAYOUT, drawerEdgeDragWidth$OFFSET, fieldValue);
    }

    private static final OfInt drawerEnableOpenDragGesture$LAYOUT = (OfInt)$LAYOUT.select(groupElement("drawerEnableOpenDragGesture"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int drawerEnableOpenDragGesture
     * }
     */
    public static final OfInt drawerEnableOpenDragGesture$layout() {
        return drawerEnableOpenDragGesture$LAYOUT;
    }

    private static final long drawerEnableOpenDragGesture$OFFSET = 64;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int drawerEnableOpenDragGesture
     * }
     */
    public static final long drawerEnableOpenDragGesture$offset() {
        return drawerEnableOpenDragGesture$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int drawerEnableOpenDragGesture
     * }
     */
    public static int drawerEnableOpenDragGesture(MemorySegment struct) {
        return struct.get(drawerEnableOpenDragGesture$LAYOUT, drawerEnableOpenDragGesture$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int drawerEnableOpenDragGesture
     * }
     */
    public static void drawerEnableOpenDragGesture(MemorySegment struct, int fieldValue) {
        struct.set(drawerEnableOpenDragGesture$LAYOUT, drawerEnableOpenDragGesture$OFFSET, fieldValue);
    }

    private static final OfInt endDrawerEnableOpenDragGesture$LAYOUT = (OfInt)$LAYOUT.select(groupElement("endDrawerEnableOpenDragGesture"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int endDrawerEnableOpenDragGesture
     * }
     */
    public static final OfInt endDrawerEnableOpenDragGesture$layout() {
        return endDrawerEnableOpenDragGesture$LAYOUT;
    }

    private static final long endDrawerEnableOpenDragGesture$OFFSET = 68;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int endDrawerEnableOpenDragGesture
     * }
     */
    public static final long endDrawerEnableOpenDragGesture$offset() {
        return endDrawerEnableOpenDragGesture$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int endDrawerEnableOpenDragGesture
     * }
     */
    public static int endDrawerEnableOpenDragGesture(MemorySegment struct) {
        return struct.get(endDrawerEnableOpenDragGesture$LAYOUT, endDrawerEnableOpenDragGesture$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int endDrawerEnableOpenDragGesture
     * }
     */
    public static void endDrawerEnableOpenDragGesture(MemorySegment struct, int fieldValue) {
        struct.set(endDrawerEnableOpenDragGesture$LAYOUT, endDrawerEnableOpenDragGesture$OFFSET, fieldValue);
    }

    private static final AddressLayout restorationId$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("restorationId"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char *restorationId
     * }
     */
    public static final AddressLayout restorationId$layout() {
        return restorationId$LAYOUT;
    }

    private static final long restorationId$OFFSET = 72;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char *restorationId
     * }
     */
    public static final long restorationId$offset() {
        return restorationId$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char *restorationId
     * }
     */
    public static MemorySegment restorationId(MemorySegment struct) {
        return struct.get(restorationId$LAYOUT, restorationId$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char *restorationId
     * }
     */
    public static void restorationId(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(restorationId$LAYOUT, restorationId$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

