// Generated by jextract

package dev.equo.ewt.ffm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     int id;
 *     DartObj textColor;
 *     DartObj backgroundColor;
 *     DartObj disabledTextColor;
 *     DartObj disabledBackgroundColor;
 *     char *label;
 * }
 * }
 */
public class SnackBarActionObjSt {

    SnackBarActionObjSt() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        StarterBridge.C_INT.withName("id"),
        StarterBridge.C_INT.withName("textColor"),
        StarterBridge.C_INT.withName("backgroundColor"),
        StarterBridge.C_INT.withName("disabledTextColor"),
        StarterBridge.C_INT.withName("disabledBackgroundColor"),
        MemoryLayout.paddingLayout(4),
        StarterBridge.C_POINTER.withName("label")
    ).withName("$anon$773:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt id$LAYOUT = (OfInt)$LAYOUT.select(groupElement("id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final OfInt id$layout() {
        return id$LAYOUT;
    }

    private static final long id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final long id$offset() {
        return id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static int id(MemorySegment struct) {
        return struct.get(id$LAYOUT, id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static void id(MemorySegment struct, int fieldValue) {
        struct.set(id$LAYOUT, id$OFFSET, fieldValue);
    }

    private static final OfInt textColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("textColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj textColor
     * }
     */
    public static final OfInt textColor$layout() {
        return textColor$LAYOUT;
    }

    private static final long textColor$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj textColor
     * }
     */
    public static final long textColor$offset() {
        return textColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj textColor
     * }
     */
    public static int textColor(MemorySegment struct) {
        return struct.get(textColor$LAYOUT, textColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj textColor
     * }
     */
    public static void textColor(MemorySegment struct, int fieldValue) {
        struct.set(textColor$LAYOUT, textColor$OFFSET, fieldValue);
    }

    private static final OfInt backgroundColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("backgroundColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj backgroundColor
     * }
     */
    public static final OfInt backgroundColor$layout() {
        return backgroundColor$LAYOUT;
    }

    private static final long backgroundColor$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj backgroundColor
     * }
     */
    public static final long backgroundColor$offset() {
        return backgroundColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj backgroundColor
     * }
     */
    public static int backgroundColor(MemorySegment struct) {
        return struct.get(backgroundColor$LAYOUT, backgroundColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj backgroundColor
     * }
     */
    public static void backgroundColor(MemorySegment struct, int fieldValue) {
        struct.set(backgroundColor$LAYOUT, backgroundColor$OFFSET, fieldValue);
    }

    private static final OfInt disabledTextColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("disabledTextColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj disabledTextColor
     * }
     */
    public static final OfInt disabledTextColor$layout() {
        return disabledTextColor$LAYOUT;
    }

    private static final long disabledTextColor$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj disabledTextColor
     * }
     */
    public static final long disabledTextColor$offset() {
        return disabledTextColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj disabledTextColor
     * }
     */
    public static int disabledTextColor(MemorySegment struct) {
        return struct.get(disabledTextColor$LAYOUT, disabledTextColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj disabledTextColor
     * }
     */
    public static void disabledTextColor(MemorySegment struct, int fieldValue) {
        struct.set(disabledTextColor$LAYOUT, disabledTextColor$OFFSET, fieldValue);
    }

    private static final OfInt disabledBackgroundColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("disabledBackgroundColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj disabledBackgroundColor
     * }
     */
    public static final OfInt disabledBackgroundColor$layout() {
        return disabledBackgroundColor$LAYOUT;
    }

    private static final long disabledBackgroundColor$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj disabledBackgroundColor
     * }
     */
    public static final long disabledBackgroundColor$offset() {
        return disabledBackgroundColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj disabledBackgroundColor
     * }
     */
    public static int disabledBackgroundColor(MemorySegment struct) {
        return struct.get(disabledBackgroundColor$LAYOUT, disabledBackgroundColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj disabledBackgroundColor
     * }
     */
    public static void disabledBackgroundColor(MemorySegment struct, int fieldValue) {
        struct.set(disabledBackgroundColor$LAYOUT, disabledBackgroundColor$OFFSET, fieldValue);
    }

    private static final AddressLayout label$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("label"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char *label
     * }
     */
    public static final AddressLayout label$layout() {
        return label$LAYOUT;
    }

    private static final long label$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char *label
     * }
     */
    public static final long label$offset() {
        return label$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char *label
     * }
     */
    public static MemorySegment label(MemorySegment struct) {
        return struct.get(label$LAYOUT, label$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char *label
     * }
     */
    public static void label(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(label$LAYOUT, label$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

