// Generated by jextract

package dev.equo.ewt.ffm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     int id;
 *     int inherit;
 *     DartObj color;
 *     DartObj backgroundColor;
 *     char *fontFamily;
 *     double fontSize;
 *     int fontStyle;
 *     double letterSpacing;
 *     double wordSpacing;
 *     int textBaseline;
 *     double height;
 *     int leadingDistribution;
 *     DartObj decorationColor;
 *     int decorationStyle;
 *     double decorationThickness;
 *     char *debugLabel;
 *     int overflow;
 * }
 * }
 */
public class TextStyleObjSt {

    TextStyleObjSt() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        StarterBridge.C_INT.withName("id"),
        StarterBridge.C_INT.withName("inherit"),
        StarterBridge.C_INT.withName("color"),
        StarterBridge.C_INT.withName("backgroundColor"),
        StarterBridge.C_POINTER.withName("fontFamily"),
        StarterBridge.C_DOUBLE.withName("fontSize"),
        StarterBridge.C_INT.withName("fontStyle"),
        MemoryLayout.paddingLayout(4),
        StarterBridge.C_DOUBLE.withName("letterSpacing"),
        StarterBridge.C_DOUBLE.withName("wordSpacing"),
        StarterBridge.C_INT.withName("textBaseline"),
        MemoryLayout.paddingLayout(4),
        StarterBridge.C_DOUBLE.withName("height"),
        StarterBridge.C_INT.withName("leadingDistribution"),
        StarterBridge.C_INT.withName("decorationColor"),
        StarterBridge.C_INT.withName("decorationStyle"),
        MemoryLayout.paddingLayout(4),
        StarterBridge.C_DOUBLE.withName("decorationThickness"),
        StarterBridge.C_POINTER.withName("debugLabel"),
        StarterBridge.C_INT.withName("overflow"),
        MemoryLayout.paddingLayout(4)
    ).withName("$anon$1:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt id$LAYOUT = (OfInt)$LAYOUT.select(groupElement("id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final OfInt id$layout() {
        return id$LAYOUT;
    }

    private static final long id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final long id$offset() {
        return id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static int id(MemorySegment struct) {
        return struct.get(id$LAYOUT, id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static void id(MemorySegment struct, int fieldValue) {
        struct.set(id$LAYOUT, id$OFFSET, fieldValue);
    }

    private static final OfInt inherit$LAYOUT = (OfInt)$LAYOUT.select(groupElement("inherit"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int inherit
     * }
     */
    public static final OfInt inherit$layout() {
        return inherit$LAYOUT;
    }

    private static final long inherit$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int inherit
     * }
     */
    public static final long inherit$offset() {
        return inherit$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int inherit
     * }
     */
    public static int inherit(MemorySegment struct) {
        return struct.get(inherit$LAYOUT, inherit$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int inherit
     * }
     */
    public static void inherit(MemorySegment struct, int fieldValue) {
        struct.set(inherit$LAYOUT, inherit$OFFSET, fieldValue);
    }

    private static final OfInt color$LAYOUT = (OfInt)$LAYOUT.select(groupElement("color"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj color
     * }
     */
    public static final OfInt color$layout() {
        return color$LAYOUT;
    }

    private static final long color$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj color
     * }
     */
    public static final long color$offset() {
        return color$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj color
     * }
     */
    public static int color(MemorySegment struct) {
        return struct.get(color$LAYOUT, color$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj color
     * }
     */
    public static void color(MemorySegment struct, int fieldValue) {
        struct.set(color$LAYOUT, color$OFFSET, fieldValue);
    }

    private static final OfInt backgroundColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("backgroundColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj backgroundColor
     * }
     */
    public static final OfInt backgroundColor$layout() {
        return backgroundColor$LAYOUT;
    }

    private static final long backgroundColor$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj backgroundColor
     * }
     */
    public static final long backgroundColor$offset() {
        return backgroundColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj backgroundColor
     * }
     */
    public static int backgroundColor(MemorySegment struct) {
        return struct.get(backgroundColor$LAYOUT, backgroundColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj backgroundColor
     * }
     */
    public static void backgroundColor(MemorySegment struct, int fieldValue) {
        struct.set(backgroundColor$LAYOUT, backgroundColor$OFFSET, fieldValue);
    }

    private static final AddressLayout fontFamily$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("fontFamily"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char *fontFamily
     * }
     */
    public static final AddressLayout fontFamily$layout() {
        return fontFamily$LAYOUT;
    }

    private static final long fontFamily$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char *fontFamily
     * }
     */
    public static final long fontFamily$offset() {
        return fontFamily$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char *fontFamily
     * }
     */
    public static MemorySegment fontFamily(MemorySegment struct) {
        return struct.get(fontFamily$LAYOUT, fontFamily$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char *fontFamily
     * }
     */
    public static void fontFamily(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(fontFamily$LAYOUT, fontFamily$OFFSET, fieldValue);
    }

    private static final OfDouble fontSize$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("fontSize"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double fontSize
     * }
     */
    public static final OfDouble fontSize$layout() {
        return fontSize$LAYOUT;
    }

    private static final long fontSize$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double fontSize
     * }
     */
    public static final long fontSize$offset() {
        return fontSize$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double fontSize
     * }
     */
    public static double fontSize(MemorySegment struct) {
        return struct.get(fontSize$LAYOUT, fontSize$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double fontSize
     * }
     */
    public static void fontSize(MemorySegment struct, double fieldValue) {
        struct.set(fontSize$LAYOUT, fontSize$OFFSET, fieldValue);
    }

    private static final OfInt fontStyle$LAYOUT = (OfInt)$LAYOUT.select(groupElement("fontStyle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int fontStyle
     * }
     */
    public static final OfInt fontStyle$layout() {
        return fontStyle$LAYOUT;
    }

    private static final long fontStyle$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int fontStyle
     * }
     */
    public static final long fontStyle$offset() {
        return fontStyle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int fontStyle
     * }
     */
    public static int fontStyle(MemorySegment struct) {
        return struct.get(fontStyle$LAYOUT, fontStyle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int fontStyle
     * }
     */
    public static void fontStyle(MemorySegment struct, int fieldValue) {
        struct.set(fontStyle$LAYOUT, fontStyle$OFFSET, fieldValue);
    }

    private static final OfDouble letterSpacing$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("letterSpacing"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double letterSpacing
     * }
     */
    public static final OfDouble letterSpacing$layout() {
        return letterSpacing$LAYOUT;
    }

    private static final long letterSpacing$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double letterSpacing
     * }
     */
    public static final long letterSpacing$offset() {
        return letterSpacing$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double letterSpacing
     * }
     */
    public static double letterSpacing(MemorySegment struct) {
        return struct.get(letterSpacing$LAYOUT, letterSpacing$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double letterSpacing
     * }
     */
    public static void letterSpacing(MemorySegment struct, double fieldValue) {
        struct.set(letterSpacing$LAYOUT, letterSpacing$OFFSET, fieldValue);
    }

    private static final OfDouble wordSpacing$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("wordSpacing"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double wordSpacing
     * }
     */
    public static final OfDouble wordSpacing$layout() {
        return wordSpacing$LAYOUT;
    }

    private static final long wordSpacing$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double wordSpacing
     * }
     */
    public static final long wordSpacing$offset() {
        return wordSpacing$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double wordSpacing
     * }
     */
    public static double wordSpacing(MemorySegment struct) {
        return struct.get(wordSpacing$LAYOUT, wordSpacing$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double wordSpacing
     * }
     */
    public static void wordSpacing(MemorySegment struct, double fieldValue) {
        struct.set(wordSpacing$LAYOUT, wordSpacing$OFFSET, fieldValue);
    }

    private static final OfInt textBaseline$LAYOUT = (OfInt)$LAYOUT.select(groupElement("textBaseline"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int textBaseline
     * }
     */
    public static final OfInt textBaseline$layout() {
        return textBaseline$LAYOUT;
    }

    private static final long textBaseline$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int textBaseline
     * }
     */
    public static final long textBaseline$offset() {
        return textBaseline$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int textBaseline
     * }
     */
    public static int textBaseline(MemorySegment struct) {
        return struct.get(textBaseline$LAYOUT, textBaseline$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int textBaseline
     * }
     */
    public static void textBaseline(MemorySegment struct, int fieldValue) {
        struct.set(textBaseline$LAYOUT, textBaseline$OFFSET, fieldValue);
    }

    private static final OfDouble height$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("height"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double height
     * }
     */
    public static final OfDouble height$layout() {
        return height$LAYOUT;
    }

    private static final long height$OFFSET = 64;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double height
     * }
     */
    public static final long height$offset() {
        return height$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double height
     * }
     */
    public static double height(MemorySegment struct) {
        return struct.get(height$LAYOUT, height$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double height
     * }
     */
    public static void height(MemorySegment struct, double fieldValue) {
        struct.set(height$LAYOUT, height$OFFSET, fieldValue);
    }

    private static final OfInt leadingDistribution$LAYOUT = (OfInt)$LAYOUT.select(groupElement("leadingDistribution"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int leadingDistribution
     * }
     */
    public static final OfInt leadingDistribution$layout() {
        return leadingDistribution$LAYOUT;
    }

    private static final long leadingDistribution$OFFSET = 72;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int leadingDistribution
     * }
     */
    public static final long leadingDistribution$offset() {
        return leadingDistribution$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int leadingDistribution
     * }
     */
    public static int leadingDistribution(MemorySegment struct) {
        return struct.get(leadingDistribution$LAYOUT, leadingDistribution$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int leadingDistribution
     * }
     */
    public static void leadingDistribution(MemorySegment struct, int fieldValue) {
        struct.set(leadingDistribution$LAYOUT, leadingDistribution$OFFSET, fieldValue);
    }

    private static final OfInt decorationColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("decorationColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj decorationColor
     * }
     */
    public static final OfInt decorationColor$layout() {
        return decorationColor$LAYOUT;
    }

    private static final long decorationColor$OFFSET = 76;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj decorationColor
     * }
     */
    public static final long decorationColor$offset() {
        return decorationColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj decorationColor
     * }
     */
    public static int decorationColor(MemorySegment struct) {
        return struct.get(decorationColor$LAYOUT, decorationColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj decorationColor
     * }
     */
    public static void decorationColor(MemorySegment struct, int fieldValue) {
        struct.set(decorationColor$LAYOUT, decorationColor$OFFSET, fieldValue);
    }

    private static final OfInt decorationStyle$LAYOUT = (OfInt)$LAYOUT.select(groupElement("decorationStyle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int decorationStyle
     * }
     */
    public static final OfInt decorationStyle$layout() {
        return decorationStyle$LAYOUT;
    }

    private static final long decorationStyle$OFFSET = 80;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int decorationStyle
     * }
     */
    public static final long decorationStyle$offset() {
        return decorationStyle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int decorationStyle
     * }
     */
    public static int decorationStyle(MemorySegment struct) {
        return struct.get(decorationStyle$LAYOUT, decorationStyle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int decorationStyle
     * }
     */
    public static void decorationStyle(MemorySegment struct, int fieldValue) {
        struct.set(decorationStyle$LAYOUT, decorationStyle$OFFSET, fieldValue);
    }

    private static final OfDouble decorationThickness$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("decorationThickness"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double decorationThickness
     * }
     */
    public static final OfDouble decorationThickness$layout() {
        return decorationThickness$LAYOUT;
    }

    private static final long decorationThickness$OFFSET = 88;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double decorationThickness
     * }
     */
    public static final long decorationThickness$offset() {
        return decorationThickness$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double decorationThickness
     * }
     */
    public static double decorationThickness(MemorySegment struct) {
        return struct.get(decorationThickness$LAYOUT, decorationThickness$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double decorationThickness
     * }
     */
    public static void decorationThickness(MemorySegment struct, double fieldValue) {
        struct.set(decorationThickness$LAYOUT, decorationThickness$OFFSET, fieldValue);
    }

    private static final AddressLayout debugLabel$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("debugLabel"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char *debugLabel
     * }
     */
    public static final AddressLayout debugLabel$layout() {
        return debugLabel$LAYOUT;
    }

    private static final long debugLabel$OFFSET = 96;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char *debugLabel
     * }
     */
    public static final long debugLabel$offset() {
        return debugLabel$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char *debugLabel
     * }
     */
    public static MemorySegment debugLabel(MemorySegment struct) {
        return struct.get(debugLabel$LAYOUT, debugLabel$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char *debugLabel
     * }
     */
    public static void debugLabel(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(debugLabel$LAYOUT, debugLabel$OFFSET, fieldValue);
    }

    private static final OfInt overflow$LAYOUT = (OfInt)$LAYOUT.select(groupElement("overflow"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int overflow
     * }
     */
    public static final OfInt overflow$layout() {
        return overflow$LAYOUT;
    }

    private static final long overflow$OFFSET = 104;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int overflow
     * }
     */
    public static final long overflow$offset() {
        return overflow$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int overflow
     * }
     */
    public static int overflow(MemorySegment struct) {
        return struct.get(overflow$LAYOUT, overflow$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int overflow
     * }
     */
    public static void overflow(MemorySegment struct, int fieldValue) {
        struct.set(overflow$LAYOUT, overflow$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

