// Generated by jextract

package dev.equo.ewt.ffm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     int id;
 *     char *data;
 *     DartObj textSpan;
 *     TextStyleObjSt style;
 *     int textAlign;
 *     int textDirection;
 *     int softWrap;
 *     int overflow;
 *     double textScaleFactor;
 *     int maxLines;
 *     char *semanticsLabel;
 *     char *semanticsIdentifier;
 *     int textWidthBasis;
 *     DartObj selectionColor;
 * }
 * }
 */
public class TextObjSt {

    TextObjSt() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        StarterBridge.C_INT.withName("id"),
        MemoryLayout.paddingLayout(4),
        StarterBridge.C_POINTER.withName("data"),
        StarterBridge.C_INT.withName("textSpan"),
        MemoryLayout.paddingLayout(4),
        TextStyleObjSt.layout().withName("style"),
        StarterBridge.C_INT.withName("textAlign"),
        StarterBridge.C_INT.withName("textDirection"),
        StarterBridge.C_INT.withName("softWrap"),
        StarterBridge.C_INT.withName("overflow"),
        StarterBridge.C_DOUBLE.withName("textScaleFactor"),
        StarterBridge.C_INT.withName("maxLines"),
        MemoryLayout.paddingLayout(4),
        StarterBridge.C_POINTER.withName("semanticsLabel"),
        StarterBridge.C_POINTER.withName("semanticsIdentifier"),
        StarterBridge.C_INT.withName("textWidthBasis"),
        StarterBridge.C_INT.withName("selectionColor")
    ).withName("$anon$23:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt id$LAYOUT = (OfInt)$LAYOUT.select(groupElement("id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final OfInt id$layout() {
        return id$LAYOUT;
    }

    private static final long id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final long id$offset() {
        return id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static int id(MemorySegment struct) {
        return struct.get(id$LAYOUT, id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static void id(MemorySegment struct, int fieldValue) {
        struct.set(id$LAYOUT, id$OFFSET, fieldValue);
    }

    private static final AddressLayout data$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("data"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char *data
     * }
     */
    public static final AddressLayout data$layout() {
        return data$LAYOUT;
    }

    private static final long data$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char *data
     * }
     */
    public static final long data$offset() {
        return data$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char *data
     * }
     */
    public static MemorySegment data(MemorySegment struct) {
        return struct.get(data$LAYOUT, data$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char *data
     * }
     */
    public static void data(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(data$LAYOUT, data$OFFSET, fieldValue);
    }

    private static final OfInt textSpan$LAYOUT = (OfInt)$LAYOUT.select(groupElement("textSpan"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj textSpan
     * }
     */
    public static final OfInt textSpan$layout() {
        return textSpan$LAYOUT;
    }

    private static final long textSpan$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj textSpan
     * }
     */
    public static final long textSpan$offset() {
        return textSpan$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj textSpan
     * }
     */
    public static int textSpan(MemorySegment struct) {
        return struct.get(textSpan$LAYOUT, textSpan$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj textSpan
     * }
     */
    public static void textSpan(MemorySegment struct, int fieldValue) {
        struct.set(textSpan$LAYOUT, textSpan$OFFSET, fieldValue);
    }

    private static final GroupLayout style$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("style"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * TextStyleObjSt style
     * }
     */
    public static final GroupLayout style$layout() {
        return style$LAYOUT;
    }

    private static final long style$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * TextStyleObjSt style
     * }
     */
    public static final long style$offset() {
        return style$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * TextStyleObjSt style
     * }
     */
    public static MemorySegment style(MemorySegment struct) {
        return struct.asSlice(style$OFFSET, style$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * TextStyleObjSt style
     * }
     */
    public static void style(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, style$OFFSET, style$LAYOUT.byteSize());
    }

    private static final OfInt textAlign$LAYOUT = (OfInt)$LAYOUT.select(groupElement("textAlign"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int textAlign
     * }
     */
    public static final OfInt textAlign$layout() {
        return textAlign$LAYOUT;
    }

    private static final long textAlign$OFFSET = 136;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int textAlign
     * }
     */
    public static final long textAlign$offset() {
        return textAlign$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int textAlign
     * }
     */
    public static int textAlign(MemorySegment struct) {
        return struct.get(textAlign$LAYOUT, textAlign$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int textAlign
     * }
     */
    public static void textAlign(MemorySegment struct, int fieldValue) {
        struct.set(textAlign$LAYOUT, textAlign$OFFSET, fieldValue);
    }

    private static final OfInt textDirection$LAYOUT = (OfInt)$LAYOUT.select(groupElement("textDirection"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int textDirection
     * }
     */
    public static final OfInt textDirection$layout() {
        return textDirection$LAYOUT;
    }

    private static final long textDirection$OFFSET = 140;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int textDirection
     * }
     */
    public static final long textDirection$offset() {
        return textDirection$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int textDirection
     * }
     */
    public static int textDirection(MemorySegment struct) {
        return struct.get(textDirection$LAYOUT, textDirection$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int textDirection
     * }
     */
    public static void textDirection(MemorySegment struct, int fieldValue) {
        struct.set(textDirection$LAYOUT, textDirection$OFFSET, fieldValue);
    }

    private static final OfInt softWrap$LAYOUT = (OfInt)$LAYOUT.select(groupElement("softWrap"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int softWrap
     * }
     */
    public static final OfInt softWrap$layout() {
        return softWrap$LAYOUT;
    }

    private static final long softWrap$OFFSET = 144;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int softWrap
     * }
     */
    public static final long softWrap$offset() {
        return softWrap$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int softWrap
     * }
     */
    public static int softWrap(MemorySegment struct) {
        return struct.get(softWrap$LAYOUT, softWrap$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int softWrap
     * }
     */
    public static void softWrap(MemorySegment struct, int fieldValue) {
        struct.set(softWrap$LAYOUT, softWrap$OFFSET, fieldValue);
    }

    private static final OfInt overflow$LAYOUT = (OfInt)$LAYOUT.select(groupElement("overflow"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int overflow
     * }
     */
    public static final OfInt overflow$layout() {
        return overflow$LAYOUT;
    }

    private static final long overflow$OFFSET = 148;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int overflow
     * }
     */
    public static final long overflow$offset() {
        return overflow$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int overflow
     * }
     */
    public static int overflow(MemorySegment struct) {
        return struct.get(overflow$LAYOUT, overflow$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int overflow
     * }
     */
    public static void overflow(MemorySegment struct, int fieldValue) {
        struct.set(overflow$LAYOUT, overflow$OFFSET, fieldValue);
    }

    private static final OfDouble textScaleFactor$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("textScaleFactor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double textScaleFactor
     * }
     */
    public static final OfDouble textScaleFactor$layout() {
        return textScaleFactor$LAYOUT;
    }

    private static final long textScaleFactor$OFFSET = 152;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double textScaleFactor
     * }
     */
    public static final long textScaleFactor$offset() {
        return textScaleFactor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double textScaleFactor
     * }
     */
    public static double textScaleFactor(MemorySegment struct) {
        return struct.get(textScaleFactor$LAYOUT, textScaleFactor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double textScaleFactor
     * }
     */
    public static void textScaleFactor(MemorySegment struct, double fieldValue) {
        struct.set(textScaleFactor$LAYOUT, textScaleFactor$OFFSET, fieldValue);
    }

    private static final OfInt maxLines$LAYOUT = (OfInt)$LAYOUT.select(groupElement("maxLines"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int maxLines
     * }
     */
    public static final OfInt maxLines$layout() {
        return maxLines$LAYOUT;
    }

    private static final long maxLines$OFFSET = 160;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int maxLines
     * }
     */
    public static final long maxLines$offset() {
        return maxLines$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int maxLines
     * }
     */
    public static int maxLines(MemorySegment struct) {
        return struct.get(maxLines$LAYOUT, maxLines$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int maxLines
     * }
     */
    public static void maxLines(MemorySegment struct, int fieldValue) {
        struct.set(maxLines$LAYOUT, maxLines$OFFSET, fieldValue);
    }

    private static final AddressLayout semanticsLabel$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("semanticsLabel"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char *semanticsLabel
     * }
     */
    public static final AddressLayout semanticsLabel$layout() {
        return semanticsLabel$LAYOUT;
    }

    private static final long semanticsLabel$OFFSET = 168;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char *semanticsLabel
     * }
     */
    public static final long semanticsLabel$offset() {
        return semanticsLabel$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char *semanticsLabel
     * }
     */
    public static MemorySegment semanticsLabel(MemorySegment struct) {
        return struct.get(semanticsLabel$LAYOUT, semanticsLabel$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char *semanticsLabel
     * }
     */
    public static void semanticsLabel(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(semanticsLabel$LAYOUT, semanticsLabel$OFFSET, fieldValue);
    }

    private static final AddressLayout semanticsIdentifier$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("semanticsIdentifier"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char *semanticsIdentifier
     * }
     */
    public static final AddressLayout semanticsIdentifier$layout() {
        return semanticsIdentifier$LAYOUT;
    }

    private static final long semanticsIdentifier$OFFSET = 176;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char *semanticsIdentifier
     * }
     */
    public static final long semanticsIdentifier$offset() {
        return semanticsIdentifier$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char *semanticsIdentifier
     * }
     */
    public static MemorySegment semanticsIdentifier(MemorySegment struct) {
        return struct.get(semanticsIdentifier$LAYOUT, semanticsIdentifier$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char *semanticsIdentifier
     * }
     */
    public static void semanticsIdentifier(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(semanticsIdentifier$LAYOUT, semanticsIdentifier$OFFSET, fieldValue);
    }

    private static final OfInt textWidthBasis$LAYOUT = (OfInt)$LAYOUT.select(groupElement("textWidthBasis"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int textWidthBasis
     * }
     */
    public static final OfInt textWidthBasis$layout() {
        return textWidthBasis$LAYOUT;
    }

    private static final long textWidthBasis$OFFSET = 184;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int textWidthBasis
     * }
     */
    public static final long textWidthBasis$offset() {
        return textWidthBasis$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int textWidthBasis
     * }
     */
    public static int textWidthBasis(MemorySegment struct) {
        return struct.get(textWidthBasis$LAYOUT, textWidthBasis$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int textWidthBasis
     * }
     */
    public static void textWidthBasis(MemorySegment struct, int fieldValue) {
        struct.set(textWidthBasis$LAYOUT, textWidthBasis$OFFSET, fieldValue);
    }

    private static final OfInt selectionColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("selectionColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj selectionColor
     * }
     */
    public static final OfInt selectionColor$layout() {
        return selectionColor$LAYOUT;
    }

    private static final long selectionColor$OFFSET = 188;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj selectionColor
     * }
     */
    public static final long selectionColor$offset() {
        return selectionColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj selectionColor
     * }
     */
    public static int selectionColor(MemorySegment struct) {
        return struct.get(selectionColor$LAYOUT, selectionColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj selectionColor
     * }
     */
    public static void selectionColor(MemorySegment struct, int fieldValue) {
        struct.set(selectionColor$LAYOUT, selectionColor$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

