// Generated by jextract

package dev.equo.ewt.ffm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     int id;
 *     InputDecorationObjSt decoration;
 *     int textInputAction;
 *     int textCapitalization;
 *     TextStyleObjSt style;
 *     int textAlign;
 *     int textDirection;
 *     int autofocus;
 *     char *obscuringCharacter;
 *     int obscureText;
 *     int autocorrect;
 *     int smartDashesType;
 *     int smartQuotesType;
 *     int enableSuggestions;
 *     int maxLines;
 *     int minLines;
 *     int expands;
 *     int readOnly;
 *     int showCursor;
 *     int maxLength;
 *     int maxLengthEnforcement;
 *     int enabled;
 *     int ignorePointers;
 *     double cursorWidth;
 *     double cursorHeight;
 *     DartObj cursorRadius;
 *     int cursorOpacityAnimates;
 *     DartObj cursorColor;
 *     DartObj cursorErrorColor;
 *     int selectionHeightStyle;
 *     int selectionWidthStyle;
 *     int keyboardAppearance;
 *     EdgeInsetsObjSt scrollPadding;
 *     int enableInteractiveSelection;
 *     int selectAllOnFocus;
 *     int dragStartBehavior;
 *     int onTapAlwaysCalled;
 *     int clipBehavior;
 *     char *restorationId;
 *     int scribbleEnabled;
 *     int stylusHandwritingEnabled;
 *     int enableIMEPersonalizedLearning;
 *     int canRequestFocus;
 *     int selectionEnabled;
 * }
 * }
 */
public class TextFieldObjSt {

    TextFieldObjSt() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        StarterBridge.C_INT.withName("id"),
        MemoryLayout.paddingLayout(4),
        InputDecorationObjSt.layout().withName("decoration"),
        StarterBridge.C_INT.withName("textInputAction"),
        StarterBridge.C_INT.withName("textCapitalization"),
        TextStyleObjSt.layout().withName("style"),
        StarterBridge.C_INT.withName("textAlign"),
        StarterBridge.C_INT.withName("textDirection"),
        StarterBridge.C_INT.withName("autofocus"),
        MemoryLayout.paddingLayout(4),
        StarterBridge.C_POINTER.withName("obscuringCharacter"),
        StarterBridge.C_INT.withName("obscureText"),
        StarterBridge.C_INT.withName("autocorrect"),
        StarterBridge.C_INT.withName("smartDashesType"),
        StarterBridge.C_INT.withName("smartQuotesType"),
        StarterBridge.C_INT.withName("enableSuggestions"),
        StarterBridge.C_INT.withName("maxLines"),
        StarterBridge.C_INT.withName("minLines"),
        StarterBridge.C_INT.withName("expands"),
        StarterBridge.C_INT.withName("readOnly"),
        StarterBridge.C_INT.withName("showCursor"),
        StarterBridge.C_INT.withName("maxLength"),
        StarterBridge.C_INT.withName("maxLengthEnforcement"),
        StarterBridge.C_INT.withName("enabled"),
        StarterBridge.C_INT.withName("ignorePointers"),
        StarterBridge.C_DOUBLE.withName("cursorWidth"),
        StarterBridge.C_DOUBLE.withName("cursorHeight"),
        StarterBridge.C_INT.withName("cursorRadius"),
        StarterBridge.C_INT.withName("cursorOpacityAnimates"),
        StarterBridge.C_INT.withName("cursorColor"),
        StarterBridge.C_INT.withName("cursorErrorColor"),
        StarterBridge.C_INT.withName("selectionHeightStyle"),
        StarterBridge.C_INT.withName("selectionWidthStyle"),
        StarterBridge.C_INT.withName("keyboardAppearance"),
        MemoryLayout.paddingLayout(4),
        EdgeInsetsObjSt.layout().withName("scrollPadding"),
        StarterBridge.C_INT.withName("enableInteractiveSelection"),
        StarterBridge.C_INT.withName("selectAllOnFocus"),
        StarterBridge.C_INT.withName("dragStartBehavior"),
        StarterBridge.C_INT.withName("onTapAlwaysCalled"),
        StarterBridge.C_INT.withName("clipBehavior"),
        MemoryLayout.paddingLayout(4),
        StarterBridge.C_POINTER.withName("restorationId"),
        StarterBridge.C_INT.withName("scribbleEnabled"),
        StarterBridge.C_INT.withName("stylusHandwritingEnabled"),
        StarterBridge.C_INT.withName("enableIMEPersonalizedLearning"),
        StarterBridge.C_INT.withName("canRequestFocus"),
        StarterBridge.C_INT.withName("selectionEnabled"),
        MemoryLayout.paddingLayout(4)
    ).withName("$anon$752:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt id$LAYOUT = (OfInt)$LAYOUT.select(groupElement("id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final OfInt id$layout() {
        return id$LAYOUT;
    }

    private static final long id$OFFSET = $LAYOUT.byteOffset(groupElement("id"));

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final long id$offset() {
        return id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static int id(MemorySegment struct) {
        return struct.get(id$LAYOUT, id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
