// Generated by jextract

package dev.equo.ewt.ffm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     int id;
 *     TextStyleObjSt displayLarge;
 *     TextStyleObjSt displayMedium;
 *     TextStyleObjSt displaySmall;
 *     TextStyleObjSt headlineLarge;
 *     TextStyleObjSt headlineMedium;
 *     TextStyleObjSt headlineSmall;
 *     TextStyleObjSt titleLarge;
 *     TextStyleObjSt titleMedium;
 *     TextStyleObjSt titleSmall;
 *     TextStyleObjSt bodyLarge;
 *     TextStyleObjSt bodyMedium;
 *     TextStyleObjSt bodySmall;
 *     TextStyleObjSt labelLarge;
 *     TextStyleObjSt labelMedium;
 *     TextStyleObjSt labelSmall;
 * }
 * }
 */
public class TextThemeObjSt {

    TextThemeObjSt() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        StarterBridge.C_INT.withName("id"),
        MemoryLayout.paddingLayout(4),
        TextStyleObjSt.layout().withName("displayLarge"),
        TextStyleObjSt.layout().withName("displayMedium"),
        TextStyleObjSt.layout().withName("displaySmall"),
        TextStyleObjSt.layout().withName("headlineLarge"),
        TextStyleObjSt.layout().withName("headlineMedium"),
        TextStyleObjSt.layout().withName("headlineSmall"),
        TextStyleObjSt.layout().withName("titleLarge"),
        TextStyleObjSt.layout().withName("titleMedium"),
        TextStyleObjSt.layout().withName("titleSmall"),
        TextStyleObjSt.layout().withName("bodyLarge"),
        TextStyleObjSt.layout().withName("bodyMedium"),
        TextStyleObjSt.layout().withName("bodySmall"),
        TextStyleObjSt.layout().withName("labelLarge"),
        TextStyleObjSt.layout().withName("labelMedium"),
        TextStyleObjSt.layout().withName("labelSmall")
    ).withName("$anon$391:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt id$LAYOUT = (OfInt)$LAYOUT.select(groupElement("id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final OfInt id$layout() {
        return id$LAYOUT;
    }

    private static final long id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final long id$offset() {
        return id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static int id(MemorySegment struct) {
        return struct.get(id$LAYOUT, id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static void id(MemorySegment struct, int fieldValue) {
        struct.set(id$LAYOUT, id$OFFSET, fieldValue);
    }

    private static final GroupLayout displayLarge$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("displayLarge"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * TextStyleObjSt displayLarge
     * }
     */
    public static final GroupLayout displayLarge$layout() {
        return displayLarge$LAYOUT;
    }

    private static final long displayLarge$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * TextStyleObjSt displayLarge
     * }
     */
    public static final long displayLarge$offset() {
        return displayLarge$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * TextStyleObjSt displayLarge
     * }
     */
    public static MemorySegment displayLarge(MemorySegment struct) {
        return struct.asSlice(displayLarge$OFFSET, displayLarge$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * TextStyleObjSt displayLarge
     * }
     */
    public static void displayLarge(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, displayLarge$OFFSET, displayLarge$LAYOUT.byteSize());
    }

    private static final GroupLayout displayMedium$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("displayMedium"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * TextStyleObjSt displayMedium
     * }
     */
    public static final GroupLayout displayMedium$layout() {
        return displayMedium$LAYOUT;
    }

    private static final long displayMedium$OFFSET = 120;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * TextStyleObjSt displayMedium
     * }
     */
    public static final long displayMedium$offset() {
        return displayMedium$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * TextStyleObjSt displayMedium
     * }
     */
    public static MemorySegment displayMedium(MemorySegment struct) {
        return struct.asSlice(displayMedium$OFFSET, displayMedium$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * TextStyleObjSt displayMedium
     * }
     */
    public static void displayMedium(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, displayMedium$OFFSET, displayMedium$LAYOUT.byteSize());
    }

    private static final GroupLayout displaySmall$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("displaySmall"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * TextStyleObjSt displaySmall
     * }
     */
    public static final GroupLayout displaySmall$layout() {
        return displaySmall$LAYOUT;
    }

    private static final long displaySmall$OFFSET = 232;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * TextStyleObjSt displaySmall
     * }
     */
    public static final long displaySmall$offset() {
        return displaySmall$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * TextStyleObjSt displaySmall
     * }
     */
    public static MemorySegment displaySmall(MemorySegment struct) {
        return struct.asSlice(displaySmall$OFFSET, displaySmall$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * TextStyleObjSt displaySmall
     * }
     */
    public static void displaySmall(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, displaySmall$OFFSET, displaySmall$LAYOUT.byteSize());
    }

    private static final GroupLayout headlineLarge$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("headlineLarge"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * TextStyleObjSt headlineLarge
     * }
     */
    public static final GroupLayout headlineLarge$layout() {
        return headlineLarge$LAYOUT;
    }

    private static final long headlineLarge$OFFSET = 344;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * TextStyleObjSt headlineLarge
     * }
     */
    public static final long headlineLarge$offset() {
        return headlineLarge$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * TextStyleObjSt headlineLarge
     * }
     */
    public static MemorySegment headlineLarge(MemorySegment struct) {
        return struct.asSlice(headlineLarge$OFFSET, headlineLarge$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * TextStyleObjSt headlineLarge
     * }
     */
    public static void headlineLarge(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, headlineLarge$OFFSET, headlineLarge$LAYOUT.byteSize());
    }

    private static final GroupLayout headlineMedium$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("headlineMedium"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * TextStyleObjSt headlineMedium
     * }
     */
    public static final GroupLayout headlineMedium$layout() {
        return headlineMedium$LAYOUT;
    }

    private static final long headlineMedium$OFFSET = 456;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * TextStyleObjSt headlineMedium
     * }
     */
    public static final long headlineMedium$offset() {
        return headlineMedium$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * TextStyleObjSt headlineMedium
     * }
     */
    public static MemorySegment headlineMedium(MemorySegment struct) {
        return struct.asSlice(headlineMedium$OFFSET, headlineMedium$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * TextStyleObjSt headlineMedium
     * }
     */
    public static void headlineMedium(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, headlineMedium$OFFSET, headlineMedium$LAYOUT.byteSize());
    }

    private static final GroupLayout headlineSmall$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("headlineSmall"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * TextStyleObjSt headlineSmall
     * }
     */
    public static final GroupLayout headlineSmall$layout() {
        return headlineSmall$LAYOUT;
    }

    private static final long headlineSmall$OFFSET = 568;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * TextStyleObjSt headlineSmall
     * }
     */
    public static final long headlineSmall$offset() {
        return headlineSmall$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * TextStyleObjSt headlineSmall
     * }
     */
    public static MemorySegment headlineSmall(MemorySegment struct) {
        return struct.asSlice(headlineSmall$OFFSET, headlineSmall$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * TextStyleObjSt headlineSmall
     * }
     */
    public static void headlineSmall(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, headlineSmall$OFFSET, headlineSmall$LAYOUT.byteSize());
    }

    private static final GroupLayout titleLarge$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("titleLarge"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * TextStyleObjSt titleLarge
     * }
     */
    public static final GroupLayout titleLarge$layout() {
        return titleLarge$LAYOUT;
    }

    private static final long titleLarge$OFFSET = 680;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * TextStyleObjSt titleLarge
     * }
     */
    public static final long titleLarge$offset() {
        return titleLarge$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * TextStyleObjSt titleLarge
     * }
     */
    public static MemorySegment titleLarge(MemorySegment struct) {
        return struct.asSlice(titleLarge$OFFSET, titleLarge$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * TextStyleObjSt titleLarge
     * }
     */
    public static void titleLarge(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, titleLarge$OFFSET, titleLarge$LAYOUT.byteSize());
    }

    private static final GroupLayout titleMedium$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("titleMedium"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * TextStyleObjSt titleMedium
     * }
     */
    public static final GroupLayout titleMedium$layout() {
        return titleMedium$LAYOUT;
    }

    private static final long titleMedium$OFFSET = 792;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * TextStyleObjSt titleMedium
     * }
     */
    public static final long titleMedium$offset() {
        return titleMedium$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * TextStyleObjSt titleMedium
     * }
     */
    public static MemorySegment titleMedium(MemorySegment struct) {
        return struct.asSlice(titleMedium$OFFSET, titleMedium$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * TextStyleObjSt titleMedium
     * }
     */
    public static void titleMedium(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, titleMedium$OFFSET, titleMedium$LAYOUT.byteSize());
    }

    private static final GroupLayout titleSmall$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("titleSmall"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * TextStyleObjSt titleSmall
     * }
     */
    public static final GroupLayout titleSmall$layout() {
        return titleSmall$LAYOUT;
    }

    private static final long titleSmall$OFFSET = 904;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * TextStyleObjSt titleSmall
     * }
     */
    public static final long titleSmall$offset() {
        return titleSmall$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * TextStyleObjSt titleSmall
     * }
     */
    public static MemorySegment titleSmall(MemorySegment struct) {
        return struct.asSlice(titleSmall$OFFSET, titleSmall$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * TextStyleObjSt titleSmall
     * }
     */
    public static void titleSmall(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, titleSmall$OFFSET, titleSmall$LAYOUT.byteSize());
    }

    private static final GroupLayout bodyLarge$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("bodyLarge"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * TextStyleObjSt bodyLarge
     * }
     */
    public static final GroupLayout bodyLarge$layout() {
        return bodyLarge$LAYOUT;
    }

    private static final long bodyLarge$OFFSET = 1016;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * TextStyleObjSt bodyLarge
     * }
     */
    public static final long bodyLarge$offset() {
        return bodyLarge$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * TextStyleObjSt bodyLarge
     * }
     */
    public static MemorySegment bodyLarge(MemorySegment struct) {
        return struct.asSlice(bodyLarge$OFFSET, bodyLarge$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * TextStyleObjSt bodyLarge
     * }
     */
    public static void bodyLarge(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, bodyLarge$OFFSET, bodyLarge$LAYOUT.byteSize());
    }

    private static final GroupLayout bodyMedium$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("bodyMedium"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * TextStyleObjSt bodyMedium
     * }
     */
    public static final GroupLayout bodyMedium$layout() {
        return bodyMedium$LAYOUT;
    }

    private static final long bodyMedium$OFFSET = 1128;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * TextStyleObjSt bodyMedium
     * }
     */
    public static final long bodyMedium$offset() {
        return bodyMedium$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * TextStyleObjSt bodyMedium
     * }
     */
    public static MemorySegment bodyMedium(MemorySegment struct) {
        return struct.asSlice(bodyMedium$OFFSET, bodyMedium$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * TextStyleObjSt bodyMedium
     * }
     */
    public static void bodyMedium(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, bodyMedium$OFFSET, bodyMedium$LAYOUT.byteSize());
    }

    private static final GroupLayout bodySmall$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("bodySmall"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * TextStyleObjSt bodySmall
     * }
     */
    public static final GroupLayout bodySmall$layout() {
        return bodySmall$LAYOUT;
    }

    private static final long bodySmall$OFFSET = 1240;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * TextStyleObjSt bodySmall
     * }
     */
    public static final long bodySmall$offset() {
        return bodySmall$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * TextStyleObjSt bodySmall
     * }
     */
    public static MemorySegment bodySmall(MemorySegment struct) {
        return struct.asSlice(bodySmall$OFFSET, bodySmall$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * TextStyleObjSt bodySmall
     * }
     */
    public static void bodySmall(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, bodySmall$OFFSET, bodySmall$LAYOUT.byteSize());
    }

    private static final GroupLayout labelLarge$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("labelLarge"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * TextStyleObjSt labelLarge
     * }
     */
    public static final GroupLayout labelLarge$layout() {
        return labelLarge$LAYOUT;
    }

    private static final long labelLarge$OFFSET = 1352;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * TextStyleObjSt labelLarge
     * }
     */
    public static final long labelLarge$offset() {
        return labelLarge$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * TextStyleObjSt labelLarge
     * }
     */
    public static MemorySegment labelLarge(MemorySegment struct) {
        return struct.asSlice(labelLarge$OFFSET, labelLarge$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * TextStyleObjSt labelLarge
     * }
     */
    public static void labelLarge(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, labelLarge$OFFSET, labelLarge$LAYOUT.byteSize());
    }

    private static final GroupLayout labelMedium$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("labelMedium"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * TextStyleObjSt labelMedium
     * }
     */
    public static final GroupLayout labelMedium$layout() {
        return labelMedium$LAYOUT;
    }

    private static final long labelMedium$OFFSET = 1464;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * TextStyleObjSt labelMedium
     * }
     */
    public static final long labelMedium$offset() {
        return labelMedium$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * TextStyleObjSt labelMedium
     * }
     */
    public static MemorySegment labelMedium(MemorySegment struct) {
        return struct.asSlice(labelMedium$OFFSET, labelMedium$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * TextStyleObjSt labelMedium
     * }
     */
    public static void labelMedium(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, labelMedium$OFFSET, labelMedium$LAYOUT.byteSize());
    }

    private static final GroupLayout labelSmall$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("labelSmall"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * TextStyleObjSt labelSmall
     * }
     */
    public static final GroupLayout labelSmall$layout() {
        return labelSmall$LAYOUT;
    }

    private static final long labelSmall$OFFSET = 1576;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * TextStyleObjSt labelSmall
     * }
     */
    public static final long labelSmall$offset() {
        return labelSmall$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * TextStyleObjSt labelSmall
     * }
     */
    public static MemorySegment labelSmall(MemorySegment struct) {
        return struct.asSlice(labelSmall$OFFSET, labelSmall$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * TextStyleObjSt labelSmall
     * }
     */
    public static void labelSmall(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, labelSmall$OFFSET, labelSmall$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

