// Generated by jextract

package dev.equo.ewt.ffm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     int id;
 *     int applyElevationOverlayColor;
 *     int materialTapTargetSize;
 *     int platform;
 *     int useMaterial3;
 *     VisualDensityObjSt visualDensity;
 *     DartObj canvasColor;
 *     DartObj cardColor;
 *     ColorSchemeObjSt colorScheme;
 *     DartObj disabledColor;
 *     DartObj dividerColor;
 *     DartObj focusColor;
 *     DartObj highlightColor;
 *     DartObj hintColor;
 *     DartObj hoverColor;
 *     DartObj indicatorColor;
 *     DartObj primaryColor;
 *     DartObj primaryColorDark;
 *     DartObj primaryColorLight;
 *     DartObj scaffoldBackgroundColor;
 *     DartObj secondaryHeaderColor;
 *     DartObj shadowColor;
 *     DartObj splashColor;
 *     DartObj unselectedWidgetColor;
 *     TextThemeObjSt primaryTextTheme;
 *     TextThemeObjSt textTheme;
 *     DartObj dialogBackgroundColor;
 *     int brightness;
 * }
 * }
 */
public class ThemeDataObjSt {

    ThemeDataObjSt() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        StarterBridge.C_INT.withName("id"),
        StarterBridge.C_INT.withName("applyElevationOverlayColor"),
        StarterBridge.C_INT.withName("materialTapTargetSize"),
        StarterBridge.C_INT.withName("platform"),
        StarterBridge.C_INT.withName("useMaterial3"),
        MemoryLayout.paddingLayout(4),
        VisualDensityObjSt.layout().withName("visualDensity"),
        StarterBridge.C_INT.withName("canvasColor"),
        StarterBridge.C_INT.withName("cardColor"),
        ColorSchemeObjSt.layout().withName("colorScheme"),
        StarterBridge.C_INT.withName("disabledColor"),
        StarterBridge.C_INT.withName("dividerColor"),
        StarterBridge.C_INT.withName("focusColor"),
        StarterBridge.C_INT.withName("highlightColor"),
        StarterBridge.C_INT.withName("hintColor"),
        StarterBridge.C_INT.withName("hoverColor"),
        StarterBridge.C_INT.withName("indicatorColor"),
        StarterBridge.C_INT.withName("primaryColor"),
        StarterBridge.C_INT.withName("primaryColorDark"),
        StarterBridge.C_INT.withName("primaryColorLight"),
        StarterBridge.C_INT.withName("scaffoldBackgroundColor"),
        StarterBridge.C_INT.withName("secondaryHeaderColor"),
        StarterBridge.C_INT.withName("shadowColor"),
        StarterBridge.C_INT.withName("splashColor"),
        StarterBridge.C_INT.withName("unselectedWidgetColor"),
        TextThemeObjSt.layout().withName("primaryTextTheme"),
        TextThemeObjSt.layout().withName("textTheme"),
        StarterBridge.C_INT.withName("dialogBackgroundColor"),
        StarterBridge.C_INT.withName("brightness")
    ).withName("$anon$406:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt id$LAYOUT = (OfInt)$LAYOUT.select(groupElement("id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final OfInt id$layout() {
        return id$LAYOUT;
    }

    private static final long id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final long id$offset() {
        return id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static int id(MemorySegment struct) {
        return struct.get(id$LAYOUT, id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static void id(MemorySegment struct, int fieldValue) {
        struct.set(id$LAYOUT, id$OFFSET, fieldValue);
    }

    private static final OfInt applyElevationOverlayColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("applyElevationOverlayColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int applyElevationOverlayColor
     * }
     */
    public static final OfInt applyElevationOverlayColor$layout() {
        return applyElevationOverlayColor$LAYOUT;
    }

    private static final long applyElevationOverlayColor$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int applyElevationOverlayColor
     * }
     */
    public static final long applyElevationOverlayColor$offset() {
        return applyElevationOverlayColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int applyElevationOverlayColor
     * }
     */
    public static int applyElevationOverlayColor(MemorySegment struct) {
        return struct.get(applyElevationOverlayColor$LAYOUT, applyElevationOverlayColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int applyElevationOverlayColor
     * }
     */
    public static void applyElevationOverlayColor(MemorySegment struct, int fieldValue) {
        struct.set(applyElevationOverlayColor$LAYOUT, applyElevationOverlayColor$OFFSET, fieldValue);
    }

    private static final OfInt materialTapTargetSize$LAYOUT = (OfInt)$LAYOUT.select(groupElement("materialTapTargetSize"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int materialTapTargetSize
     * }
     */
    public static final OfInt materialTapTargetSize$layout() {
        return materialTapTargetSize$LAYOUT;
    }

    private static final long materialTapTargetSize$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int materialTapTargetSize
     * }
     */
    public static final long materialTapTargetSize$offset() {
        return materialTapTargetSize$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int materialTapTargetSize
     * }
     */
    public static int materialTapTargetSize(MemorySegment struct) {
        return struct.get(materialTapTargetSize$LAYOUT, materialTapTargetSize$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int materialTapTargetSize
     * }
     */
    public static void materialTapTargetSize(MemorySegment struct, int fieldValue) {
        struct.set(materialTapTargetSize$LAYOUT, materialTapTargetSize$OFFSET, fieldValue);
    }

    private static final OfInt platform$LAYOUT = (OfInt)$LAYOUT.select(groupElement("platform"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int platform
     * }
     */
    public static final OfInt platform$layout() {
        return platform$LAYOUT;
    }

    private static final long platform$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int platform
     * }
     */
    public static final long platform$offset() {
        return platform$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int platform
     * }
     */
    public static int platform(MemorySegment struct) {
        return struct.get(platform$LAYOUT, platform$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int platform
     * }
     */
    public static void platform(MemorySegment struct, int fieldValue) {
        struct.set(platform$LAYOUT, platform$OFFSET, fieldValue);
    }

    private static final OfInt useMaterial3$LAYOUT = (OfInt)$LAYOUT.select(groupElement("useMaterial3"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int useMaterial3
     * }
     */
    public static final OfInt useMaterial3$layout() {
        return useMaterial3$LAYOUT;
    }

    private static final long useMaterial3$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int useMaterial3
     * }
     */
    public static final long useMaterial3$offset() {
        return useMaterial3$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int useMaterial3
     * }
     */
    public static int useMaterial3(MemorySegment struct) {
        return struct.get(useMaterial3$LAYOUT, useMaterial3$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int useMaterial3
     * }
     */
    public static void useMaterial3(MemorySegment struct, int fieldValue) {
        struct.set(useMaterial3$LAYOUT, useMaterial3$OFFSET, fieldValue);
    }

    private static final GroupLayout visualDensity$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("visualDensity"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VisualDensityObjSt visualDensity
     * }
     */
    public static final GroupLayout visualDensity$layout() {
        return visualDensity$LAYOUT;
    }

    private static final long visualDensity$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VisualDensityObjSt visualDensity
     * }
     */
    public static final long visualDensity$offset() {
        return visualDensity$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VisualDensityObjSt visualDensity
     * }
     */
    public static MemorySegment visualDensity(MemorySegment struct) {
        return struct.asSlice(visualDensity$OFFSET, visualDensity$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VisualDensityObjSt visualDensity
     * }
     */
    public static void visualDensity(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, visualDensity$OFFSET, visualDensity$LAYOUT.byteSize());
    }

    private static final OfInt canvasColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("canvasColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj canvasColor
     * }
     */
    public static final OfInt canvasColor$layout() {
        return canvasColor$LAYOUT;
    }

    private static final long canvasColor$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj canvasColor
     * }
     */
    public static final long canvasColor$offset() {
        return canvasColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj canvasColor
     * }
     */
    public static int canvasColor(MemorySegment struct) {
        return struct.get(canvasColor$LAYOUT, canvasColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj canvasColor
     * }
     */
    public static void canvasColor(MemorySegment struct, int fieldValue) {
        struct.set(canvasColor$LAYOUT, canvasColor$OFFSET, fieldValue);
    }

    private static final OfInt cardColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("cardColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj cardColor
     * }
     */
    public static final OfInt cardColor$layout() {
        return cardColor$LAYOUT;
    }

    private static final long cardColor$OFFSET = 60;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj cardColor
     * }
     */
    public static final long cardColor$offset() {
        return cardColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj cardColor
     * }
     */
    public static int cardColor(MemorySegment struct) {
        return struct.get(cardColor$LAYOUT, cardColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj cardColor
     * }
     */
    public static void cardColor(MemorySegment struct, int fieldValue) {
        struct.set(cardColor$LAYOUT, cardColor$OFFSET, fieldValue);
    }

    private static final GroupLayout colorScheme$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("colorScheme"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ColorSchemeObjSt colorScheme
     * }
     */
    public static final GroupLayout colorScheme$layout() {
        return colorScheme$LAYOUT;
    }

    private static final long colorScheme$OFFSET = 64;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ColorSchemeObjSt colorScheme
     * }
     */
    public static final long colorScheme$offset() {
        return colorScheme$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ColorSchemeObjSt colorScheme
     * }
     */
    public static MemorySegment colorScheme(MemorySegment struct) {
        return struct.asSlice(colorScheme$OFFSET, colorScheme$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ColorSchemeObjSt colorScheme
     * }
     */
    public static void colorScheme(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, colorScheme$OFFSET, colorScheme$LAYOUT.byteSize());
    }

    private static final OfInt disabledColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("disabledColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj disabledColor
     * }
     */
    public static final OfInt disabledColor$layout() {
        return disabledColor$LAYOUT;
    }

    private static final long disabledColor$OFFSET = 268;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj disabledColor
     * }
     */
    public static final long disabledColor$offset() {
        return disabledColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj disabledColor
     * }
     */
    public static int disabledColor(MemorySegment struct) {
        return struct.get(disabledColor$LAYOUT, disabledColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj disabledColor
     * }
     */
    public static void disabledColor(MemorySegment struct, int fieldValue) {
        struct.set(disabledColor$LAYOUT, disabledColor$OFFSET, fieldValue);
    }

    private static final OfInt dividerColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("dividerColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj dividerColor
     * }
     */
    public static final OfInt dividerColor$layout() {
        return dividerColor$LAYOUT;
    }

    private static final long dividerColor$OFFSET = 272;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj dividerColor
     * }
     */
    public static final long dividerColor$offset() {
        return dividerColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj dividerColor
     * }
     */
    public static int dividerColor(MemorySegment struct) {
        return struct.get(dividerColor$LAYOUT, dividerColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj dividerColor
     * }
     */
    public static void dividerColor(MemorySegment struct, int fieldValue) {
        struct.set(dividerColor$LAYOUT, dividerColor$OFFSET, fieldValue);
    }

    private static final OfInt focusColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("focusColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj focusColor
     * }
     */
    public static final OfInt focusColor$layout() {
        return focusColor$LAYOUT;
    }

    private static final long focusColor$OFFSET = 276;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj focusColor
     * }
     */
    public static final long focusColor$offset() {
        return focusColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj focusColor
     * }
     */
    public static int focusColor(MemorySegment struct) {
        return struct.get(focusColor$LAYOUT, focusColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj focusColor
     * }
     */
    public static void focusColor(MemorySegment struct, int fieldValue) {
        struct.set(focusColor$LAYOUT, focusColor$OFFSET, fieldValue);
    }

    private static final OfInt highlightColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("highlightColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj highlightColor
     * }
     */
    public static final OfInt highlightColor$layout() {
        return highlightColor$LAYOUT;
    }

    private static final long highlightColor$OFFSET = 280;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj highlightColor
     * }
     */
    public static final long highlightColor$offset() {
        return highlightColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj highlightColor
     * }
     */
    public static int highlightColor(MemorySegment struct) {
        return struct.get(highlightColor$LAYOUT, highlightColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj highlightColor
     * }
     */
    public static void highlightColor(MemorySegment struct, int fieldValue) {
        struct.set(highlightColor$LAYOUT, highlightColor$OFFSET, fieldValue);
    }

    private static final OfInt hintColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("hintColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj hintColor
     * }
     */
    public static final OfInt hintColor$layout() {
        return hintColor$LAYOUT;
    }

    private static final long hintColor$OFFSET = 284;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj hintColor
     * }
     */
    public static final long hintColor$offset() {
        return hintColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj hintColor
     * }
     */
    public static int hintColor(MemorySegment struct) {
        return struct.get(hintColor$LAYOUT, hintColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj hintColor
     * }
     */
    public static void hintColor(MemorySegment struct, int fieldValue) {
        struct.set(hintColor$LAYOUT, hintColor$OFFSET, fieldValue);
    }

    private static final OfInt hoverColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("hoverColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj hoverColor
     * }
     */
    public static final OfInt hoverColor$layout() {
        return hoverColor$LAYOUT;
    }

    private static final long hoverColor$OFFSET = 288;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj hoverColor
     * }
     */
    public static final long hoverColor$offset() {
        return hoverColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj hoverColor
     * }
     */
    public static int hoverColor(MemorySegment struct) {
        return struct.get(hoverColor$LAYOUT, hoverColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj hoverColor
     * }
     */
    public static void hoverColor(MemorySegment struct, int fieldValue) {
        struct.set(hoverColor$LAYOUT, hoverColor$OFFSET, fieldValue);
    }

    private static final OfInt indicatorColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("indicatorColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj indicatorColor
     * }
     */
    public static final OfInt indicatorColor$layout() {
        return indicatorColor$LAYOUT;
    }

    private static final long indicatorColor$OFFSET = 292;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj indicatorColor
     * }
     */
    public static final long indicatorColor$offset() {
        return indicatorColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj indicatorColor
     * }
     */
    public static int indicatorColor(MemorySegment struct) {
        return struct.get(indicatorColor$LAYOUT, indicatorColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj indicatorColor
     * }
     */
    public static void indicatorColor(MemorySegment struct, int fieldValue) {
        struct.set(indicatorColor$LAYOUT, indicatorColor$OFFSET, fieldValue);
    }

    private static final OfInt primaryColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("primaryColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj primaryColor
     * }
     */
    public static final OfInt primaryColor$layout() {
        return primaryColor$LAYOUT;
    }

    private static final long primaryColor$OFFSET = 296;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj primaryColor
     * }
     */
    public static final long primaryColor$offset() {
        return primaryColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj primaryColor
     * }
     */
    public static int primaryColor(MemorySegment struct) {
        return struct.get(primaryColor$LAYOUT, primaryColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj primaryColor
     * }
     */
    public static void primaryColor(MemorySegment struct, int fieldValue) {
        struct.set(primaryColor$LAYOUT, primaryColor$OFFSET, fieldValue);
    }

    private static final OfInt primaryColorDark$LAYOUT = (OfInt)$LAYOUT.select(groupElement("primaryColorDark"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj primaryColorDark
     * }
     */
    public static final OfInt primaryColorDark$layout() {
        return primaryColorDark$LAYOUT;
    }

    private static final long primaryColorDark$OFFSET = 300;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj primaryColorDark
     * }
     */
    public static final long primaryColorDark$offset() {
        return primaryColorDark$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj primaryColorDark
     * }
     */
    public static int primaryColorDark(MemorySegment struct) {
        return struct.get(primaryColorDark$LAYOUT, primaryColorDark$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj primaryColorDark
     * }
     */
    public static void primaryColorDark(MemorySegment struct, int fieldValue) {
        struct.set(primaryColorDark$LAYOUT, primaryColorDark$OFFSET, fieldValue);
    }

    private static final OfInt primaryColorLight$LAYOUT = (OfInt)$LAYOUT.select(groupElement("primaryColorLight"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj primaryColorLight
     * }
     */
    public static final OfInt primaryColorLight$layout() {
        return primaryColorLight$LAYOUT;
    }

    private static final long primaryColorLight$OFFSET = 304;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj primaryColorLight
     * }
     */
    public static final long primaryColorLight$offset() {
        return primaryColorLight$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj primaryColorLight
     * }
     */
    public static int primaryColorLight(MemorySegment struct) {
        return struct.get(primaryColorLight$LAYOUT, primaryColorLight$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj primaryColorLight
     * }
     */
    public static void primaryColorLight(MemorySegment struct, int fieldValue) {
        struct.set(primaryColorLight$LAYOUT, primaryColorLight$OFFSET, fieldValue);
    }

    private static final OfInt scaffoldBackgroundColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("scaffoldBackgroundColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj scaffoldBackgroundColor
     * }
     */
    public static final OfInt scaffoldBackgroundColor$layout() {
        return scaffoldBackgroundColor$LAYOUT;
    }

    private static final long scaffoldBackgroundColor$OFFSET = 308;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj scaffoldBackgroundColor
     * }
     */
    public static final long scaffoldBackgroundColor$offset() {
        return scaffoldBackgroundColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj scaffoldBackgroundColor
     * }
     */
    public static int scaffoldBackgroundColor(MemorySegment struct) {
        return struct.get(scaffoldBackgroundColor$LAYOUT, scaffoldBackgroundColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj scaffoldBackgroundColor
     * }
     */
    public static void scaffoldBackgroundColor(MemorySegment struct, int fieldValue) {
        struct.set(scaffoldBackgroundColor$LAYOUT, scaffoldBackgroundColor$OFFSET, fieldValue);
    }

    private static final OfInt secondaryHeaderColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("secondaryHeaderColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj secondaryHeaderColor
     * }
     */
    public static final OfInt secondaryHeaderColor$layout() {
        return secondaryHeaderColor$LAYOUT;
    }

    private static final long secondaryHeaderColor$OFFSET = 312;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj secondaryHeaderColor
     * }
     */
    public static final long secondaryHeaderColor$offset() {
        return secondaryHeaderColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj secondaryHeaderColor
     * }
     */
    public static int secondaryHeaderColor(MemorySegment struct) {
        return struct.get(secondaryHeaderColor$LAYOUT, secondaryHeaderColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj secondaryHeaderColor
     * }
     */
    public static void secondaryHeaderColor(MemorySegment struct, int fieldValue) {
        struct.set(secondaryHeaderColor$LAYOUT, secondaryHeaderColor$OFFSET, fieldValue);
    }

    private static final OfInt shadowColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("shadowColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj shadowColor
     * }
     */
    public static final OfInt shadowColor$layout() {
        return shadowColor$LAYOUT;
    }

    private static final long shadowColor$OFFSET = 316;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj shadowColor
     * }
     */
    public static final long shadowColor$offset() {
        return shadowColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj shadowColor
     * }
     */
    public static int shadowColor(MemorySegment struct) {
        return struct.get(shadowColor$LAYOUT, shadowColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj shadowColor
     * }
     */
    public static void shadowColor(MemorySegment struct, int fieldValue) {
        struct.set(shadowColor$LAYOUT, shadowColor$OFFSET, fieldValue);
    }

    private static final OfInt splashColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("splashColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj splashColor
     * }
     */
    public static final OfInt splashColor$layout() {
        return splashColor$LAYOUT;
    }

    private static final long splashColor$OFFSET = 320;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj splashColor
     * }
     */
    public static final long splashColor$offset() {
        return splashColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj splashColor
     * }
     */
    public static int splashColor(MemorySegment struct) {
        return struct.get(splashColor$LAYOUT, splashColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj splashColor
     * }
     */
    public static void splashColor(MemorySegment struct, int fieldValue) {
        struct.set(splashColor$LAYOUT, splashColor$OFFSET, fieldValue);
    }

    private static final OfInt unselectedWidgetColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("unselectedWidgetColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj unselectedWidgetColor
     * }
     */
    public static final OfInt unselectedWidgetColor$layout() {
        return unselectedWidgetColor$LAYOUT;
    }

    private static final long unselectedWidgetColor$OFFSET = 324;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj unselectedWidgetColor
     * }
     */
    public static final long unselectedWidgetColor$offset() {
        return unselectedWidgetColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj unselectedWidgetColor
     * }
     */
    public static int unselectedWidgetColor(MemorySegment struct) {
        return struct.get(unselectedWidgetColor$LAYOUT, unselectedWidgetColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj unselectedWidgetColor
     * }
     */
    public static void unselectedWidgetColor(MemorySegment struct, int fieldValue) {
        struct.set(unselectedWidgetColor$LAYOUT, unselectedWidgetColor$OFFSET, fieldValue);
    }

    private static final GroupLayout primaryTextTheme$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("primaryTextTheme"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * TextThemeObjSt primaryTextTheme
     * }
     */
    public static final GroupLayout primaryTextTheme$layout() {
        return primaryTextTheme$LAYOUT;
    }

    private static final long primaryTextTheme$OFFSET = 328;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * TextThemeObjSt primaryTextTheme
     * }
     */
    public static final long primaryTextTheme$offset() {
        return primaryTextTheme$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * TextThemeObjSt primaryTextTheme
     * }
     */
    public static MemorySegment primaryTextTheme(MemorySegment struct) {
        return struct.asSlice(primaryTextTheme$OFFSET, primaryTextTheme$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * TextThemeObjSt primaryTextTheme
     * }
     */
    public static void primaryTextTheme(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, primaryTextTheme$OFFSET, primaryTextTheme$LAYOUT.byteSize());
    }

    private static final GroupLayout textTheme$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("textTheme"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * TextThemeObjSt textTheme
     * }
     */
    public static final GroupLayout textTheme$layout() {
        return textTheme$LAYOUT;
    }

    private static final long textTheme$OFFSET = 2016;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * TextThemeObjSt textTheme
     * }
     */
    public static final long textTheme$offset() {
        return textTheme$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * TextThemeObjSt textTheme
     * }
     */
    public static MemorySegment textTheme(MemorySegment struct) {
        return struct.asSlice(textTheme$OFFSET, textTheme$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * TextThemeObjSt textTheme
     * }
     */
    public static void textTheme(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, textTheme$OFFSET, textTheme$LAYOUT.byteSize());
    }

    private static final OfInt dialogBackgroundColor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("dialogBackgroundColor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj dialogBackgroundColor
     * }
     */
    public static final OfInt dialogBackgroundColor$layout() {
        return dialogBackgroundColor$LAYOUT;
    }

    private static final long dialogBackgroundColor$OFFSET = 3704;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj dialogBackgroundColor
     * }
     */
    public static final long dialogBackgroundColor$offset() {
        return dialogBackgroundColor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj dialogBackgroundColor
     * }
     */
    public static int dialogBackgroundColor(MemorySegment struct) {
        return struct.get(dialogBackgroundColor$LAYOUT, dialogBackgroundColor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj dialogBackgroundColor
     * }
     */
    public static void dialogBackgroundColor(MemorySegment struct, int fieldValue) {
        struct.set(dialogBackgroundColor$LAYOUT, dialogBackgroundColor$OFFSET, fieldValue);
    }

    private static final OfInt brightness$LAYOUT = (OfInt)$LAYOUT.select(groupElement("brightness"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int brightness
     * }
     */
    public static final OfInt brightness$layout() {
        return brightness$LAYOUT;
    }

    private static final long brightness$OFFSET = 3708;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int brightness
     * }
     */
    public static final long brightness$offset() {
        return brightness$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int brightness
     * }
     */
    public static int brightness(MemorySegment struct) {
        return struct.get(brightness$LAYOUT, brightness$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int brightness
     * }
     */
    public static void brightness(MemorySegment struct, int fieldValue) {
        struct.set(brightness$LAYOUT, brightness$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
