// Generated by jextract

package dev.equo.ewt.ffm;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     int id;
 *     double horizontal;
 *     double vertical;
 *     DartObj baseSizeAdjustment;
 * }
 * }
 */
public class VisualDensityObjSt {

    VisualDensityObjSt() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        StarterBridge.C_INT.withName("id"),
        MemoryLayout.paddingLayout(4),
        StarterBridge.C_DOUBLE.withName("horizontal"),
        StarterBridge.C_DOUBLE.withName("vertical"),
        StarterBridge.C_INT.withName("baseSizeAdjustment"),
        MemoryLayout.paddingLayout(4)
    ).withName("$anon$399:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt id$LAYOUT = (OfInt)$LAYOUT.select(groupElement("id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final OfInt id$layout() {
        return id$LAYOUT;
    }

    private static final long id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static final long id$offset() {
        return id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static int id(MemorySegment struct) {
        return struct.get(id$LAYOUT, id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int id
     * }
     */
    public static void id(MemorySegment struct, int fieldValue) {
        struct.set(id$LAYOUT, id$OFFSET, fieldValue);
    }

    private static final OfDouble horizontal$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("horizontal"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double horizontal
     * }
     */
    public static final OfDouble horizontal$layout() {
        return horizontal$LAYOUT;
    }

    private static final long horizontal$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double horizontal
     * }
     */
    public static final long horizontal$offset() {
        return horizontal$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double horizontal
     * }
     */
    public static double horizontal(MemorySegment struct) {
        return struct.get(horizontal$LAYOUT, horizontal$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double horizontal
     * }
     */
    public static void horizontal(MemorySegment struct, double fieldValue) {
        struct.set(horizontal$LAYOUT, horizontal$OFFSET, fieldValue);
    }

    private static final OfDouble vertical$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("vertical"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double vertical
     * }
     */
    public static final OfDouble vertical$layout() {
        return vertical$LAYOUT;
    }

    private static final long vertical$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double vertical
     * }
     */
    public static final long vertical$offset() {
        return vertical$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double vertical
     * }
     */
    public static double vertical(MemorySegment struct) {
        return struct.get(vertical$LAYOUT, vertical$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double vertical
     * }
     */
    public static void vertical(MemorySegment struct, double fieldValue) {
        struct.set(vertical$LAYOUT, vertical$OFFSET, fieldValue);
    }

    private static final OfInt baseSizeAdjustment$LAYOUT = (OfInt)$LAYOUT.select(groupElement("baseSizeAdjustment"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DartObj baseSizeAdjustment
     * }
     */
    public static final OfInt baseSizeAdjustment$layout() {
        return baseSizeAdjustment$LAYOUT;
    }

    private static final long baseSizeAdjustment$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DartObj baseSizeAdjustment
     * }
     */
    public static final long baseSizeAdjustment$offset() {
        return baseSizeAdjustment$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DartObj baseSizeAdjustment
     * }
     */
    public static int baseSizeAdjustment(MemorySegment struct) {
        return struct.get(baseSizeAdjustment$LAYOUT, baseSizeAdjustment$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DartObj baseSizeAdjustment
     * }
     */
    public static void baseSizeAdjustment(MemorySegment struct, int fieldValue) {
        struct.set(baseSizeAdjustment$LAYOUT, baseSizeAdjustment$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

